// {Рарус adilas #1.0.0.2 -SonarQube 2021.04.23
#Область ОбработчикиСобытийОбъекта

Процедура ПриКопировании(ОбъектКопирования)
	
	ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	// {Рарус adilas #1.0.0.2 -Исправления по SonarQube 2021.04.23
	Если ОбменДанными.Загрузка Тогда
         Возврат;
	КонецЕсли; 
	// }Рарус adilas #1.0.0.2 -Исправления по SonarQube 2021.04.23
	
	// {Рарус adilas #16478 -"Ответственный" при создании Спортсмена. 2021.06.02
	УчетСпортсменовСервер.ЗаполнитьРеквизит(ЭтотОбъект, "Ответственный", ПараметрыСеанса.ТекущийПользователь);
	// }Рарус adilas #16478 -"Ответственный" при создании Спортсмена. 2021.06.02

КонецПроцедуры

#КонецОбласти