
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Владелец") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ФизическоеЛицо", Параметры.Владелец, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		ФизическоеЛицо = Параметры.Владелец; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование И ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Отказ = Истина;
		ОткрытьФорму("РегистрСведений.ДокументыФизическихЛиц.ФормаЗаписи",Новый Структура("ФизическоеЛицо",ФизическоеЛицо));
	КонецЕсли;	
	
КонецПроцедуры
