
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//{Рарус dotere #19013 -Убрал из за ошибки и отбор по организации не нужен 2021.08.18
	
	//Идентификатор = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(Отчет.КомпоновщикНастроек.Настройки["ПараметрыДанных"].НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация")));
	//ПараметрОрганизация = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
	//ПараметрОрганизация.Значение = Неопределено;
	//ПараметрОрганизация.Использование = Ложь;
	//ПараметрОрганизация.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	//Если ПользователюРольДоступна("Методист") И Не ПользователюРольДоступна("ПолныеПрава") Тогда
	//	ПараметрОрганизация.Значение = ТекущаяОрганизация();
	//	ПараметрОрганизация.Использование = Истина;
	//	ПараметрОрганизация.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//КонецЕсли;
	//
	//ИдентификаторВидСпортаПоРеестру = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(Отчет.КомпоновщикНастроек.Настройки["ПараметрыДанных"].НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидСпортаПоРеестру")));
	//ПараметрВидСпортаПоРеестру = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторВидСпортаПоРеестру);
	//
	//ИдентификаторВидСпорта = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(Отчет.КомпоновщикНастроек.Настройки["ПараметрыДанных"].НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидСпорта")));
	//ПараметрВидСпорта = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторВидСпорта);
	//
	//Если ПользователюРольДоступна("Методист") И Не ПользователюРольДоступна("ПолныеПрава") Тогда
	//	ПараметрВидСпортаПоРеестру.Использование = Ложь;
	//	ПараметрВидСпортаПоРеестру.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//Иначе
	//	ПараметрВидСпорта.Использование = Ложь;
	//	ПараметрВидСпорта.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;		
	//КонецЕсли;
	//
	////{Рарус ivaart IN-17956 Открытие отчёта с отбором 2021.08.18
	//Идентификатор = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(Отчет.КомпоновщикНастроек.Настройки["ПараметрыДанных"].НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Спортсмен")));
	//ПараметрСпортсмены = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
	//ПараметрСпортсмены.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	//ПараметрСпортсмены.Значение = Спортсмены;
	//Если Спортсмены.Количество()>0 Тогда
	//	ПараметрСпортсмены.Использование = Истина;
	//Иначе
	//	ПараметрСпортсмены.Использование = Ложь;
	//КонецЕсли;
	////}Рарус ivaart IN-17956 Открытие отчёта с отбором 2021.08.18
	
	//}Рарус dotere #19013 -Убрал из за ошибки и отбор по организации не нужен 2021.08.18
КонецПроцедуры

&НаСервере
Функция ТекущаяОрганизация()
	Возврат ПараметрыСеанса.ТекущаяОрганизация;
КонецФункции

&НаСервере
Функция ПользователюРольДоступна(РольИмя)
	Возврат РольДоступна(РольИмя);
КонецФункции

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки) 
	//{Рарус dotere #19013 -Убрал из за ошибки и отбор по организации не нужен 2021.08.18
	
	//Идентификатор = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(Отчет.КомпоновщикНастроек.Настройки["ПараметрыДанных"].НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация")));
	//ПараметрОрганизация = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
	//ПараметрОрганизация.Значение = Неопределено;
	//ПараметрОрганизация.Использование = Ложь;
	//ПараметрОрганизация.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	//Если ПользователюРольДоступна("Методист") И Не ПользователюРольДоступна("ПолныеПрава") Тогда
	//	ПараметрОрганизация.Значение = ТекущаяОрганизация();
	//	ПараметрОрганизация.Использование = Истина;
	//	ПараметрОрганизация.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//КонецЕсли;
	//
	//ИдентификаторВидСпортаПоРеестру = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(Отчет.КомпоновщикНастроек.Настройки["ПараметрыДанных"].НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидСпортаПоРеестру")));
	//ПараметрВидСпортаПоРеестру = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторВидСпортаПоРеестру);
	//
	//ИдентификаторВидСпорта = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(Отчет.КомпоновщикНастроек.Настройки["ПараметрыДанных"].НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидСпорта")));
	//ПараметрВидСпорта = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторВидСпорта);
	//
	//Если ПользователюРольДоступна("Методист") И Не ПользователюРольДоступна("ПолныеПрава") Тогда
	//	ПараметрВидСпортаПоРеестру.Использование = Ложь;
	//	ПараметрВидСпортаПоРеестру.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//Иначе
	//	ПараметрВидСпорта.Использование = Ложь;
	//	ПараметрВидСпорта.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;		
	//КонецЕсли;
	//
	////{Рарус ivaart IN-17956 Открытие отчёта с отбором 2021.08.18
	//Если Параметры.Свойство("Спортсмены") Тогда
	//	Спортсмены = Параметры.Спортсмены;
	//КонецЕсли;
	////}Рарус ivaart IN-17956 Открытие отчёта с отбором 2021.08.18
	
	//{Рарус dotere #19013 -Убрал из за ошибки и отбор по организации не нужен 2021.08.18
	
	//{Рарус dotere #19013 -Скрытие отборов для пользователей 2021.09.08
	// {Рарус dotere #SonarQube -1.0.0.4 2021.10.29
	Если РольДоступна("Методист") ИЛИ ПривилегированныйРежим() Тогда
		ПолеОтбораВидСпортаПоРеестру = Новый ПараметрКомпоновкиДанных("ВидСпортаПоРеестру");
		ПолеОтбораОрганизация = Новый ПараметрКомпоновкиДанных("Организация");
		СкрытиеОтбора(ПолеОтбораВидСпортаПоРеестру);
		СкрытиеОтбора(ПолеОтбораОрганизация);
    ИначеЕсли РольДоступна("Руководитель") ИЛИ ПривилегированныйРежим() Тогда
	    ПолеОтбораВидСпорта = Новый ПараметрКомпоновкиДанных("ВидСпорта");
		СкрытиеОтбора(ПолеОтбораВидСпорта);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкрытиеОтбора(ПолеОтбора)
	ЭлементОтбора = Неопределено;
    Для Каждого Отбор Из Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
        Если Отбор.Параметр = ПолеОтбора Тогда
			Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры
// }Рарус dotere #SonarQube -1.0.0.4 2021.10.29
//}Рарус dotere #19013 -Скрытие отборов для пользователей 2021.09.08

//&НаСервере
//Функция ЗаполнениеРасшифровкиНаСервере(Расшифровка)
//	
//	
//	КоллекцияРасшифровки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
//	КоллекцияПолей = КоллекцияРасшифровки.Элементы[Расшифровка].ПолучитьПоля();
//	Если КоллекцияПолей.Количество() > 0 Тогда
//		Возврат КоллекцияПолей[0].Значение;
//	КонецЕсли
//	
//	
//КонецФункции

//&НаКлиенте
//Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
//	//СтандартнаяОбработка = Ложь;
//	РезультатРасшифровки = ЗаполнениеРасшифровкиНаСервере(Расшифровка);
//КонецПроцедуры
