// {Рарус dotere #23028 -Скрывает организацию если не методист 2022.01.14
&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)
	ПараметрОрганизация = Настройки.ПараметрыДанных.Элементы[3];
	Если РольДоступна("Методист") И Не РольДоступна("ПолныеПрава") Тогда
		ПараметрОрганизация.Значение = ПараметрыСеанса.ТекущаяОрганизация;
	    ПараметрОрганизация.Использование = Истина;
	    ПараметрОрганизация.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Иначе
		ПараметрОрганизация.Значение = Неопределено;
	    ПараметрОрганизация.Использование = Ложь;
	    ПараметрОрганизация.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
	КонецЕсли;

КонецПроцедуры
// }Рарус dotere #23028 -Скрывает организацию если не методист 2022.01.14