
#Область СлужебныйПрограммныйИнтерфейс

// {Рарус adilas #-7879 -Регистр сведений "УчастникиСоревнованийОФПСдачаНормативов" 2020.07.08
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"          , ДокументСсылка);
	Запрос.УстановитьПараметр("Период"          , ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("УчебныйГод"      , ДокументСсылка.УчебныйГод);
	Запрос.УстановитьПараметр("Организация"     , ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("ВидСпорта"       , ДокументСсылка.ВидСпорта);
	Запрос.УстановитьПараметр("ДатаПроведения"  , ДокументСсылка.ДатаПроведения);
	Запрос.УстановитьПараметр("МестоПроведения" , ДокументСсылка.МестоПроведения);
	Запрос.УстановитьПараметр("ТипСоревнования" , ДокументСсылка.ТипСоревнования);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	""УчастникиСоревнованийОФПСдачаНормативов"" КАК ИмяРегистра_,
	                |	&Период КАК Период,
	                |	&УчебныйГод КАК УчебныйГод,
	                |	&Организация КАК Организация,
	                |	&ВидСпорта КАК ВидСпорта,
	                |	&ДатаПроведения КАК ДатаПроведения,
	                |	&МестоПроведения КАК МестоПроведения,
	                |	&ТипСоревнования КАК ТипСоревнования,
	                |	СоставУчастников.Спортсмен КАК Спортсмен,
	                |	СоставУчастников.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	                |	СоставУчастников.Тренер КАК Тренер,
	                |	СоставУчастников.Норматив КАК Норматив,
	                |	СоставУчастников.СтартовыйНомер КАК СтартовыйНомер
	                |ИЗ
	                |	Документ.СоревнованиеОФПСдачаНормативов.СоставУчастников КАК СоставУчастников
	                |ГДЕ
	                |	СоставУчастников.Ссылка = &Ссылка
	                |	И СоставУчастников.Норматив <> ЗНАЧЕНИЕ(справочник.нормативы.пустаяссылка)";
	
	
	ТаблицаУчастникиСоревнованийОФПСдачаНормативов = Запрос.Выполнить().Выгрузить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаУчастникиСоревнованийОФПСдачаНормативов", ТаблицаУчастникиСоревнованийОФПСдачаНормативов);
	
    ДополнительныеСвойства.Вставить("Отказ", Отказ);    
	
КонецПроцедуры	

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.СоревнованиеОФПСдачаНормативов.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.СоревнованиеОФПСдачаНормативов.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.СоревнованиеОФПСдачаНормативов.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

// }Рарус adilas #-7879 -Регистр сведений "УчастникиСоревнованийОФПСдачаНормативов" 2020.07.08

#КонецОбласти

 
