// {Рарус adilas #1.0.0.2 -Исправления по SonarQube 2021.04.23
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ПометкаУдаления Тогда
		УчебныйГодОбъект_ = ЭтотОбъект.УчебныйГод.ПолучитьОбъект();
		УчебныйГодОбъект_.ПометкаУдаления = Истина;
		УчебныйГодОбъект_.Записать();
	ИначеЕсли НЕ ЭтотОбъект.ПометкаУдаления И ЭтотОбъект.УчебныйГод.ПометкаУдаления Тогда
		УчебныйГодОбъект_ = ЭтотОбъект.УчебныйГод.ПолучитьОбъект();
		УчебныйГодОбъект_.ПометкаУдаления = Ложь;
		УчебныйГодОбъект_.Записать();
	КонецЕсли;
	
	УчетСпортсменовСервер.ЗаполнитьРеквизит(ЭтотОбъект, "Ответственный", ПараметрыСеанса.ТекущийПользователь);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли