
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    
    СписокСтатусов = Новый СписокЗначений;
    СписокСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаявленийНаПриемВСпортивноеУчреждение.Подготовлено"));
    СписокСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаявленийНаПриемВСпортивноеУчреждение.Принято"));
    СписокСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыЗаявленийНаПриемВСпортивноеУчреждение.Отменено"));
    
    ОписаниеОповещенияВыбораЭлемента = Новый ОписаниеОповещения("ВыбранВариантСтатуса",ЭтотОбъект,ПараметрКоманды);
    
    СписокСтатусов.ПоказатьВыборЭлемента(ОписаниеОповещенияВыбораЭлемента,"Выберите статус заявления",СписокСтатусов[1]);
    
КонецПроцедуры

&НаКлиенте
Процедура ВыбранВариантСтатуса(ВыбранноеЗначение, Документы) Экспорт
    
    Если ВыбранноеЗначение<>Неопределено Тогда
        
        Для каждого Документ Из Документы Цикл
                            
                РаботаСоСтатусамиДокументов.УстановитьСтатусЗаявления(Документ,ВыбранноеЗначение.Значение);
                            
        КонецЦикла; 
        
    КонецЕсли;
    
КонецПроцедуры
