
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Спортсмен") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Спортсмен", Параметры.Спортсмен, ВидСравненияКомпоновкиДанных.Равно);
		ТекущийСпортсмен = Параметры.Спортсмен;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование И ЗначениеЗаполнено(ТекущийСпортсмен) Тогда
		Отказ = истина;
		ОткрытьФорму("РегистрСведений.УчебныеУчрежденияСпортсменов.ФормаЗаписи", Новый Структура("Спортсмен",ТекущийСпортсмен));
	КонецЕсли;	
	
КонецПроцедуры
