
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Соревнование") Тогда
		ТекущееСоревнование = Параметры.Соревнование;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Соревнование",ТекущееСоревнование,ВидСравненияКомпоновкиДанных.Равно,Истина);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование Тогда
		Отказ = Истина;
		ОткрытьФорму("РегистрСведений.ВключениеСоревнованийВРейтинги.ФормаЗаписи", 
		   Новый Структура("Соревнование",ТекущееСоревнование),
		   ЭтаФорма,,,,,
		   РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
	
КонецПроцедуры
