// {Рарус ivaart IN-19101 Кадровая история тренеров. Обработка открытия записи регистра 2021.08.19
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Организация") И НЕ ПустаяСтрока(Параметры.Организация) тогда
		Запись.Организация = Параметры.Организация;
		Элементы.Организация.ТолькоПросмотр = Истина;
	ИначеЕсли Не ПустаяСтрока(Запись.Организация) и РольДоступна("Методист") тогда
		Элементы.Организация.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("Тренер") И НЕ ПустаяСтрока(Параметры.Тренер) тогда
		Запись.Тренер = Параметры.Тренер;
		Элементы.Тренер.ТолькоПросмотр = Истина;
	ИначеЕсли Не ПустаяСтрока(Запись.Тренер) и РольДоступна("Методист") тогда
		Элементы.Тренер.ТолькоПросмотр = Истина;
	КонецЕсли;
	// {Рарус dotere #22661 -Изменение вида записи 2021.12.08
	Если Запись.ВидСобытия = Перечисления.ВидыКадровыхСобытий.Увольнение Тогда
		Элементы.ТренерПреподователь.Видимость = Ложь;
		Элементы.ВидЗанятости.Видимость = Ложь;
	КонецЕсли
	// }Рарус dotere #22661 -Изменение вида записи 2021.12.08
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуТренера(Тренер)
	Возврат Тренер.Ссылка;
КонецФункции


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбнавлёнСтатусТренера"+СтрЗаменить(ПолучитьСсылкуТренера(Запись.Тренер), " ", ""));
КонецПроцедуры

// {Рарус dotere #22661 -Изменение вида записи 2021.12.08
&НаКлиенте
Процедура ВидСобытияПриИзменении(Элемент)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Если Запись.ВидСобытия = Перечисления.ВидыКадровыхСобытий.Увольнение Тогда
		Запись.ВидЗанятости = Перечисления.ВидЗанятости.ПустаяСсылка();
		Запись.ТренерПреподователь = Ложь;
		Элементы.ВидЗанятости.Видимость = Ложь;
		Элементы.ТренерПреподователь.Видимость = Ложь;
	Иначе
		Элементы.ВидЗанятости.Видимость = Истина;
		Элементы.ТренерПреподователь.Видимость = Истина;
		Запись.ВидЗанятости = Перечисления.ВидЗанятости.ОсновноеМестоРаботы;
	КонецЕсли
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Запись.ВидЗанятости.Пустая() И Не Запись.ВидСобытия = Перечисления.ВидыКадровыхСобытий.Увольнение Тогда
		Запись.ВидЗанятости = Перечисления.ВидЗанятости.ОсновноеМестоРаботы;
	КонецЕсли
КонецПроцедуры
// }Рарус dotere #22661 -Изменение вида записи 2021.12.08
// }Рарус ivaart IN-19101 Кадровая история тренеров. Обработка открытия записи регистра 2021.08.19