Функция ПолучитьТаблицуНеучтенныхСпортсменов(УчебныйГод, ВидСпорта, ВозрастнаяГруппа) Экспорт
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	Спортсмены.Ссылка КАК Спортсмен
	                |ПОМЕСТИТЬ ВТ_РазрешенныеСпортсмены
	                |ИЗ
	                |	Справочник.Спортсмены КАК Спортсмены
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	                |		ПО Спортсмены.ФизическоеЛицо = ФизическиеЛица.Ссылка
	                |ГДЕ
	                |	ГОД(ФизическиеЛица.ДатаРождения) >= &ГодРожденияОт
	                |	И ГОД(ФизическиеЛица.ДатаРождения) <= &ГодРожденияДо
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	СоставУчащихся.Спортсмен КАК Спортсмен
	                |ИЗ
	                |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(
	                |			&Дата,
	                |			Спортсмен В
	                |					(ВЫБРАТЬ
	                |						ВТ_РазрешенныеСпортсмены.Спортсмен
	                |					ИЗ
	                |						ВТ_РазрешенныеСпортсмены)
	                |				И ВидСпорта = &ВидСпорта) КАК СоставУчащихся";
	 Запрос.УстановитьПараметр("ГодРожденияОт", Год(УчебныйГод.ДатаНачала) - ВозрастнаяГруппа.ВозрастДо);
	 Запрос.УстановитьПараметр("ГодРожденияДо", Год(УчебныйГод.ДатаНачала) - ВозрастнаяГруппа.ВозрастОт);
	 Запрос.УстановитьПараметр("ВидСпорта"    , ВидСпорта);
	 Запрос.УстановитьПараметр("Дата"         , УчебныйГод.ДатаОкончания);
	
	 Возврат Запрос.Выполнить().Выгрузить();
	 
 КонецФункции