Функция ЗаполнитьДанныеПоУчебномуГоду(ДокументУправлениеУчебнымГодом) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УчебныйГод", ДокументУправлениеУчебнымГодом.УчебныйГод);
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	ФормированиеГруппы.Ссылка КАК Группа
	                |ИЗ
	                |	Документ.ФормированиеГруппы КАК ФормированиеГруппы
	                |ГДЕ
	                |	ФормированиеГруппы.УчебныйГод = &УчебныйГод";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	
 

 
	 