#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"                       , ДокументСсылка);
	Запрос.УстановитьПараметр("Период"                       , ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("УчебныйГод"		             , ДокументСсылка.УчебныйГод);
	Запрос.УстановитьПараметр("Организация"                  , ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("ВидСпорта"                    , ДокументСсылка.ВидСпорта);
	Запрос.УстановитьПараметр("МеждународнаяВозрастнаяГруппа", ДокументСсылка.МеждународнаяВозрастнаяГруппа);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	""МеждународныеВозрастныеГруппыПоУчебнымГодам"" КАК ИмяРегистра_,
	                |	&Период КАК Период,
					|	&УчебныйГод КАК УчебныйГод,
					|	&Организация КАК Организация,
					|	&ВидСпорта КАК ВидСпорта,
	                |	&МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	                |	УстановкаВозрастнойГруппыСпортсмены.Спортсмен КАК Спортсмен
	                |ИЗ
	                |	Документ.УстановкаМеждународнойВозрастнойГруппы.Спортсмены КАК УстановкаВозрастнойГруппыСпортсмены
	                |ГДЕ
	                |	УстановкаВозрастнойГруппыСпортсмены.Ссылка = &Ссылка";
	
	ТаблицаВозрастныеГруппыПоУчебнымГодам = Запрос.Выполнить().Выгрузить();
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаМеждународныеВозрастныеГруппы" , ТаблицаВозрастныеГруппыПоУчебнымГодам);
	
    ДополнительныеСвойства.Вставить("Отказ", Отказ);
	
КонецПроцедуры	

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.УстановкаМеждународнойВозрастнойГруппы.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.УстановкаМеждународнойВозрастнойГруппы.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.УстановкаМеждународнойВозрастнойГруппы.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
