
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"			, ДокументСсылка);
	Запрос.УстановитьПараметр("ВидДопуска"      , ДокументСсылка.ВидДопуска);
	Запрос.УстановитьПараметр("Организация"   	, ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("ВидСпорта"     	, ДокументСсылка.ВидСпорта);
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	""РегистрацияДопусковКСпортивнымСоревнованиям"" КАК ИмяРегистра_,
	                |	ДопускиУчастниковКСпортивнымСоревнованиямСпортсмены.Спортсмен КАК Спортсмен,
	                |	ДопускиУчастниковКСпортивнымСоревнованиямСпортсмены.ДатаПолученияДопуска КАК ДатаПолученияДопуска,
	                |	ДопускиУчастниковКСпортивнымСоревнованиямСпортсмены.ДействуетДо КАК ДействуетДо,
	                |	&ВидСпорта КАК ВидСпорта,
	                |	&Организация КАК Организация,
	                |	&ВидДопуска КАК ВидДопуска,
	                |	ДопускиУчастниковКСпортивнымСоревнованиямСпортсмены.ДатаПолученияДопуска КАК Период
	                |ИЗ
	                |	Документ.ДопускиУчастниковКСпортивнымСоревнованиям.Спортсмены КАК ДопускиУчастниковКСпортивнымСоревнованиямСпортсмены
	                |ГДЕ
	                |	ДопускиУчастниковКСпортивнымСоревнованиямСпортсмены.Ссылка = &Ссылка
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ДопускиУчастниковКСпортивнымСоревнованиямСпортсмены.ДатаПолученияДопуска,
	                |	ДопускиУчастниковКСпортивнымСоревнованиямСпортсмены.Спортсмен,
	                |	ДопускиУчастниковКСпортивнымСоревнованиямСпортсмены.ДействуетДо,
	                |	ДопускиУчастниковКСпортивнымСоревнованиямСпортсмены.ДатаПолученияДопуска";
	
	ТаблицаРегистрацияДопусковКСпортивнымСоревнованиям = Запрос.Выполнить().Выгрузить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаРегистрацияДопусковКСпортивнымСоревнованиям"           , ТаблицаРегистрацияДопусковКСпортивнымСоревнованиям);
	
    ДополнительныеСвойства.Вставить("Отказ", Отказ);
	
КонецПроцедуры	

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ДопускиУчастниковКСпортивнымСоревнованиям.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ДопускиУчастниковКСпортивнымСоревнованиям.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ДопускиУчастниковКСпортивнымСоревнованиям.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры
