
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	УчебныйГодДокумент = Настройки.ПараметрыДанных.Элементы.Найти("УчебныйГодДокумент").Значение;
	
	Если ЗначениеЗаполнено(УчебныйГодДокумент) Тогда
		ПараметрУчебныйГод = Настройки.ПараметрыДанных.Элементы.Найти("УчебныйГод");
		ПараметрУчебныйГод.Значение = УчебныйГодДокумент.УчебныйГод;
		ПараметрУчебныйГод.Использование = Истина;
		КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	КонецЕсли;	
	
КонецПроцедуры
