
&НаСервере
Процедура ИзменитьПодсчетНаСервере()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроводимыеСоревнование.Ссылка КАК Ссылка,
		|	ПроводимыеСоревнование.Дата КАК Дата,
		|	ПроводимыеСоревнование.Организация КАК Организация
		|ИЗ
		|	Документ.Соревнование КАК ПроводимыеСоревнование
		|ГДЕ
		|	ПроводимыеСоревнование.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПроводимыеСоревнование.Организация = &Организация";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Док = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если Док.КоличествоПараметров = 1 И (Док.ТипРезультата = ПредопределенноеЗначение("Перечисление.ТипыРезультатов.Булево") ИЛИ Док.ТипРезультата = ПредопределенноеЗначение("Перечисление.ТипыРезультатов.Число"))  Тогда
		Док.ТипПодсчетаРезультата = ПредопределенноеЗначение("Перечисление.ТипПодсчетаРезультата.МаксимальноеЗначение");
	ИначеЕсли Док.КоличествоПараметров = 1 И Док.ТипРезультата = ПредопределенноеЗначение("Перечисление.ТипыРезультатов.Время") Тогда
		Док.ТипПодсчетаРезультата = ПредопределенноеЗначение("Перечисление.ТипПодсчетаРезультата.МинимальноеЗначение");
	КонецЕсли;
	    Док.ОбменДанными.Загрузка = Истина;
		Попытка
			Док.Записать(РежимЗаписиДокумента.Запись);
			Сообщить ("Документ " + Док + " успешно записан!");
	    Исключение
	        Сообщить ("Не удалось записать " + Док);
			КонецПопытки;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПодсчет(Команда)
	ИзменитьПодсчетНаСервере();
КонецПроцедуры
