
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Тренер") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Тренер", Параметры.Тренер, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		Тренер = Параметры.Тренер; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование И ЗначениеЗаполнено(Тренер) Тогда
		Отказ = Истина;
		ОткрытьФорму("РегистрСведений.КвалификационныеКатегорииТренеров.ФормаЗаписи",Новый Структура("Тренер",Тренер));
	КонецЕсли;
	
КонецПроцедуры
