
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	// {Рарус adilas #18230 -Тестирование релиза Альфа СПОРТ 1.0.0.3. Сводная численность спортсменов 2021.07.08
	// Закомментировано для устранения ошибки расшифровки
	СтандартнаяОбработка = Ложь;
	РезультатСтруктура = РаботаемСРасшифровкойНаСервере(Расшифровка);
	Отбор = РезультатСтруктура;
	ПараметрыОтчета = Новый Структура("СформироватьПриОткрытии, Отбор", Истина, Отбор);
	ОткрытьФорму("Отчет.ОтчетПоСводнойЧисленностиЗанимающихсяРасшифровка.Форма",ПараметрыОтчета);
	// }Рарус adilas #18230 -Тестирование релиза Альфа СПОРТ 1.0.0.3. Сводная численность спортсменов 2021.07.08
КонецПроцедуры
 
&НаСервере
Функция РаботаемСРасшифровкойНаСервере(Расшифровка)
 
	РезультатСтруктура = Новый Структура;
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки); 
	
	Поля = Данные.Элементы.Получить(Расшифровка).ПолучитьПоля();
	Проход = 0;
	МассивЭтапов = Новый Массив;
	МассивЭтапов.Добавить("НП1");
	МассивЭтапов.Добавить("НП2");
	МассивЭтапов.Добавить("НП3");
	МассивЭтапов.Добавить("Т1");
	МассивЭтапов.Добавить("Т2");
	МассивЭтапов.Добавить("Т3");
	МассивЭтапов.Добавить("Т4");
	МассивЭтапов.Добавить("Т5");
	МассивЭтапов.Добавить("ССМ1");
	МассивЭтапов.Добавить("ССМ2");
	МассивЭтапов.Добавить("ССМ3");
	МассивЭтапов.Добавить("ВСМ1");
	Пока Проход < Поля.Количество() Цикл
		Если Поля[Проход].Поле = "Тренер" Тогда
			
			РезультатСтруктура.Вставить(Поля[Проход].Поле, Поля[Проход].Значение);
			
		ИначеЕсли Поля[Проход].Поле = "ВидСпорта" Тогда
			
			РезультатСтруктура.Вставить(Поля[Проход].Поле, Поля[Проход].Значение);
			
		ИначеЕсли МассивЭтапов.Найти(Поля[Проход].Поле) <> Неопределено Тогда
			
			РезультатСтруктура.Вставить("Этап", Поля[Проход].Значение);
			
		КонецЕсли;
		Проход = Проход + 1;
	КонецЦикла;
	
	//Если Не ПараметрыСеанса.ТекущаяОрганизация.Пустая() Тогда
	//	
	//	РезультатСтруктура.Вставить("Организация",ПараметрыСеанса.ТекущаяОрганизация);
	//	
	//КонецЕсли
	
	Возврат РезультатСтруктура;
	
КонецФункции
