
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Владелец = Неопределено;
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Владелец = ПараметрКоманды;
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Спортсмены")
		ИЛИ ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Тренеры") Тогда
		Владелец = ПолучитьФизЛицо(ПараметрКоманды);
	КонецЕсли;	
	ПараметрыФормы = Новый Структура("Владелец", Владелец);
	ОткрытьФорму("РегистрСведений.ДокументыФизическихЛиц.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

&НаСервере
Функция ПолучитьФизЛицо(ОбъектСсылка)
	Возврат ОбъектСсылка.ФизическоеЛицо
КонецФункции	

	