
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	""РегистрацияСтраховыхПолисовСпортсменов"" КАК ИмяРегистра_,
	                |	СтраховойПолисСпортсмена.Дата КАК Период,
	                |	СтраховойПолисСпортсмена.Спортсмен КАК Спортсмен,
	                |	СтраховойПолисСпортсмена.СтраховаяКомпания КАК СтраховаяКомпания,
	                |	СтраховойПолисСпортсмена.СтраховаяСумма КАК СтраховаяСумма,
	                |	СтраховойПолисСпортсмена.СтраховаяПремия КАК СтраховаяПремия,
	                |	СтраховойПолисСпортсмена.ДатаНачала КАК ДатаНачала,
	                |	СтраховойПолисСпортсмена.ДатаОкончания КАК ДатаОкончания,
	                |	СтраховойПолисСпортсмена.ВидСпорта КАК ВидСпорта,
	                |	СтраховойПолисСпортсмена.Организация КАК Организация,
	                |	СтраховойПолисСпортсмена.ДатаВыдачиПолиса КАК ДатаВыдачиПолиса,
	                |	СтраховойПолисСпортсмена.НомерСтраховогоПолиса КАК НомерСтраховогоПолиса,
					|	СтраховойПолисСпортсмена.СерияСтраховогоПолиса КАК СерияСтраховогоПолиса
	                |ИЗ
	                |	Документ.СтраховойПолисСпортсмена КАК СтраховойПолисСпортсмена
	                |ГДЕ
	                |	СтраховойПолисСпортсмена.Ссылка = &Ссылка";
	
	ТаблицаРегистрацияСтраховыхПолисовСпортсменов = Запрос.Выполнить().Выгрузить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаРегистрацияСтраховыхПолисовСпортсменов"           , ТаблицаРегистрацияСтраховыхПолисовСпортсменов);
	
    ДополнительныеСвойства.Вставить("Отказ", Отказ);
	
КонецПроцедуры	

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.СтраховойПолисСпортсмена.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.СтраховойПолисСпортсмена.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.СтраховойПолисСпортсмена.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры
