Процедура УстановитьСтатусЗаявления(ПереданныйДокумент,ВыбранноеЗначение) Экспорт
    

    Если ПереданныйДокумент.СтатусЗаявления <> ВыбранноеЗначение Тогда
        
        Если ТипЗнч(ПереданныйДокумент) = Тип("ДокументОбъект.ЗаявленияНаПриемВСпортивноеУчреждение") Тогда
            
            Документ = ПереданныйДокумент;
            ДокументСсылка = ПереданныйДокумент.Ссылка;
            
        ИначеЕсли ТипЗнч(ПереданныйДокумент) = Тип("ДокументСсылка.ЗаявленияНаПриемВСпортивноеУчреждение") Тогда
            
            Документ = ПереданныйДокумент.ПолучитьОбъект();
            ДокументСсылка = ПереданныйДокумент;
            
        Иначе 
            
            Возврат;
            
        КонецЕсли; 
        
        
        Документ.СтатусЗаявления = ВыбранноеЗначение;
        Документ.Записать(РежимЗаписиДокумента.Запись);
        
        МенеджерЗаписиСтатусДокумента = РегистрыСведений.СтатусыЗаявленияНаПриемВСпортивноеУчреждение.СоздатьМенеджерЗаписи();
        МенеджерЗаписиСтатусДокумента.Заявление = ДокументСсылка;
        МенеджерЗаписиСтатусДокумента.СтатусЗаявления = ВыбранноеЗначение;
        МенеджерЗаписиСтатусДокумента.Период = ТекущаяДатаСеанса();
        ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
        МенеджерЗаписиСтатусДокумента.Пользователь = ТекПользователь;
        МенеджерЗаписиСтатусДокумента.Записать();
        
    КонецЕсли;
    
КонецПроцедуры

