
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	// Получение и настройка пользовательских параметров;
	ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
	
	// Получение значений пользовательских параметров;
	ПараметрТренер = ПолучитьПараметрПользовательскойНастройки(ПользовательскиеНастройки, "Тренер");
	ПараметрЭтап   = ПолучитьПараметрПользовательскойНастройки(ПользовательскиеНастройки, "Этап");
	ОтображаемыеБрони = ТабельПосещений.ПолучитьОтображаемыеСобытия(НачалоМесяца(ТекущаяДатаСеанса()), КонецМесяца(ТекущаяДатаСеанса()), ПараметрТренер, ПараметрЭтап);
	
	// Установка пользовательского параметра;
	ИмяНастройки = "Период";
	ПараметрПериод = ПолучитьПараметрПользовательскойНастройки(ПользовательскиеНастройки, "Период");
	
	// Устанавливать параметры пользоваетельских настроек нужно перед тем как получать их КомпоновщикНастроек.ПолучитьНастройки();	
	УстановитьПараметрПользовательскойНастройки(ПользовательскиеНастройки, ИмяНастройки, ПараметрПериод);  
	
	// Нужно работать с методом ПолучитьНастройки() чтобы получить копию пользовательнских (обычные и быстрые настройки) так и настрйки на уровне варианта отчёта; 
	НастройкиКомпановки = КомпоновщикНастроек.ПолучитьНастройки();
	
	// Настройка параметров отчёта;
	НастройкиКомпановки.ПараметрыДанных.УстановитьЗначениеПараметра("ОтображаемыеБрони", ОтображаемыеБрони);
	НастройкиКомпановки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", ПараметрыСеанса.ТекущаяОрганизация);
	
	// Для связи обычных настроек КомпановкиДанных и пользовательских существует ИдентификаторПользовательскойНастройки;
	// Если при проверке параметров идентификатор пользовательской настройки заполнен, то СКД считает что это пользовательская настройка, 
	// и редактировать её нужно в списке пользовательских настроек - в свойстве КомпоновщикНастроек.ПользовательскиеНастройкиКомпановкиДанных.
	
	КомпановщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпановки = КомпановщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпановки);
	
	ПроцессорКомановки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомановки.Инициализировать(МакетКомпановки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомановки);	
	
КонецПроцедуры

Функция ПолучитьПараметрПользовательскойНастройки(ПользовательскиеНастройки, ИмяНастройки)
	
	ПолеКомпоновкиПараметр = Новый ПараметрКомпоновкиДанных(ИмяНастройки);
	ЭлементОтбора = Неопределено;
	
	Для Каждого Элемент Из ПользовательскиеНастройки.Элементы Цикл
		Если Элемент.Параметр = ПолеКомпоновкиПараметр Тогда
			Возврат Новый Структура("Значение, Использование",Элемент.Значение, Элемент.Использование); 
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Процедура УстановитьПараметрПользовательскойНастройки(ПользовательскиеНастройки, ИмяНастройки, Параметр) Экспорт
	
	ПолеКомпановкиПараметр = Новый ПолеКомпоновкиДанных(ИмяНастройки);
	ЭлементОтбора = Неопределено;
	
	Для Каждого Элемент Из ПользовательскиеНастройки.Элементы Цикл	
		Если Элемент.Параметр = ПолеКомпановкиПараметр Тогда
			Элемент.Значение = Параметр.Значение;
			Элемент.Использоваение = Параметр.Использование;
			Прервать;
		КонецЕсли;	
	КонецЦикла
	
	
КонецПроцедуры

