#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	// {Рарус adilas #17292 -Отчет "Спортсмены адаптивных видов спорта" 2021.07.02
	ПараметрСКДОрганизация    		= Новый ПараметрКомпоновкиДанных("Организация");
	ЗначениеПараметрСКДОрганизация 	= ПараметрыСеанса.ТекущаяОрганизация;	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрСКДОрганизация, ЗначениеПараметрСКДОрганизация);                                                             
	// }Рарус adilas #17292 -Отчет "Спортсмены адаптивных видов спорта" 2021.07.02
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли