
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Спортсмен") Тогда
		ТекущийСпортсмен = Параметры.Спортсмен;
		УстановитьОтборПоСпортсменуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование И ЗначениеЗаполнено(ТекущийСпортсмен) Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("СписокПередНачаломДобавленияЗавершение", ЭтотОбъект);
		ОткрытьФорму("Документ.УстановкаМеждународнойВозрастнойГруппы.Форма.ФормаДокумента", Новый Структура("Спортсмен", ТекущийСпортсмен),,,,,Оповещение);
	КонецЕсли;	
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборПоСпортсменуНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Спортсмен", ТекущийСпортсмен);
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	УстановкаМеждународнойВозрастнойГруппы.Ссылка КАК Ссылка
	                |ИЗ
	                |	Документ.УстановкаМеждународнойВозрастнойГруппы.Спортсмены КАК УстановкаМеждународнойВозрастнойГруппы
	                |ГДЕ
	                |	УстановкаМеждународнойВозрастнойГруппы.Спортсмен = &Спортсмен";
	массивДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", массивДокументов, ВидСравненияКомпоновкиДанных.ВСписке);
	
КонецПроцедуры	

&НаКлиенте
Процедура СписокПередНачаломДобавленияЗавершение(Результат, ДопПараметры) Экспорт
	
	УстановитьОтборПоСпортсменуНаСервере();
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

#КонецОбласти
