#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТолькоВыбор") Тогда
		Элементы.СписокПодобрать.Видимость         = Ложь;
		Элементы.ФормаВыбрать.КнопкаПоУмолчанию    = Истина;
		ВыборЗначения = Истина;
	ИначеЕсли Параметры.Свойство("ТолькоПодбор") Тогда
		Элементы.ФормаВыбрать.Видимость            = Ложь;
		Элементы.СписокПодобрать.КнопкаПоУмолчанию = Истина;
		
		// {Рарус adilas #-7400 -Команда подбор спортменов, открыть форму выбора справочника  2020.07.26
		Если Параметры.Свойство("ИдентификаторИсключениеИзГруппы") Тогда
			Список.ТекстЗапроса = ТекстЗапросаПереопределяемый();
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТренерСборной", Параметры.Тренер);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Группа"       , Параметры.Группа);
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "МоментВремени", Параметры.МоментВремени);
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не удалось открыть форму " + ОписаниеОшибки());
		// }Рарус adilas #-7400 -Команда подбор спортменов, открыть форму выбора справочника  2020.07.26
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ДатаСреза"  , Параметры.ДатаСреза); 
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ВидСпорта"  , Параметры.ВидСпорта); 
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Организация", Параметры.Организация);
	
	// {Рарус dotere #-16299 -Проверка на свойство  2021.05.28
	Если Параметры.Свойство("УчебныйГод") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "УчебныйГод", Параметры.УчебныйГод);
	КонецЕсли
	// }Рарус dotere #-16299 -Проверка на свойство  2021.05.28
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ВыборЗначения Тогда
		Оповестить("ПодборСпискаСпортсменов",Новый Структура("СписокСпортсменов",СписокСпортсменов)); 	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийДинамическогоСписка

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ВыборЗначения Тогда
	   ВыбратьЗначениеИЗакрыть();
    Иначе
	   ПодобратьЗначение();
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура Подобрать(Команда)
	
	ПодобратьЗначение();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбратьЗначениеИЗакрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьЗначениеИЗакрыть()
	
	ТекСпортсмен = Неопределено;
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		ТекСпортсмен = ТекДанные.Ссылка;
	КонецЕсли;
	
	ЭтаФорма.Закрыть(Новый Структура("Спортсмен",ТекСпортсмен));
	
КонецПроцедуры	

&НаКлиенте
Процедура ПодобратьЗначение()
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		СписокСпортсменов.Добавить(ТекДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

// {Рарус adilas #-7400 -Команда подбор спортменов, открыть форму выбора справочника  2020.07.26
&НаСервере
Функция ТекстЗапросаПереопределяемый()

	Возврат "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	СоставГруппыСрезПоследних.Спортсмен КАК Спортсмен
	        |ПОМЕСТИТЬ ВТ_СоставГруппы
	        |ИЗ
	        |	РегистрСведений.СоставГруппы.СрезПоследних КАК СоставГруппыСрезПоследних
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	Спортсмен
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Спортсмены.Ссылка КАК Ссылка,
	        |	ФизическиеЛица.ДатаРождения КАК ДатаРождения
	        |ИЗ
	        |	ВТ_СоставГруппы КАК ВТ_СоставГруппы
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Спортсмены КАК Спортсмены
	        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	        |			ПО Спортсмены.ФизическоеЛицо = ФизическиеЛица.Ссылка
	        |		ПО ВТ_СоставГруппы.Спортсмен = Спортсмены.Ссылка";

КонецФункции
// }Рарус adilas #-7400 -Команда подбор спортменов, открыть форму выбора справочника  2020.07.26

#КонецОбласти
