// {Рарус adilas #1.0.0.2 -Исправления по SonarQube 2021.04.23
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуДанныхПоСтрокам(ДатаОтчета,Тренер)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Тренер", Тренер);
	Запрос.УстановитьПараметр("ДатаОтчета", ДатаОтчета);
	
	Если Тренер = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%1","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%2","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%3","");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%1"," И СоставГруппы.ТренерСборной = &Тренер");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%2"," И ВТ_ПериодРаботыСТренером.Тренер = &Тренер");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%3"," ГДЕ ВТ_ПериодРаботыСТренером.Тренер = &Тренер");
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СоставГруппы.Период КАК Период,
	               |	СоставГруппы.Регистратор КАК Регистратор,
	               |	СоставГруппы.УчебныйГод КАК УчебныйГод,
	               |	СоставГруппы.Организация КАК Организация,
	               |	СоставГруппы.ВидСпорта КАК ВидСпорта,
	               |	СоставГруппы.Группа КАК Группа,
	               |	СоставГруппы.Спортсмен КАК Спортсмен,
	               |	СоставГруппы.ТренерСборной КАК Тренер
	               |ПОМЕСТИТЬ ВТ_КоличествоЗанимающихсяПоГруппам
	               |ИЗ
	               |	РегистрСведений.СоставГруппы КАК СоставГруппы
	               |ГДЕ
	               |	СоставГруппы.Период <= &ДатаОтчета
	               |	И (СоставГруппы.ДатаИсключенияИзГруппы >= &ДатаОтчета
	               |			ИЛИ СоставГруппы.ДатаИсключенияИзГруппы = ДАТАВРЕМЯ(1, 1, 1)) 
				   |%1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.Период КАК ДатаНачала,
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.Спортсмен КАК Спортсмен,
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.Тренер КАК Тренер,
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.Организация КАК Организация,
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.ВидСпорта КАК ВидСпорта
	               |ПОМЕСТИТЬ ВТ_ДатаНачалаРаботыСТренером
	               |ИЗ
	               |	ВТ_КоличествоЗанимающихсяПоГруппам КАК ВТ_КоличествоЗанимающихсяПоГруппам
	               |ГДЕ
	               |	(ТИПЗНАЧЕНИЯ(ВТ_КоличествоЗанимающихсяПоГруппам.Регистратор) = ТИП(документ.ВключениеСпортсменовВГруппу)
	               |			ИЛИ ТИПЗНАЧЕНИЯ(ВТ_КоличествоЗанимающихсяПоГруппам.Регистратор) = ТИП(документ.ФормированиеГруппы))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.Период КАК ДатаОкончания,
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.Спортсмен КАК Спортсмен,
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.Тренер КАК Тренер,
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.Организация КАК Организация,
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.ВидСпорта КАК ВидСпорта
	               |ПОМЕСТИТЬ ВТ_ДатыОкончанияРаботыСТренером
	               |ИЗ
	               |	ВТ_КоличествоЗанимающихсяПоГруппам КАК ВТ_КоличествоЗанимающихсяПоГруппам
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(ВТ_КоличествоЗанимающихсяПоГруппам.Регистратор) = ТИП(документ.ИсключениеИзСпортивногоУчреждения)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДатаНачалаРаботыСТренером.ДатаНачала КАК ДатаНачала,
	               |	ВТ_ДатаНачалаРаботыСТренером.Спортсмен КАК Спортсмен,
	               |	ВТ_ДатаНачалаРаботыСТренером.Организация КАК Организация,
	               |	ВТ_ДатаНачалаРаботыСТренером.ВидСпорта КАК ВидСпорта,
	               |	ВТ_ДатаНачалаРаботыСТренером.Тренер КАК Тренер,
	               |	ЕСТЬNULL(ВТ_ДатыОкончанияРаботыСТренером.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончания
	               |ПОМЕСТИТЬ ВТ_ПериодРаботыСТренером
	               |ИЗ
	               |	ВТ_ДатаНачалаРаботыСТренером КАК ВТ_ДатаНачалаРаботыСТренером
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыОкончанияРаботыСТренером КАК ВТ_ДатыОкончанияРаботыСТренером
	               |		ПО ВТ_ДатаНачалаРаботыСТренером.Спортсмен = ВТ_ДатыОкончанияРаботыСТренером.Спортсмен
	               |			И ВТ_ДатаНачалаРаботыСТренером.Тренер = ВТ_ДатыОкончанияРаботыСТренером.Тренер
	               |			И ВТ_ДатаНачалаРаботыСТренером.Организация = ВТ_ДатыОкончанияРаботыСТренером.Организация
	               |			И ВТ_ДатаНачалаРаботыСТренером.ВидСпорта = ВТ_ДатыОкончанияРаботыСТренером.ВидСпорта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПодтвержденныеРазрядыСпортсменов.Период КАК Период,
	               |	ПодтвержденныеРазрядыСпортсменов.Регистратор КАК Регистратор,
	               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен КАК Спортсмен,
	               |	ПодтвержденныеРазрядыСпортсменов.Организация КАК Организация,
	               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта КАК ВидСпорта,
	               |	ПодтвержденныеРазрядыСпортсменов.Разряд КАК Разряд,
	               |	ВТ_ПериодРаботыСТренером.Тренер КАК Тренер
	               |ПОМЕСТИТЬ ВТ_РазрядыСпортсменов
	               |ИЗ
	               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов КАК ПодтвержденныеРазрядыСпортсменов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодРаботыСТренером КАК ВТ_ПериодРаботыСТренером
	               |		ПО ПодтвержденныеРазрядыСпортсменов.Спортсмен = ВТ_ПериодРаботыСТренером.Спортсмен
	               |			И ПодтвержденныеРазрядыСпортсменов.Организация = ВТ_ПериодРаботыСТренером.Организация
	               |			И ПодтвержденныеРазрядыСпортсменов.ВидСпорта = ВТ_ПериодРаботыСТренером.ВидСпорта
	               |			И ПодтвержденныеРазрядыСпортсменов.Период >= ВТ_ПериодРаботыСТренером.ДатаНачала
	               |			И (ВЫБОР
	               |				КОГДА ВТ_ПериодРаботыСТренером.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
	               |					ТОГДА ПодтвержденныеРазрядыСпортсменов.Период <= ВТ_ПериодРаботыСТренером.ДатаОкончания
	               |				ИНАЧЕ ИСТИНА
	               |			КОНЕЦ)
	               |ГДЕ
	               |	(ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения <= &ДатаОтчета
	               |			ИЛИ ПодтвержденныеРазрядыСпортсменов.ДатаПодтверждения <= &ДатаОтчета) 
				   | %2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПроводимыеСоревнования.Ссылка КАК Соревнование,
	               |	ПроводимыеСоревнования.УчебныйГод КАК УчебныйГод,
	               |	ПроводимыеСоревнования.ДатаНачалаСоревнования КАК ДатаНачалаСоревнования,
	               |	ПроводимыеСоревнования.Организация КАК Организация,
	               |	ПроводимыеСоревнования.ВидСпорта КАК ВидСпорта,
	               |	ПроводимыеСоревнования.Соревнование.Наименование КАК НаименованиеСоревнования
	               |ПОМЕСТИТЬ ВТ_ПроведенныеСоревнования
	               |ИЗ
	               |	Документ.Соревнование КАК ПроводимыеСоревнования
	               |ГДЕ
	               |	ПроводимыеСоревнования.ДатаНачалаСоревнования <= &ДатаОтчета
	               |	И ПроводимыеСоревнования.Проведен
	               |	И НЕ ПроводимыеСоревнования.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ_ПроведенныеСоревнования.НаименованиеСоревнования КАК НаименованиеСоревнования,
	               |	ВТ_ПроведенныеСоревнования.УчебныйГод КАК УчебныйГод,
	               |	ВТ_ПроведенныеСоревнования.Организация КАК Организация,
	               |	ВТ_ПроведенныеСоревнования.ВидСпорта КАК ВидСпорта,
	               |	ВТ_ПроведенныеСоревнования.ДатаНачалаСоревнования КАК ДатаНачалаСоревнования,
	               |	ИтоговыеРезультатыСоревнования.Спортсмен КАК Спортсмен,
	               |	ИтоговыеРезультатыСоревнования.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВТ_РезультатыСоревнованийПоСпортсменам
	               |ИЗ
	               |	ВТ_ПроведенныеСоревнования КАК ВТ_ПроведенныеСоревнования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИтоговыеРезультатыСоревнования КАК ИтоговыеРезультатыСоревнования
	               |		ПО ВТ_ПроведенныеСоревнования.Соревнование = ИтоговыеРезультатыСоревнования.Регистратор.ДокументОснование
	               |			И ВТ_ПроведенныеСоревнования.Организация = ИтоговыеРезультатыСоревнования.Организация
	               |			И ВТ_ПроведенныеСоревнования.ВидСпорта = ИтоговыеРезультатыСоревнования.ВидСпорта
	               |			И ВТ_ПроведенныеСоревнования.УчебныйГод = ИтоговыеРезультатыСоревнования.УчебныйГод
	               |ГДЕ
	               |	(ИтоговыеРезультатыСоревнования.Место = 1
	               |			ИЛИ ИтоговыеРезультатыСоревнования.Место = 2
	               |			ИЛИ ИтоговыеРезультатыСоревнования.Место = 3)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_РезультатыСоревнованийПоСпортсменам.НаименованиеСоревнования КАК НаименованиеСоревнования,
	               |	ВТ_РезультатыСоревнованийПоСпортсменам.Организация КАК Организация,
	               |	ВТ_РезультатыСоревнованийПоСпортсменам.ВидСпорта КАК ВидСпорта,
	               |	ВТ_РезультатыСоревнованийПоСпортсменам.ДатаНачалаСоревнования КАК ДатаНачалаСоревнования,
	               |	ВТ_РезультатыСоревнованийПоСпортсменам.Спортсмен КАК Спортсмен,
	               |	ВТ_РезультатыСоревнованийПоСпортсменам.Регистратор КАК Регистратор,
	               |	ВТ_РезультатыСоревнованийПоСпортсменам.УчебныйГод КАК УчебныйГод,
	               |	ВТ_ПериодРаботыСТренером.Тренер КАК Тренер
	               |ПОМЕСТИТЬ ВТ_РезультатыСоревнований
	               |ИЗ
	               |	ВТ_РезультатыСоревнованийПоСпортсменам КАК ВТ_РезультатыСоревнованийПоСпортсменам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодРаботыСТренером КАК ВТ_ПериодРаботыСТренером
	               |		ПО ВТ_РезультатыСоревнованийПоСпортсменам.Организация = ВТ_ПериодРаботыСТренером.Организация
	               |			И ВТ_РезультатыСоревнованийПоСпортсменам.ВидСпорта = ВТ_ПериодРаботыСТренером.ВидСпорта
	               |			И ВТ_РезультатыСоревнованийПоСпортсменам.Спортсмен = ВТ_ПериодРаботыСТренером.Спортсмен
	               | %3
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.УчебныйГод КАК УчебныйГод,
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.Организация КАК Организация,
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.ВидСпорта КАК ВидСпорта,
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.Группа КАК Группа,
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.Тренер КАК Тренер,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_КоличествоЗанимающихсяПоГруппам.Спортсмен) КАК КоличествоЗанимающихся,
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ВТ_ЗанимающиесяПоГруппам
	               |ИЗ
	               |	ВТ_КоличествоЗанимающихсяПоГруппам КАК ВТ_КоличествоЗанимающихсяПоГруппам
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.УчебныйГод,
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.Организация,
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.ВидСпорта,
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.Группа,
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.Тренер,
	               |	ВТ_КоличествоЗанимающихсяПоГруппам.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_РазрядыСпортсменов.Спортсмен) КАК КоличествоСпорстменовСРазрядами,
	               |	ВТ_РазрядыСпортсменов.Регистратор КАК Регистратор,
	               |	ВТ_РазрядыСпортсменов.Организация КАК Организация,
	               |	ВТ_РазрядыСпортсменов.ВидСпорта КАК ВидСпорта,
	               |	ВТ_РазрядыСпортсменов.Разряд КАК Разряд,
	               |	ВТ_РазрядыСпортсменов.Тренер КАК Тренер,
	               |	УправлениеУчебнымГодом.УчебныйГод КАК УчебныйГод
	               |ПОМЕСТИТЬ ВТ_ПодготовленныеПоРазрядам
	               |ИЗ
	               |	ВТ_РазрядыСпортсменов КАК ВТ_РазрядыСпортсменов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УправлениеУчебнымГодом КАК УправлениеУчебнымГодом
	               |		ПО ВТ_РазрядыСпортсменов.Период >= УправлениеУчебнымГодом.УчебныйГод.ДатаНачала
	               |			И ВТ_РазрядыСпортсменов.Период <= УправлениеУчебнымГодом.УчебныйГод.ДатаОкончания
	               |			И (УправлениеУчебнымГодом.Проведен)
	               |			И (НЕ УправлениеУчебнымГодом.ПометкаУдаления)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_РазрядыСпортсменов.Организация,
	               |	ВТ_РазрядыСпортсменов.ВидСпорта,
	               |	ВТ_РазрядыСпортсменов.Разряд,
	               |	ВТ_РазрядыСпортсменов.Тренер,
	               |	УправлениеУчебнымГодом.УчебныйГод,
	               |	ВТ_РазрядыСпортсменов.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_РезультатыСоревнований.НаименованиеСоревнования КАК НаименованиеСоревнования,
	               |	ВТ_РезультатыСоревнований.Организация КАК Организация,
	               |	ВТ_РезультатыСоревнований.ВидСпорта КАК ВидСпорта,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_РезультатыСоревнований.Спортсмен) КАК КоличествоПризеров,
	               |	ВТ_РезультатыСоревнований.Регистратор КАК Регистратор,
	               |	ВТ_РезультатыСоревнований.УчебныйГод КАК УчебныйГод,
	               |	ВТ_РезультатыСоревнований.Тренер КАК Тренер
	               |ПОМЕСТИТЬ ВТ_КоличествоПризеров
	               |ИЗ
	               |	ВТ_РезультатыСоревнований КАК ВТ_РезультатыСоревнований
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_РезультатыСоревнований.НаименованиеСоревнования,
	               |	ВТ_РезультатыСоревнований.Организация,
	               |	ВТ_РезультатыСоревнований.ВидСпорта,
	               |	ВТ_РезультатыСоревнований.УчебныйГод,
	               |	ВТ_РезультатыСоревнований.Тренер,
	               |	ВТ_РезультатыСоревнований.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ_ЗанимающиесяПоГруппам.УчебныйГод КАК УчебныйГод,
	               |	ВТ_ЗанимающиесяПоГруппам.Группа КАК Группа,
	               |	ВТ_ЗанимающиесяПоГруппам.Тренер КАК Тренер,
	               |	ВТ_ЗанимающиесяПоГруппам.КоличествоЗанимающихся КАК КоличествоЗанимающихся,
	               |	ВТ_ЗанимающиесяПоГруппам.Регистратор КАК Регистратор,
	               |	1 КАК Раздел,
	               |	0 КАК КоличествоСпорстменовСРазрядами,
	               |	ЗНАЧЕНИЕ(справочник.СпортивнаяКлассификация.пустаяссылка) КАК Разряд,
	               |	"""" КАК НаименованиеСоревнования,
	               |	0 КАК КоличествоПризеров
	               |ПОМЕСТИТЬ ВТ_ИтоговыйНабор
	               |ИЗ
	               |	ВТ_ЗанимающиесяПоГруппам КАК ВТ_ЗанимающиесяПоГруппам
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ПодготовленныеПоРазрядам.УчебныйГод,
	               |	ЗНАЧЕНИЕ(справочник.Группа.пустаяссылка),
	               |	ВТ_ПодготовленныеПоРазрядам.Тренер,
	               |	0,
	               |	ВТ_ПодготовленныеПоРазрядам.Регистратор,
	               |	2,
	               |	ВТ_ПодготовленныеПоРазрядам.КоличествоСпорстменовСРазрядами,
	               |	ВТ_ПодготовленныеПоРазрядам.Разряд,
	               |	"""",
	               |	0
	               |ИЗ
	               |	ВТ_ПодготовленныеПоРазрядам КАК ВТ_ПодготовленныеПоРазрядам
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_КоличествоПризеров.УчебныйГод,
	               |	ЗНАЧЕНИЕ(справочник.Группа.пустаяссылка),
	               |	ВТ_КоличествоПризеров.Тренер,
	               |	0,
	               |	ВТ_КоличествоПризеров.Регистратор,
	               |	3,
	               |	0,
	               |	ЗНАЧЕНИЕ(справочник.СпортивнаяКлассификация.пустаяссылка),
	               |	ВТ_КоличествоПризеров.НаименованиеСоревнования,
	               |	ВТ_КоличествоПризеров.КоличествоПризеров
	               |ИЗ
	               |	ВТ_КоличествоПризеров КАК ВТ_КоличествоПризеров
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	УправлениеУчебнымГодом.УчебныйГод КАК УчебныйГод,
	               |	УправлениеУчебнымГодом.УчебныйГод.ДатаНачала КАК ДатаНачала
	               |ПОМЕСТИТЬ ВТ_УчебныеГоды
	               |ИЗ
	               |	Документ.УправлениеУчебнымГодом КАК УправлениеУчебнымГодом
	               |ГДЕ
	               |	УправлениеУчебнымГодом.Проведен
	               |	И НЕ УправлениеУчебнымГодом.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ИтоговыйНабор.УчебныйГод,
	               |	ВТ_ИтоговыйНабор.УчебныйГод.ДатаНачала
				   |ИЗ
				   |	ВТ_ИтоговыйНабор КАК ВТ_ИтоговыйНабор
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ВТ_ИтоговыйНабор.Группа КАК Группа,
				   |	ВТ_ИтоговыйНабор.Тренер КАК Тренер,
				   |	СУММА(ВТ_ИтоговыйНабор.КоличествоЗанимающихся) КАК КоличествоЗанимающихся,
				   |	ВТ_ИтоговыйНабор.Регистратор КАК Регистратор,
				   |	ВТ_ИтоговыйНабор.Раздел КАК Раздел,
				   |	СУММА(ВТ_ИтоговыйНабор.КоличествоСпорстменовСРазрядами) КАК КоличествоСпорстменовСРазрядами,
				   |	ВТ_ИтоговыйНабор.Разряд КАК Разряд,
				   |	ВТ_ИтоговыйНабор.НаименованиеСоревнования КАК НаименованиеСоревнования,
				   |	СУММА(ВТ_ИтоговыйНабор.КоличествоПризеров) КАК КоличествоПризеров,
				   |	ВТ_ИтоговыйНабор.УчебныйГод КАК УчебныйГод
				   |ИЗ
				   |	 ВТ_ИтоговыйНабор КАК ВТ_ИтоговыйНабор
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	ВТ_УчебныеГодыВСистеме.УчебныйГод,
				   |	ВТ_ИтоговыйНабор.Группа,
				   |	ВТ_ИтоговыйНабор.Тренер,
				   |	ВТ_ИтоговыйНабор.Регистратор,
				   |	ВТ_ИтоговыйНабор.Раздел,
				   |	ВТ_ИтоговыйНабор.Разряд,
				   |	ВТ_ИтоговыйНабор.НаименованиеСоревнования
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |    УчебныйГод,
				   |    Раздел
				   |ИТОГИ 
				   |
				   |СУММА(КоличествоЗанимающихся),
	               |СУММА(КоличествоСпорстменовСРазрядами),
				   |СУММА(КоличествоПризеров)
				   |
				   |ПО
				   |    Тренер,
				   |    УчебныйГод,
				   |    Раздел";
	
	МассивДанных = Новый Массив;
		
	ВыборкаТренер = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПустойМассив = Новый Массив;
	
	Пока ВыборкаТренер.Следующий() Цикл
		СтруктураДанныеПоТренеру = Новый Структура("Тренер", ВыборкаТренер.Тренер);
		
		МассивУчебныеГоды = Новый Массив;
		ВыборкаУчебныйГод = ВыборкаТренер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Позиция = 2;
		
		Пока ВыборкаУчебныйГод.Следующий() Цикл
			МассивУчебныеГоды.Добавить(Новый Структура("ГодПоказателя_"+СокрЛП(Позиция),ВыборкаУчебныйГод.УчебныйГод));
			
			ВыборкаРаздел = ВыборкаУчебныйГод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Если ВыборкаРаздел.Количество() = 0 Тогда
				СтруктураДанныеПоТренеру.Вставить("Раздел1", ПустойМассив);
				СтруктураДанныеПоТренеру.Вставить("Раздел2", ПустойМассив);
				СтруктураДанныеПоТренеру.Вставить("Раздел3", ПустойМассив);
				Продолжить;
			КонецЕсли;
			
			Раздел1 = Ложь;
			Раздел2 = Ложь;
			Раздел3 = Ложь;
			Пока ВыборкаРаздел.Следующий() Цикл
				Если ВыборкаРаздел.Раздел = 1 Тогда
					Раздел1 = Истина;
				КонецЕсли;	
			КонецЦикла;
			
			Позиция = Позиция + 1;
			
		КонецЦикла;
		СтруктураДанныеПоТренеру.Вставить("УчебныеГоды", МассивУчебныеГоды);
		МассивДанных.Добавить(СтруктураДанныеПоТренеру);
	КонецЦикла;	
	
	Возврат МассивДанных;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли