
&НаКлиенте
Процедура ПриОткрытии(Отказ)
		Идентификатор = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(Отчет.КомпоновщикНастроек.Настройки["ПараметрыДанных"].НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация")));
		ПараметрОрганизация = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
		ПараметрОрганизация.Значение = Неопределено;
	    ПараметрОрганизация.Использование = Ложь;
	    ПараметрОрганизация.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	Если ПользователюРольДоступна("Методист") И Не ПользователюРольДоступна("МетодистРасширенная") Тогда
		ПараметрОрганизация.Значение = ТекущаяОрганизация();
	    ПараметрОрганизация.Использование = Истина;
	    ПараметрОрганизация.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
		
	ИдентификаторВидСпортаПоРеестру = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(Отчет.КомпоновщикНастроек.Настройки["ПараметрыДанных"].НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидСпортаПоРеестру")));
	ПараметрВидСпортаПоРеестру = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторВидСпортаПоРеестру);

	ИдентификаторВидСпорта = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(Отчет.КомпоновщикНастроек.Настройки["ПараметрыДанных"].НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидСпорта")));
	ПараметрВидСпорта = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторВидСпорта);
	
	Если ПользователюРольДоступна("Методист") И Не ПользователюРольДоступна("ПолныеПрава") Тогда
	    ПараметрВидСпортаПоРеестру.Использование = Ложь;
	    ПараметрВидСпортаПоРеестру.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Иначе
	    ПараметрВидСпорта.Использование = Ложь;
	    ПараметрВидСпорта.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ТекущаяОрганизация()
	Возврат ПараметрыСеанса.ТекущаяОрганизация;
КонецФункции

&НаСервере
Функция ПользователюРольДоступна(РольИмя)
	Возврат РольДоступна(РольИмя);
КонецФункции

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
		Идентификатор = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(Отчет.КомпоновщикНастроек.Настройки["ПараметрыДанных"].НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация")));
		ПараметрОрганизация = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
		ПараметрОрганизация.Значение = Неопределено;
	    ПараметрОрганизация.Использование = Ложь;
	    ПараметрОрганизация.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	Если ПользователюРольДоступна("Методист") И Не ПользователюРольДоступна("ПолныеПрава") Тогда
		ПараметрОрганизация.Значение = ТекущаяОрганизация();
	    ПараметрОрганизация.Использование = Истина;
	    ПараметрОрганизация.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	 	
	ИдентификаторВидСпортаПоРеестру = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(Отчет.КомпоновщикНастроек.Настройки["ПараметрыДанных"].НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидСпортаПоРеестру")));
	ПараметрВидСпортаПоРеестру = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторВидСпортаПоРеестру);

	ИдентификаторВидСпорта = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(Отчет.КомпоновщикНастроек.Настройки["ПараметрыДанных"].НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидСпорта")));
	ПараметрВидСпорта = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторВидСпорта);
	
	Если ПользователюРольДоступна("Методист") И Не ПользователюРольДоступна("ПолныеПрава") Тогда
	    ПараметрВидСпортаПоРеестру.Использование = Ложь;
	    ПараметрВидСпортаПоРеестру.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Иначе
	    ПараметрВидСпорта.Использование = Ложь;
	    ПараметрВидСпорта.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;		
	КонецЕсли;

КонецПроцедуры
