
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	
	СтандартнаяОбработка = Ложь; 

    НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	параметрРейтинг = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Рейтинг");
	Рейтинг = Справочники.Рейтинги.ПустаяСсылка();
	Если НЕ параметрРейтинг = Неопределено Тогда
		Рейтинг = параметрРейтинг.Значение;
	КонецЕсли;
	
	параметрПериод = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Период");
	Период = Дата(1,1,1);
	Если НЕ параметрПериод = Неопределено Тогда
		Период = параметрПериод.Значение;
	КонецЕсли;
	
	тзРезультат = Новый ТаблицаЗначений;
	тзРезультат.Колонки.Добавить("УчебныйГод"                    , Новый ОписаниеТипов("СправочникСсылка.УчебныйГод"));
	тзРезультат.Колонки.Добавить("Рейтинг"                       , Новый ОписаниеТипов("СправочникСсылка.Рейтинги"));
	тзРезультат.Колонки.Добавить("МеждународнаяВозрастнаяГруппа" , Новый ОписаниеТипов("СправочникСсылка.МеждународныеВозрастныеГруппы"));
	тзРезультат.Колонки.Добавить("Пол"                           , Новый ОписаниеТипов("ПеречислениеСсылка.ПолФизическогоЛица"));
	тзРезультат.Колонки.Добавить("Спортсмен"                     , Новый ОписаниеТипов("СправочникСсылка.Спортсмены"));
	тзРезультат.Колонки.Добавить("Соревнование"                  , Новый ОписаниеТипов("СправочникСсылка.Соревнование"));
	тзРезультат.Колонки.Добавить("КоличествоБаллов"              , Новый ОписаниеТипов("Число"));
	тзРезультат.Колонки.Добавить("МестоВРейтинге"                , Новый ОписаниеТипов("Число"));
	тзРезультат.Колонки.Добавить("Организатор"                   , Новый ОписаниеТипов("СправочникСсылка.Организации"));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"  , Период);
	Запрос.УстановитьПараметр("Рейтинг" , Рейтинг);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ПодсчетРейтингов.Рейтинг КАК Рейтинг,
	                |	ПодсчетРейтингов.УчебныйГод КАК УчебныйГод,
	                |	ПодсчетРейтингов.Организатор КАК Организатор,
					|	ПодсчетРейтингов.Соревнование КАК Соревнование,
	                |	ПодсчетРейтингов.Спортсмен КАК Спортсмен,
	                |	ФизическиеЛица.Пол КАК Пол,
	                |	ВЫБОР
	                |		КОГДА ФизическиеЛица.Пол = ЗНАЧЕНИЕ(перечисление.полфизическоголица.женский)
	                |			ТОГДА ""Девушки""
	                |		КОГДА ФизическиеЛица.Пол = ЗНАЧЕНИЕ(перечисление.полфизическоголица.мужской)
	                |			ТОГДА ""Юноши""
	                |		ИНАЧЕ """"
	                |	КОНЕЦ КАК ПолПредставление,
	                |	ПодсчетРейтингов.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	                |	СУММА(ПодсчетРейтингов.КоличествоБалловОстаток) КАК КоличествоБаллов
	                |ИЗ
	                |	РегистрНакопления.ПодсчетРейтингов.Остатки(&Период, Рейтинг = &Рейтинг) КАК ПодсчетРейтингов
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	                |		ПО ПодсчетРейтингов.Спортсмен.ФизическоеЛицо = ФизическиеЛица.Ссылка
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ПодсчетРейтингов.Рейтинг,
	                |	ПодсчетРейтингов.УчебныйГод,
	                |	ПодсчетРейтингов.Организатор,
					|	ПодсчетРейтингов.Соревнование,
	                |	ПодсчетРейтингов.Спортсмен,
	                |	ФизическиеЛица.Пол,
	                |	ВЫБОР
	                |		КОГДА ФизическиеЛица.Пол = ЗНАЧЕНИЕ(перечисление.полфизическоголица.женский)
	                |			ТОГДА ""Девушки""
	                |		КОГДА ФизическиеЛица.Пол = ЗНАЧЕНИЕ(перечисление.полфизическоголица.мужской)
	                |			ТОГДА ""Юноши""
	                |		ИНАЧЕ """"
	                |	КОНЕЦ,
	                |	ПодсчетРейтингов.МеждународнаяВозрастнаяГруппа
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	КоличествоБаллов УБЫВ
	                |ИТОГИ ПО
	                |	УчебныйГод,
	                |	Организатор,
	                |	МеждународнаяВозрастнаяГруппа,
	                |	Пол";
	
	//Если НЕ Рейтинг.Пол = Перечисления.ПолФизическогоЛица.ПустаяСсылка() Тогда
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%1", ", Пол");
	//Иначе
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%1", "");
	//КонецЕсли;
	
	ВыборкаУчебныйГод = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаУчебныйГод.Следующий() Цикл
		
		ВыборкаОрганизатор = ВыборкаУчебныйГод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОрганизатор.Следующий() Цикл
			
			ВыборкаМеждународнаяВозрастнаяГруппа = ВыборкаОрганизатор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаМеждународнаяВозрастнаяГруппа.Следующий() Цикл
				
				//Если НЕ Рейтинг.Пол = Перечисления.ПолФизическогоЛица.ПустаяСсылка() Тогда
					ВыборкаПол = ВыборкаМеждународнаяВозрастнаяГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаПол.Следующий() Цикл
						Выборка = ВыборкаПол.Выбрать();
						СформироватьТаблицуМестаПоРейтингу(тзРезультат,Выборка);
					КонецЦикла;	
				//Иначе
				//	Выборка = ВыборкаМеждународнаяВозрастнаяГруппа.Выбрать();
				//	СформироватьТаблицуМестаПоРейтингу(тзРезультат,Выборка); 
				//КонецЕсли;	
				
			КонецЦикла;	
			
		КонецЦикла;	
		
	КонецЦикла;	
	
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; 
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки); 

    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных; 
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, Новый Структура("ТаблицаДанных", тзРезультат) , ДанныеРасшифровки, Истина); 
 
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат); 
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
КонецПроцедуры

Процедура СформироватьТаблицуМестаПоРейтингу(тзРезультат,Выборка)
	
	МаксимальноеЗначение = 9999;
	Место                = 0;
	ПозицияМеста         = 1;
		
	Индекс = 0;
	Пока Выборка.Следующий() Цикл
		строкаРезультат = тзРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(строкаРезультат,Выборка);
		Если Выборка.КоличествоБаллов < МаксимальноеЗначение Тогда
			МаксимальноеЗначение = Выборка.КоличествоБаллов;
			Место =  Индекс + 1;
			строкаРезультат.МестоВРейтинге = Место;
		Иначе
			строкаРезультат.МестоВРейтинге = Место;
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры	


















