
&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.Список.Обновить();
	Сообщить(ПолучитьИзВременногоХранилища(Результат.АдресРезультата));
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьРеестр(Команда)	
	ДлительнаяОперация = НачатьВыполнениеНаСервере(); 
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
КонецПроцедуры

&НаСервере
Функция НачатьВыполнениеНаСервере() 	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Справочники.РеестрУчебныхУчреждений.ЗаполнитьПредопределёнными");
КонецФункции

&НаСервере
Процедура УдалитьЗаписиНаСервере()
	Справочники.РеестрУчебныхУчреждений.УдалитьЗаписи();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаписи(Команда)
	УдалитьЗаписиНаСервере();
КонецПроцедуры