// {Рарус adilas #13548 -Справочник Места занятий 2021.02.25
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СпортивныйОбъект") Тогда
		
		Объект.Владелец = Параметры.СпортивныйОбъект;
		
	КонецЕсли;
	
КонецПроцедуры

// {Рарус dotere #21984 -Обновление данных таблицы после записи места занятий 2021.11.02
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ОбновитьМестаЗанятий");
КонецПроцедуры
// }Рарус dotere #21984 -Обновление данных таблицы после записи места занятий 2021.11.02

// }Рарус adilas #13548 -Справочник Места занятий 2021.02.25

