
#Область ОбработчикиСобытийФормы

// {Рарус adilas #10373 -Сборные спортсмена 2020.10.23
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если  Параметры.ЗначенияЗаполнения.Свойство("Спортсмен", ЗначениеЗаполнено("Спортсмен")) И Запись.Спортсмен.Пустая() Тогда
		Запись.Спортсмен = Параметры.ЗначенияЗаполнения.Спортсмен;
		УчетСпортсменовСервер.ЗаполнитьНастройкиПоУмолчанию(Запись);
	ИначеЕсли Параметры.ЗначенияЗаполнения.Свойство("Спортсмен", Не ЗначениеЗаполнено("Спортсмен")) И Запись.Спортсмен.Пустая() Тогда
		УчетСпортсменовСервер.ЗаполнитьНастройкиПоУмолчанию(Запись);		
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

// }Рарус adilas #10373 -Сборные спортсмена 2020.10.23

// {Рарус adilas #15411 -Тестирование Релиза Альфа Спорт 1.0.0.1. Сборные 2021.04.08
//
&НаКлиенте
Процедура СборнаяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Запись.Организация);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	ОбработчикОповещениеПослеЗакрытия = Новый ОписаниеОповещения("ПослеЗакрытияФормыСборная", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Сборные.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ОбработчикОповещениеПослеЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыСборная(Результат, ДополнительныеПараметры) Экспорт

	Запись.Сборная = Результат;	
	
КонецПроцедуры

// }Рарус adilas #15411 -Тестирование Релиза Альфа Спорт 1.0.0.1. Сборные 2021.04.08

#КонецОбласти