
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"            , ДокументСсылка);
	Запрос.УстановитьПараметр("Дата"              , ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("УчебныйГод"        , ДокументСсылка.УчебныйГод);
	Запрос.УстановитьПараметр("Организация"       , ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("ДокументОснование" , ДокументСсылка.ДокументОснование);
	Запрос.УстановитьПараметр("ВидСпорта"         , ДокументСсылка.ВидСпорта);
	Запрос.УстановитьПараметр("ТипСоревнования"   , ДокументСсылка.ТипСоревнования);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	""ИтоговыеРезультатыСоревнованиийОФПСдачаНормативов"" КАК ИмяРегистра_,
	                |	&Дата КАК Период,
	                |	&УчебныйГод КАК УчебныйГод,
	                |	&Организация КАК Организация,
	                |	&ДокументОснование КАК ДокументОснование,
	                |	&ТипСоревнования КАК ТипСоревнования,
	                |	&ВидСпорта КАК ВидСпорта,
	                |	ПротоколОФП.Спортсмен КАК Спортсмен,
	                |	ПротоколОФП.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	                |	ПротоколОФП.Тренер КАК Тренер,
	                |	ПротоколОФП.Норматив КАК Норматив,
	                |	ПротоколОФП.СтартовыйНомер КАК СтартовыйНомер,
	                |	ПротоколОФП.РезультатЧисло КАК РезультатЧисло,
	                |	ПротоколОФП.РезультатБулево КАК РезультатБулево,
	                |	ПротоколОФП.Место КАК Место
	                |ИЗ
	                |	Документ.ПротоколОФПСдачаНормативов.СоставУчастников КАК ПротоколОФП
	                |ГДЕ
	                |	ПротоколОФП.Ссылка = &Ссылка
	                |	И ПротоколОФП.Норматив <> ЗНАЧЕНИЕ(справочник.нормативы.пустаяссылка)
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	""РезультатыВыполненияПоказателейИНормативов"" КАК ИмяРегистра_,
	                |	&Дата КАК Период,
	                |	&УчебныйГод КАК УчебныйГод,
	                |	&Организация КАК Организация,
	                |	&ДокументОснование КАК ДокументОснование,
	                |	&ТипСоревнования КАК ТипСоревнования,
	                |	&ВидСпорта КАК ВидСпорта,
	                |	ПротоколОФП.Спортсмен КАК Спортсмен,
	                |	ПротоколОФП.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	                |	ПротоколОФП.Тренер КАК Тренер,
	                |	ПротоколОФП.Норматив КАК Норматив,
	                |	ПротоколОФП.РезультатЧисло КАК РезультатЧисло,
	                |	ПротоколОФП.РезультатБулево КАК РезультатБулево,
	                |	ПротоколОФП.Место КАК Место,
	                |	ПротоколОФП.Баллы КАК Балл,
	                |	ПротоколОФП.Очки КАК Очки,
	                |	ПротоколОФП.СтартовыйНомер КАК СтартовыйНомер
	                |ИЗ
	                |	Документ.ПротоколОФПСдачаНормативов.СоставУчастников КАК ПротоколОФП
	                |ГДЕ
	                |	ПротоколОФП.Ссылка = &Ссылка
	                |	И ПротоколОФП.Норматив <> ЗНАЧЕНИЕ(справочник.нормативы.пустаяссылка)
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	""РезультатыПараметровСоревнованиийОФПСдачаНормативов"" КАК ИмяРегистра_,
	                |	&Дата КАК Период,
	                |	&УчебныйГод КАК УчебныйГод,
	                |	&Организация КАК Организация,
	                |	&ДокументОснование КАК ДокументОснование,
	                |	&ТипСоревнования КАК ТипСоревнования,
	                |	&ВидСпорта КАК ВидСпорта,
	                |	ПротоколОФП.Спортсмен КАК Спортсмен,
	                |	ПротоколОФП.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	                |	ПротоколОФП.Норматив КАК Норматив,
	                |	ПротоколОФП.Тренер КАК Тренер,
	                |	ПротоколОФППопытки.НомерПопытки КАК Параметр,
	                |	ПротоколОФППопытки.РезультатЧисло КАК РезультатЧисло,
	                |	ПротоколОФППопытки.РезультатБулево КАК РезультатБулево,
	                |	ПротоколОФППопытки.СостояниеПопытки КАК СостояниеПопытки
	                |ИЗ
	                |	Документ.ПротоколОФПСдачаНормативов.СоставУчастников КАК ПротоколОФП
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПротоколОФПСдачаНормативов.Попытки КАК ПротоколОФППопытки
	                |		ПО ПротоколОФП.Ссылка = ПротоколОФППопытки.Ссылка
	                |			И ((ВЫРАЗИТЬ(ПротоколОФП.УникальныйИдентификаторСтрокиНорматива КАК СТРОКА(36))) = (ВЫРАЗИТЬ(ПротоколОФППопытки.УникальныйИдентификаторСтрокиНорматива КАК СТРОКА(36))))
	                |ГДЕ
	                |	ПротоколОФП.Ссылка = &Ссылка
	                |	И ПротоколОФППопытки.НомерПопытки <> 0
	                |	И ПротоколОФП.Норматив <> ЗНАЧЕНИЕ(справочник.нормативы.пустаяссылка)";
	
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаИтоговыеРезультатыСоревнованиийОФПСдачаНормативов"          , Пакет[0].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаРезультатыВыполненияПоказателейИНормативов"                 , Пакет[1].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаРезультатыПараметровСоревнованиийОФПСдачаНормативов"        , Пакет[2].Выгрузить());
	
    ДополнительныеСвойства.Вставить("Отказ", Отказ);
	
КонецПроцедуры	

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ПротоколОФПСдачаНормативов.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ПротоколОФПСдачаНормативов.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ПротоколОФПСдачаНормативов.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры
