&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если Параметры.Свойство("Тренер") Тогда
        Запись.Тренер = Параметры.Тренер;
        Элементы.Тренер.ТолькоПросмотр = Истина;
    КонецЕсли;
    // {Рарус dotere #19398 -Убрать видимость периода для всех кроме админа 2021.09.08

	Если ПараметрыСеанса.ТекущаяОрганизация.Пустая() Тогда
		 Элементы.Период.Видимость = Истина;
	Иначе
		 Элементы.Период.Видимость = Ложь;
	КонецЕсли;
	Если Запись.ДатаПрисвоения = Дата(1,1,1) Тогда
		  Запись.ДатаПрисвоения = ТекущаяДатаСеанса();
	КонецЕсли
	// }Рарус dotere #19398 -Убрать видимость периода для всех кроме админа 2021.09.08

КонецПроцедуры
// {Рарус dotere #19398 -Убрать видимость периода для всех кроме админа 2021.09.08

&НаКлиенте
Процедура ДатаПрисвоенияПриИзменении(Элемент)
	Запись.Период = Запись.ДатаПрисвоения;
КонецПроцедуры
// }Рарус dotere #19398 -Убрать видимость периода для всех кроме админа 2021.09.08

