
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Владелец") Тогда
		Объект.Владелец = Параметры.Владелец;
	ИначеЕсли Объект.Ссылка.Пустая() Тогда
		ЭтаФорма.Заголовок = "Создание возрастной группы";
		Объект.Владелец = ПараметрыСеанса.ТекущаяОрганизация;
	Иначе
		ЭтаФорма.Заголовок = "Возрастная группа " + ВРег(Объект.Наименование);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ВозрастОт = 0 ИЛИ Объект.ВозрастДо = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо указать возраст!");
		Отказ = Истина;
		Возврат;
		
	ИначеЕсли Объект.ВозрастОт > Объект.ВозрастДо Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо корректно указать диапазон возраста!");
		Отказ = Истина;
		Возврат;	
	КонецЕсли;	
	
КонецПроцедуры
