&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтаФорма.ПредставлениеТекущегоВарианта = "Расшифровка" Тогда
		Возврат;
	КонецЕсли;	
	
	КомпоновщикНастроек = Отчет.КомпоновщикНастроек;
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("УчебныйГодДокумент");
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	Параметр.Значение = ПолучитьУчебныйГод();
	Параметр.Использование = Истина;
	
	Если ЗначениеЗаполнено(Параметр.ИдентификаторПользовательскойНастройки) Тогда
		ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПользовательскийПараметр.Значение = Параметр.Значение;
			ПользовательскийПараметр.Использование = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("Период");
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	Параметр.Значение = ТекущаяДата();
	Параметр.Использование = Истина;
	
	Если ЗначениеЗаполнено(Параметр.ИдентификаторПользовательскойНастройки) Тогда
		ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПользовательскийПараметр.Значение = Параметр.Значение;
			ПользовательскийПараметр.Использование = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ЭлементОтбораИД = КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ИдентификаторПользовательскойНастройки;
	ПользовательскийЭлементОтбора = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбораИД);
	ПользовательскийЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ПользовательскийЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Справочник.Тренеры.ПустаяСсылка");
	ПользовательскийЭлементОтбора.Использование = Ложь;
			
КонецПроцедуры

&НаСервере
Функция ПолучитьУчебныйГод()
	Возврат УчетСпортсменовСервер.ПолучитьДокументТекущегоУчебногоГода();
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ВариантМодифицирован = Ложь;
КонецПроцедуры
