// {Рарус dotere #17262 -Печатная форма 2021.07.02
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	// {Рарус adilas #17262 -Печатная форма. Отчисление из спортивного учреждения 2021.07.16
	//#Если ВебКлиент Тогда
		//Печать("Документ.ИсключениеИзСпортивногоУчреждения", "ПФ_DOC_ПриказИсключение",  ПараметрКоманды, "Приказ на отчисление Word");
	//#Иначе
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати
		(
		"Документ.ИсключениеИзСпортивногоУчреждения",
		"ПФ_MXL_ИсключениеИзСпортивногоУчереждения",
		ПараметрКоманды,
		Неопределено,
		Неопределено
		);
	//#КонецЕсли
	// }Рарус adilas #17262 -Печатная форма. Отчисление из спортивного учреждения 2021.07.16
	
КонецПроцедуры
// }Рарус dotere #17262 -Печатная форма 2021.07.02
