
&НаКлиенте
Процедура Сформировать(Команда)
	
	Если СписокГрупп.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбраны документы для формирования приказов!",,"СписокГрупп");
		Возврат;
	КонецЕсли;
	
	МассивДокументов = Новый Массив;
	Для Каждого ЗначениеСписка Из СписокГрупп Цикл
		МассивДокументов.Добавить(ЗначениеСписка.Значение);
	КонецЦикла;
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати
		(
		"Документ.ФормированиеГруппы",
		"ПФ_MXL_Приказ",
		МассивДокументов,
		Неопределено,
		Неопределено
		);
	
КонецПроцедуры
