// {Рарус adilas #9248 -Вынести команду печать заявки на форму рабочего стола тренера 2020.09.08
//
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПечатьЗаявки(Команда)
	// Массив выделенных строк из списка СоставКоманд.
	ДанныеПечати = Элементы.Список.ВыделенныеСтроки;
	
	МассивЗаявокСоревнований 	= Новый Массив;  
	//Цикл по разделению документов
	Для каждого ОбъектПечати Из ДанныеПечати Цикл
	
		Если ТипЗнч(ОбъектПечати) = Тип("ДокументСсылка.ЗаявкаНаПроведениеСоревнования") Тогда
			МассивЗаявокСоревнований.Добавить(ОбъектПечати); 	         
		ИначеЕсли ТипЗнч(ОбъектПечати) = Тип("ДокументСсылка.ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФП") Тогда 			
			ОбщегоНазначенияКлиент.СообщитьПользователю("Для данного типа документа печать заявки не предусмотрена");
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю("Для данного типа документа печать заявки не предусмотрена");
		КонецЕсли; 
	
	КонецЦикла;  
	
	#Если Не ВебКлиент Тогда
		Если МассивЗаявокСоревнований.Количество() <> 0 Тогда 
			Печать("Документ.ЗаявкаНаПроведениеСоревнования", "ЗаявкаWord", МассивЗаявокСоревнований, "Заявка word");
		КонецЕсли;
	#Иначе
		Если МассивЗаявокСоревнований.Количество() <> 0 Тогда	
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати
			(
			"Документ.ЗаявкаНаПроведениеСоревнования",
			"ЗаявкаТабДок",
			МассивЗаявокСоревнований,
			Неопределено,
			Неопределено
			);
		КонецЕсли;
	#КонецЕсли
		
КонецПроцедуры

&НаКлиенте
Процедура Печать(ИмяМенеджераПечати, ИмяМакета, ДанныеПечати, НаименованиеМакета) Экспорт
	
	Если ДанныеПечати.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;   
		
	МакетИДанныеОбъекта = УправлениеПечатьюВызовСервера.МакетыИДанныеОбъектовДляПечати(ИмяМенеджераПечати, ИмяМакета, ДанныеПечати);
	
	Вывести(ДанныеПечати, МакетИДанныеОбъекта, ИмяМакета, МакетИДанныеОбъекта.ЛокальныйКаталогФайловПечати, НаименованиеМакета);
	
КонецПроцедуры

&НаКлиенте
Процедура Вывести(ДанныеПечати, МакетИДанныеОбъекта, ИмяМакета, ЛокальныйКаталогФайловПечати, НаименованиеМакета)
	
	ТипМакета				= МакетИДанныеОбъекта.Макеты.ТипыМакетов[ИмяМакета];
	ДвоичныеДанныеМакетов	= МакетИДанныеОбъекта.Макеты.ДвоичныеДанныеМакетов;
	Области					= МакетИДанныеОбъекта.Макеты.ОписаниеОбластей;
		
	Макет = УправлениеПечатьюКлиент.ИнициализироватьМакетОфисногоДокумента(ДвоичныеДанныеМакетов[ИмяМакета], ТипМакета, ИмяМакета);
	Если Макет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗакрытьОкноПечатнойФормы = Ложь;
	
	Для Каждого ОбъектДанных Из ДанныеПечати Цикл
		
		ДанныеОбъектаМассив     = МакетИДанныеОбъекта.Данные[ОбъектДанных][ИмяМакета];
		
		Для Каждого ДанныеОбъекта Из  ДанныеОбъектаМассив Цикл
			
			Попытка
				
				ПечатнаяФорма = УправлениеПечатьюКлиент.ИнициализироватьПечатнуюФорму(ТипМакета, Макет.НастройкиСтраницыМакета);
				Если ПечатнаяФорма = Неопределено Тогда
					УправлениеПечатьюКлиент.ОчиститьСсылки(Макет);
					Возврат;                                                             
				КонецЕсли;
				
				Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["Заголовок"]);
				УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта.Заголовок, Ложь);
				
				Для Каждого СтрокаТаблицы Из ДанныеОбъекта.СтрокиТаблицы Цикл
					Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["СтрокаТаблицы"]);
					УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, СтрокаТаблицы, Ложь);		
				КонецЦикла;
				
				Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["Подвал"]);
				УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта.Подвал, Ложь);	
				
				УправлениеПечатьюКлиент.ПоказатьДокумент(ПечатнаяФорма);
				
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗакрытьОкноПечатнойФормы = Истина;
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЦикла;
	
	УправлениеПечатьюКлиент.ОчиститьСсылки(ПечатнаяФорма, ЗакрытьОкноПечатнойФормы);
	УправлениеПечатьюКлиент.ОчиститьСсылки(Макет);
	
КонецПроцедуры

// }Рарус adilas #9248 -Вынести команду печать заявки на форму рабочего стола тренера 2020.09.08
#КонецОбласти
