#Область ОбработчикиСобытий

// {Рарус adilas #18123 -Сборные 2021.07.29
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сборные.Представление КАК Сборная,
		|	Сборные.РангСборной.Представление КАК РангСборной,
		|	Сборные.Владелец.Представление КАК Организация
		|ИЗ
		|	Справочник.Сборные КАК Сборные
		|ГДЕ
		|	Сборные.Наименование = &Наименование
		|	И Сборные.Владелец = &Владелец
		|	И Сборные.РангСборной = &РангСборной";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("РангСборной", РангСборной);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Cборная с указанным наименованием, и рангом уже существует в учреждении'"));  
	
	КонецЕсли;
	
КонецПроцедуры
// }Рарус adilas #18123 -Сборные 2021.07.29

#КонецОбласти