#Область ОбработчикиСобытий

// {Рарус adilas #18870 -Дисциплины 2021.07.30
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если Параметры.Свойство("Наименование") Тогда	
			Объект.Наименование = Параметры.Наименование;	
		КонецЕсли;
		
		Если Параметры.Свойство("Владелец") Тогда	
			Объект.Владелец = Параметры.Владелец;		
		КонецЕсли;	
		
		Если Параметры.Свойство("ДисциплинаПоРеестру") Тогда	
			Объект.ДисциплинаПоРеестру = Параметры.ДисциплинаПоРеестру;	
		КонецЕсли;
		
	КонецЕсли;		
	
КонецПроцедуры
// }Рарус adilas #18870 -Дисциплины 2021.07.30

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВладелецПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура ВладелецПриИзмененииНаСервере()
	Дисциплина = Справочники.РеестрСпортивныхДисциплин.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеестрСпортивныхДисциплин.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РеестрСпортивныхДисциплин КАК РеестрСпортивныхДисциплин
		|ГДЕ
		|	РеестрСпортивныхДисциплин.Владелец.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Владелец.ВидСпортаПоРеестру.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Элементы.ДисциплинаПоРеестру.СписокВыбора.Очистить();
	номер = 0;
	Пока Выборка.Следующий() Цикл
		Элементы.ДисциплинаПоРеестру.СписокВыбора.Вставить(Номер,Выборка.Ссылка);
		Номер = Номер+1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	ВладелецПриИзмененииНаСервере();
КонецПроцедуры

// {Рарус adilas #18823 -Спортивные дисциплины 2021.07.29
&НаКлиенте
Процедура ДисциплинаПоРееструНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	СпортивнаяДисциплинаПоРееструОткрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СпортивнаяДисциплинаПоРееструОткрыть()
	
	Владелец = Неопределено;
	ВладелецПоВидуСпортаНаСервере(Владелец);

	ПараметрыФормыВыбора = Новый Структура;
	
	ПараметрыФормыВыбора.Вставить("РежимВыбора", Истина);
	ПараметрыФормыВыбора.Вставить("Владелец", Владелец);
	
	Обработчик = Новый ОписаниеОповещения(
		"ПослеВыбораДисциплины", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.РеестрСпортивныхДисциплин.ФормаВыбора", ПараметрыФормыВыбора, , , , , Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДисциплины(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> Неопределено Тогда
		Объект.ДисциплинаПоРеестру = Результат;
	КонецЕсли;
	
КонецПроцедуры
// }Рарус adilas #18823 -Спортивные дисциплины 2021.07.29

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// {Рарус adilas #18823 -Спортивные дисциплины 2021.07.29
&НаСервере
Процедура ВладелецПоВидуСпортаНаСервере(Владелец) Экспорт 
	
	Владелец = Объект.Владелец.ВидСпортаПоРеестру;
	
КонецПроцедуры
// }Рарус adilas #18823 -Спортивные дисциплины 2021.07.29

#КонецОбласти