
// {Рарус adilas #18035 -Перевод спортсменов на этап 2021.07.05
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// {Рарус adilas #23059 -РС Руководитель. Карточка спортсмена.Карточка тренера. 2021.12.13
	// {Рарус dotere #21842 -В методите поле ответственный недоступно 2020.11.06
	Если РольДоступна("ПолныеПрава") Тогда
		 Элементы.Ответственный.Доступность = Истина;
	Иначе 	 
		 Элементы.Ответственный.Доступность = Ложь;
	КонецЕсли;
	// }Рарус dotere #21842 -В методите поле ответственный недоступно 2020.11.06
	// }Рарус adilas #23059 -РС Руководитель. Карточка спортсмена.Карточка тренера. 2021.12.13
	
	// {Рарус adilas #10700 -Вид спорта подставлять по текущему этапу спортсмена 2020.11.05
	Если Объект.Ссылка.Пустая() Тогда
		УчетСпортсменовСервер.ЗаполнитьНастройкиПоУмолчанию(Объект);
	КонецЕсли;
	// }Рарус adilas #10700 -Вид спорта подставлять по текущему этапу спортсмена 2020.11.05
	
	Если Параметры.Свойство("Спортсмен") Тогда
		СтрокаСпортсмен = Объект.Спортсмены.Добавить();
		СтрокаСпортсмен.Спортсмен = Параметры.Спортсмен;
	КонецЕсли;	
	
	ЗаполнитьСписокВыбораЭтап();
	
	// {Рарус adilas #13392 -Номер документа 2021.02.12
	Если Пользователи.РолиДоступны("АдминистраторСистемы, ПолныеПрава") Тогда
		Элементы.Номер.Доступность = Истина;
		Элементы.Номер.ТолькоПросмотр = Ложь;
	КонецЕсли;
	// }Рарус adilas #13392 -Номер документа 2021.02.12
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСпортсмены

&НаКлиенте
Процедура СпортсменыСпортсменНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	
	Если Объект.ДатаПеревода = Дата(1, 1, 1) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Укажите дату перевода!'");
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.Поле = "ДатаПеревода";
		Сообщение.Сообщить();
		Возврат;	
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Организация) Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Укажите спортивное учреждение!'");
	    Сообщение.ПутьКДанным = "Объект";
		Сообщение.Поле = "Организация";
		Сообщение.Сообщить();
		Возврат;
	Иначе
		ПараметрыФормы.Вставить("ДатаСреза", УчетСпортсменовВызовСервера.ТекущаяДатаНаСервере());
	    ПараметрыФормы.Вставить("Организация", Объект.Организация);
	КонецЕсли;

	ПараметрыФормы.Вставить("ТолькоВыбор", Истина);
	ОбработчикВыбора = Новый ОписаниеОповещения("СпортсменНачалоВыбораЗавершение", ЭтотОбъект);
		
	ОткрытьФорму("Справочник.Спортсмены.Форма.ФормаВыбораСоставУчащихся", ПараметрыФормы, ЭтаФорма, , , , ОбработчикВыбора);
	
КонецПроцедуры
// {Рарус dotere #22997 -Подставляет в таблицу выбранного спортсмена 2021.12.09
&НаКлиенте
Процедура СпортсменНачалоВыбораЗавершение(Резултат, ДополнительныеПараметры) Экспорт
	Если Не Резултат = Неопределено Тогда
		Код = Элементы.Спортсмены.ТекущаяСтрока;
		Спортсмены = Объект.Спортсмены.НайтиПоИдентификатору(Код);
		Спортсмены.Спортсмен = Резултат.Спортсмен;
	КонецЕсли
КонецПроцедуры
// }Рарус dotere #22997 -Подставляет в таблицу выбранного спортсмена 2021.12.09
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораЭтап()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ЭтапыСпортивнойПодготовки.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.ЭтапыСпортивнойПодготовки КАК ЭтапыСпортивнойПодготовки
					|ГДЕ
					|	ЭтапыСпортивнойПодготовки.Родитель <> ЗНАЧЕНИЕ(Справочник.ЭтапыСпортивнойПодготовки.пустаяссылка)";
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		ТЗРезультат = Результат.Выгрузить();
		Элементы.Этап.СписокВыбора.ЗагрузитьЗначения(ТЗРезультат.ВыгрузитьКолонку("Ссылка"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
// }Рарус adilas #18035 -Перевод спортсменов на этап 2021.07.05