
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("УчебныйГод") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"УчебныйГод",Параметры.УчебныйГод,ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
	Если Параметры.Свойство("УчебныйГодОткрыт") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"УчебныйГодОткрыт",Истина,ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
КонецПроцедуры
