
Функция КоординатыПоАдресу(Адрес) экспорт
	// {Рарус ivaart IN-19390 обработка ошибок получения данных 2021.08.27
	СтруктураОшибки = новый Структура;
	
    Заголовки=Новый Соответствие();
    Заголовки.Вставить("Content-Type","text/xml; charset=UTF-8");

    АдресСервера = "nominatim.openstreetmap.org";
    ПутьНаСервере = "search?q="+СтрЗаменить(Адрес," ","+")+"&format=xml&addressdetails=1";
    
    Запрос=Новый HTTPЗапрос();
    Запрос.АдресРесурса=ПутьНаСервере;
    Запрос.Заголовки=Заголовки;
	Прокси = Константы.НастройкаПроксиСервера.Получить().Получить();
	Если Прокси = Неопределено тогда
		Прокси = Новый ИнтернетПрокси(Истина);
		Прокси.Сервер("https");
	КонецЕсли;
	
    Попытка 
        ИмяВыходногоФайла = ПолучитьимяВременногоФайла();
        Соединение          = Новый HTTPСоединение(АдресСервера,,,,
    		Прокси,
    		60, 
    		ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение());
        ТекстОтвета = Соединение.Получить(Запрос);
    	Дом = ТекстОтвета.ПолучитьТелоКакСтроку();
	Исключение
		СтруктураОшибки.Вставить("Ошибка", "Произошла ошибка подключения!
		|При необходимости введите данные вручную.");
    	Возврат СтруктураОшибки;
	КонецПопытки;
	
    НачалоЗначения = СтрНайти(Дом, "lat='")+5;
	
	Если НачалоЗначения <> 5 тогда
	    координаты = новый Структура();
	    КонецЗначения = СтрНайти(Дом, "' lon");
	    координаты.Вставить("Широта", Сред(Дом,НачалоЗначения, КонецЗначения-НачалоЗначения));
	    НачалоЗначения = КонецЗначения+7;
	    КонецЗначения = СтрНайти(Дом, "' display_name='");
	    координаты.Вставить("Долгота", Сред(Дом,НачалоЗначения, КонецЗначения-НачалоЗначения));
	    НачалоЗначения = КонецЗначения+16;
	    КонецЗначения = СтрНайти(Дом, "' class");
	    координаты.Вставить("ПолныйАдрес", Сред(Дом,НачалоЗначения, КонецЗначения-НачалоЗначения));
	Иначе
		СтруктураОшибки.Вставить("Ошибка", "Объект не найден!
		|Укажите более точный адрес в формате <Страна, Город, Улица, Дом> и повторите попытку.");
    	Возврат СтруктураОшибки;
	КонецЕсли;
    // {Рарус ivaart IN-19390 обработка ошибок получения данных 2021.08.27
	
    Попытка
       УдалитьФайлы(ИмяВыходногоФайла);
    Исключение
       ЗаписьЖурналаРегистрации(НСтр("ru = 'Мой механизм.Действие'"), УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
   КонецПопытки;
   
    Возврат координаты;
КонецФункции