#Область ОбработчикиСобытийОбъекта

Процедура ПередЗаписью(Отказ)
	
	// {Рарус adilas #1.0.0.2 -SonarQube 2021.04.23
	Если ОбменДанными.Загрузка Тогда
         Возврат;
	 КонецЕсли;
	 
	// }Рарус adilas #1.0.0.2 -SonarQube 2021.04.23
	
	УчетСпортсменовСервер.ЗаполнитьРеквизит(ЭтотОбъект, "Ответственный", ПараметрыСеанса.ТекущийПользователь);
	
	
	Если НЕ ЗначениеЗаполнено(ФамилияЛатиница) Тогда
		ФамилияЛатиница = УчетСпортсменовСервер.Транслит(Фамилия);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ИмяЛатиница) Тогда
		ИмяЛатиница = УчетСпортсменовСервер.Транслит(Имя);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ОтчествоЛатиница) Тогда
		ОтчествоЛатиница = УчетСпортсменовСервер.Транслит(Отчество);
	КонецЕсли;
	Если НЕ ДатаРождения = Дата(1,1,1) И ГодРождения = "" Тогда
		ГодРождения = СокрЛП(СтрЗаменить(Год(ДатаРождения)," ",""));
	КонецЕсли;	
	
КонецПроцедуры

// {Рарус adilas #9299 -Вести историю изменений физлица (какая организация когда изменила) 2020.09.11
//
Процедура ПриЗаписи(Отказ)
	// Вставить содержимое обработчика.
	Если ОбменДанными.Загрузка Тогда
         Возврат;
	Иначе
		Если Не Отказ Тогда
		СоответствиеФизическихЛицИОрганизацийСервер.ОбработкаПриЗаписиВСправочникФизическиеЛицаПриЗаписи(ЭтотОбъект, Ложь);
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СоответствияПользователейИОрганизаций.Пользователь КАК Пользователь,
			|	СоответствияПользователейИОрганизаций.Организация КАК Организация
			|ИЗ
			|	Справочник.Пользователи КАК Пользователи
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияПользователейИОрганизаций КАК СоответствияПользователейИОрганизаций
			|		ПО Пользователи.Ссылка = СоответствияПользователейИОрганизаций.Пользователь
			|ГДЕ
			|	Пользователи.Ссылка = &Пользователь";
		
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		
		Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();	
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				// Вставить обработку выборки ВыборкаДетальныеЗаписи
				// Добавление записи в независимый непериодический регистр сведений
				Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Пользователь) И НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Организация) Тогда
					
					НоваяЗапись = РегистрыСведений.ИсторияИзмененийФизическогоЛица.СоздатьМенеджерЗаписи();
					
					НоваяЗапись.Пользователь 		= ТекущийПользователь;
					НоваяЗапись.Организация 		= ВыборкаДетальныеЗаписи.Организация;
					НоваяЗапись.ДатаИзменения 		= ТекущаяДатаСеанса();
					НоваяЗапись.ФизическоеЛицо 		= Ссылка;
					
					НоваяЗапись.Записать();
					
					ОбщегоНазначения.СообщитьПользователю("Не найдено соответствий текущего пользователя и организации!");
				Иначе
					НоваяЗапись = РегистрыСведений.ИсторияИзмененийФизическогоЛица.СоздатьМенеджерЗаписи();
					
					НоваяЗапись.Пользователь 		= ВыборкаДетальныеЗаписи.Пользователь;
					НоваяЗапись.Организация 		= ВыборкаДетальныеЗаписи.Организация;
					НоваяЗапись.ДатаИзменения 		= ТекущаяДатаСеанса();
					НоваяЗапись.ФизическоеЛицо 		= Ссылка;
					
					НоваяЗапись.Записать();
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//}Рарус adilas #9299 -Вести историю изменений физлица (какая организация когда изменила) 2020.09.11

#КонецОбласти