
&НаКлиенте
Процедура Сформировать(Команда)
	
	Если СписокДокументов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбраны документы для формирования согласий!",,"СписокДокументов");
		Возврат;
	КонецЕсли;
	
	МассивДокументов = Новый Массив;
	Для Каждого ЗначениеСписка Из СписокДокументов Цикл
		МассивДокументов.Добавить(ЗначениеСписка.Значение);
	КонецЦикла;
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати
		(
		"Документ.СогласиеНаОбработкуПерсональныхДанных",
		"СогласиеНАОбработкуПерсональныхДанных",
		МассивДокументов,
		Неопределено,
		Неопределено
		);
	
КонецПроцедуры
