
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// {Рарус dotere #21138 -Закомментировал из за ошибки, на работоспособность не влияет 2021.10.27
	
	
	//	Идентификатор = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(Отчет.КомпоновщикНастроек.Настройки["ПараметрыДанных"].НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация")));
	//	ПараметрОрганизация = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
	//	ПараметрОрганизация.Значение = Неопределено;
	//    ПараметрОрганизация.Использование = Ложь;
	//    ПараметрОрганизация.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	//Если ПользователюРольДоступна("Методист") И Не ПользователюРольДоступна("МетодистРасширенная") Тогда
	//	ПараметрОрганизация.Значение = ТекущаяОрганизация();
	//    ПараметрОрганизация.Использование = Истина;
	//    ПараметрОрганизация.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//КонецЕсли;
	//
	//ИдентификаторВидСпортаПоРеестру = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(Отчет.КомпоновщикНастроек.Настройки["ПараметрыДанных"].НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидСпортаПоРеестру")));
	//ПараметрВидСпортаПоРеестру = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторВидСпортаПоРеестру);

	//ИдентификаторВидСпорта = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(Отчет.КомпоновщикНастроек.Настройки["ПараметрыДанных"].НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидСпорта")));
	//ПараметрВидСпорта = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторВидСпорта);
	//
	//Если ПользователюРольДоступна("Методист") И Не ПользователюРольДоступна("ПолныеПрава") Тогда
	//    ПараметрВидСпортаПоРеестру.Использование = Ложь;
	//    ПараметрВидСпортаПоРеестру.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//Иначе
	//    ПараметрВидСпорта.Использование = Ложь;
	//    ПараметрВидСпорта.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;		
	//КонецЕсли;
	
	// }Рарус dotere #21138 -Закомментировал из за ошибки, на работоспособность не влияет 2021.10.27
КонецПроцедуры

&НаСервере
Функция ТекущаяОрганизация()
	Возврат ПараметрыСеанса.ТекущаяОрганизация;
КонецФункции

&НаСервере
Функция ПользователюРольДоступна(РольИмя)
	Возврат РольДоступна(РольИмя);
КонецФункции

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	// {Рарус dotere #21138 -Закомментировал из за ошибки, на работоспособность не влияет 2021.10.27
	
	//	Идентификатор = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(Отчет.КомпоновщикНастроек.Настройки["ПараметрыДанных"].НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация")));
	//	ПараметрОрганизация = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
	//	ПараметрОрганизация.Значение = Неопределено;
	//    ПараметрОрганизация.Использование = Ложь;
	//    ПараметрОрганизация.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	//Если ПользователюРольДоступна("Методист") И Не ПользователюРольДоступна("ПолныеПрава") Тогда
	//	ПараметрОрганизация.Значение = ТекущаяОрганизация();
	//    ПараметрОрганизация.Использование = Истина;
	//    ПараметрОрганизация.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//КонецЕсли;
	//	
	//ИдентификаторВидСпортаПоРеестру = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(Отчет.КомпоновщикНастроек.Настройки["ПараметрыДанных"].НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидСпортаПоРеестру")));
	//ПараметрВидСпортаПоРеестру = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторВидСпортаПоРеестру);

	//ИдентификаторВидСпорта = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(Отчет.КомпоновщикНастроек.Настройки["ПараметрыДанных"].НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидСпорта")));
	//ПараметрВидСпорта = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторВидСпорта);
	//
	//Если ПользователюРольДоступна("Методист") И Не ПользователюРольДоступна("ПолныеПрава") Тогда
	//    ПараметрВидСпортаПоРеестру.Использование = Ложь;
	//    ПараметрВидСпортаПоРеестру.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//Иначе
	//    ПараметрВидСпорта.Использование = Ложь;
	//    ПараметрВидСпорта.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;		
	//КонецЕсли;
	
	// }Рарус dotere #21138 -Закомментировал из за ошибки, на работоспособность не влияет 2021.10.27
	
	// {Рарус dotere #21138 -Скрывает некоторые отборы для руководителя и методиста 2021.10.27
	// {Рарус dotere #SonarQube -1.0.0.4 2021.10.29
	Если РольДоступна("Методист") ИЛИ ПривилегированныйРежим() Тогда
		ПолеОтбораВидСпортаПоРеестру = Новый ПараметрКомпоновкиДанных("ВидСпортаПоРеестру");
		ПолеОтбораОрганизация = Новый ПараметрКомпоновкиДанных("Организация");
		СкрытиеОтбора(ПолеОтбораВидСпортаПоРеестру);
		СкрытиеОтбора(ПолеОтбораОрганизация);
    ИначеЕсли РольДоступна("Руководитель") ИЛИ ПривилегированныйРежим() Тогда
	    ПолеОтбораВидСпорта = Новый ПараметрКомпоновкиДанных("ВидСпорта");
		СкрытиеОтбора(ПолеОтбораВидСпорта);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СкрытиеОтбора(ПолеОтбора)
	ЭлементОтбора = Неопределено;
    Для Каждого Отбор Из Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
        Если Отбор.Параметр = ПолеОтбора Тогда
			Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры
	// }Рарус dotere #SonarQube -1.0.0.4 2021.10.29
	// }Рарус dotere #21138 -Скрывает некоторые отборы для руководителя и методиста 2021.10.27
