#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// {Рарус adilas #13194 -Отчет "Спортивные сборные команды спортсменов" 2021.08.30
&НаСервере
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПараметрСКДПериод = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти("be0cbc17-0cba-48e3-b8e6-392f6dbb7191");
	
	Если ПараметрСКДПериод <> Неопределено Тогда	
		Если (ПараметрСКДПериод.Значение = Дата(1, 1, 1) ИЛИ ПараметрСКДПериод.Использование = Ложь) 
				ИЛИ (ПараметрСКДПериод.Значение = Дата(1, 1, 1) И ПараметрСКДПериод.Использование = Истина) Тогда	 
			УстановитьПараметрПользовательскойНастройки(КомпоновщикНастроек.ПользовательскиеНастройки, "Период", НачалоДня(ТекущаяДатаСеанса()));	
		КонецЕсли;
	КонецЕсли;
	
	НастройкиКомпановки = КомпоновщикНастроек.ПолучитьНастройки();
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпановки);
			   	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьПараметрПользовательскойНастройки(ПользовательскиеНастройки, ИмяНастройки, Значение)
	
	ПолеКомпановкиПараметр = Новый ПараметрКомпоновкиДанных(ИмяНастройки);
	ЭлементОтбора = Неопределено;
	
	Для Каждого Элемент Из ПользовательскиеНастройки.Элементы Цикл
		Если Элемент.Параметр = ПолеКомпановкиПараметр Тогда 
			Элемент.Значение = Значение;
			Элемент.Использование = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
// }Рарус adilas #13194 -Отчет "Спортивные сборные команды спортсменов" 2021.08.30

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли