#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ВыполнитьПроверкуПередПроведением(Отказ);
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
		
	ПроведениеСервер.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	УчетСпортсменовСервер.ЗаполнитьРеквизит(ЭтотОбъект, "Ответственный", ПараметрыСеанса.ТекущийПользователь);
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	ПроведениеСервер.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСервер.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ, "ВыездыСпортсменов");
	ПроведениеСервер.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ, "ВыездыТренеров");

	Движения.Записать();

	ПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);

	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);

	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	Движения.Записать();

	ПроведениеСервер.ВыполнитьКонтрольРезультатовОтменыПроведения(ЭтотОбъект, Отказ);

	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

#КонецОбласти

Процедура ВыполнитьПроверкуПередПроведением(Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыездСпортсменовНаМероприятие.НомерСоревнования КАК НомерСоревнования
		|ИЗ
		|	Документ.ВыездСпортсменовНаМероприятие КАК ВыездСпортсменовНаМероприятие
		|ГДЕ
		|	ВыездСпортсменовНаМероприятие.Ссылка <> &Ссылка
		|	И ВыездСпортсменовНаМероприятие.Организация = &Организация
		|	И ВыездСпортсменовНаМероприятие.ПометкаУдаления = ЛОЖЬ
		|	И ВыездСпортсменовНаМероприятие.Проведен = ИСТИНА
		|	И ВыездСпортсменовНаМероприятие.ВидСпорта = &ВидСпорта
		|	И ВыездСпортсменовНаМероприятие.Соревнование = &Соревнование";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НомерСоревнования", НомерСоревнования);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Соревнование", Соревнование);
	Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выезд уже существует");
	КонецЕсли
	
	
КонецПроцедуры