
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// {Рарус adilas #11666 -Тестирование. Пункт №2 2020.12.09
	// Отбор спортсменов по дате
	Если Дата = Дата(1,1,1) Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ДатаСреза", ТекущаяДатаСеанса());
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ДатаСреза", Дата);
	КонецЕсли;
	
	// }Рарус adilas #11666 -Тестирование. Пункт №2 2020.12.09
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	// {Рарус adilas #11666 -Тестирование. Пункт №2 2020.12.09
	// Отбор спортсменов по дате
	Если Дата = Дата(1,1,1) Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ДатаСреза", ТекущаяДатаСеанса());
		Элементы.Список.Обновить();
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ДатаСреза", Дата);
		Элементы.Список.Обновить();
	КонецЕсли;
	
	// }Рарус adilas #11666 -Тестирование. Пункт №2 2020.12.09
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры
