// {Рарус adilas #11575 -Создать отчет Данные по спортивным разрядам и званиям 2021.06.02
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УправлениеУчебнымГодом.УчебныйГод.ДатаНачала КАК УчебныйГодДатаНачала,
		|	УправлениеУчебнымГодом.УчебныйГод.ДатаОкончания КАК УчебныйГодДатаОкончания
		|ИЗ
		|	Документ.УправлениеУчебнымГодом КАК УправлениеУчебнымГодом
		|ГДЕ
		|	УправлениеУчебнымГодом.УчебныйГодОткрыт = ИСТИНА
		|	И &Период МЕЖДУ УправлениеУчебнымГодом.УчебныйГод.ДатаНачала И УправлениеУчебнымГодом.УчебныйГод.ДатаОкончания
		|	И УправлениеУчебнымГодом.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", ПараметрыСеанса.ТекущаяОрганизация);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НачалоПериода = ВыборкаДетальныеЗаписи.УчебныйГодДатаНачала;
			КонецПериода =  ВыборкаДетальныеЗаписи.УчебныйГодДатаОкончания;
		КонецЦикла;
	КонецЕсли;
	
	ПараметрСКДНачало   			= Новый ПараметрКомпоновкиДанных("НачалоПериода");
	ЗначениеПараметрСКДНачало 		= НачалоПериода;
	ПараметрСКДКонец    			= Новый ПараметрКомпоновкиДанных("КонецПериода");
	ЗначениеПараметрСКДКонец 		= КонецПериода;
	ПараметрСКДОрганизация    		= Новый ПараметрКомпоновкиДанных("Организация");
	ЗначениеПараметрСКДОрганизация 	= ПараметрыСеанса.ТекущаяОрганизация;
		
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрСКДНачало, ЗначениеПараметрСКДНачало);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрСКДКонец, ЗначениеПараметрСКДКонец);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрСКДОрганизация, ЗначениеПараметрСКДОрганизация);
		
КонецПроцедуры

#КонецОбласти
// }Рарус adilas #11575 -Создать отчет Данные по спортивным разрядам и званиям 2021.06.02