
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"			, ДокументСсылка);
	Запрос.УстановитьПараметр("Организация"		, ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("ВидСпорта"		, ДокументСсылка.ВидСпорта);
	Запрос.УстановитьПараметр("УчебныйГод"		, ДокументСсылка.УчебныйГод);
	Запрос.УстановитьПараметр("Соревнование"	, ДокументСсылка.ДокументОснование.Соревнование);
	Запрос.УстановитьПараметр("Период"			, ДокументСсылка.ДокументОснование.ДатаНачалаСоревнования);
	Запрос.УстановитьПараметр("ДокументОснование"		, ДокументСсылка.ДокументОснование);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Спортсмены.Спортсмен КАК Спортсмен,
	|	Спортсмены.КлючСтроки КАК КлючСтроки
	|ПОМЕСТИТЬ ВТ_Спортсмены
	|ИЗ
	|	Документ.РегистрацияДостиженийСпортсменов.Спортсмены КАК Спортсмены
	|ГДЕ
	|	Спортсмены.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Достижения.Характеристика КАК Характеристика,
	|	Достижения.Значение КАК Значение,
	|	Достижения.КлючСтроки КАК КлючСтроки
	|ПОМЕСТИТЬ ВТ_Достижения
	|ИЗ
	|	Документ.РегистрацияДостиженийСпортсменов.Достижения КАК Достижения
	|ГДЕ
	|	Достижения.Ссылка = &Ссылка
	|	И Достижения.Значение <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""ДостиженияСпортсменов"" КАК ИмяРегистра_,
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	&ВидСпорта КАК ВидСпорта,
	|	&УчебныйГод КАК УчебныйГод,
	|	&Соревнование КАК Соревнование,
	|	&ДокументОснование КАК ДокументОснование,
	|	ВТ_Спортсмены.Спортсмен КАК Спортсмен,
	|	ВТ_Достижения.Характеристика КАК Характеристика,
	|	ВТ_Достижения.Значение КАК Значение
	|ИЗ
	|	ВТ_Достижения КАК ВТ_Достижения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Спортсмены КАК ВТ_Спортсмены
	|		ПО ВТ_Достижения.КлючСтроки = ВТ_Спортсмены.КлючСтроки";
	
	ТаблицаДостижения = Запрос.Выполнить().Выгрузить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаДостиженияСпортсменов", ТаблицаДостижения);
	
    ДополнительныеСвойства.Вставить("Отказ", Отказ);
	
КонецПроцедуры	

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.РегистрацияДостиженийСпортсменов.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.РегистрацияДостиженийСпортсменов.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.РегистрацияДостиженийСпортсменов.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры
