// {Рарус ivaart IN-21502 Расшифровка отчёта 2021.11.29
&НаКлиенте
Процедура ОбработатьРасшифровку(ВыбранноеДействие,ВыбранноеЗначение,Параметр3) Экспорт
	Если ВыбранноеДействие <> ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет Тогда
		Если ВыбранноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
			ПоказатьЗначение(,ВыбранноеЗначение);
		КонецЕсли;
	Иначе
		Поле = Параметр3.Область;
		Область = ОбластьВСтруктуру(Поле);
		Колонка = Область.R;
		Если Область.C = 2 тогда
			Если Не ПроверитьРасшифровку(Область) тогда
				Область.C = 1;
				ТабПоле = Результат.Область(СтруктуруВОбласть(Область));
				ТекстПоля = ТабПоле.Текст;
				ИмяЗапроса = ТекстПоля;
			ИначеЕсли ПроверитьСтолбец(Область) тогда
				ИмяЗапроса = ПолучитьСтолбец(Область);
			Иначе
				ИмяЗапроса = "Всего спортсменов";
			КонецЕсли;
		ИначеЕсли Область.C = 3 тогда
			Если ПроверитьСтолбец(Область) тогда
				ИмяЗапроса = ПолучитьСтолбец(Область);
			Иначе	
				ИмяЗапроса = "Всего разрядов";
			КонецЕсли;
		ИначеЕсли Область.C = 4 тогда
			Если ПроверитьСтолбец(Область) тогда
				ИмяЗапроса = ПолучитьСтолбец(Область);
			Иначе
				ИмяЗапроса = "Количество первой категории";
			КонецЕсли;
		ИначеЕсли Область.C = 5 тогда
			Если ПроверитьСтолбец(Область) тогда
				ИмяЗапроса = ПолучитьСтолбец(Область);
			Иначе
				ИмяЗапроса = "Количество КМС";
			КонецЕсли;
		ИначеЕсли Область.C = 6 тогда
			Если ПроверитьСтолбец(Область) тогда
				ИмяЗапроса = ПолучитьСтолбец(Область);
			Иначе			
				ИмяЗапроса = "Количество других разрядов";
			КонецЕсли; 
		ИначеЕсли Область.C = 7 тогда
			Если ПроверитьСтолбец(Область) тогда
				ИмяЗапроса = ПолучитьСтолбец(Область);
			Иначе 
				ИмяЗапроса = "Всего званий";
			КонецЕсли;
		ИначеЕсли Область.C = 8 тогда
			Если ПроверитьСтолбец(Область) тогда
				ИмяЗапроса = ПолучитьСтолбец(Область);
			Иначе 
				ИмяЗапроса = "Количество МС";
			КонецЕсли;
		ИначеЕсли Область.C = 9 тогда
			Если ПроверитьСтолбец(Область) тогда
				ИмяЗапроса = ПолучитьСтолбец(Область);
			Иначе
				ИмяЗапроса = "Количество МСМК";
			КонецЕсли;
		ИначеЕсли Область.C = 10 тогда
			Если ПроверитьСтолбец(Область) тогда
				ИмяЗапроса = ПолучитьСтолбец(Область);
			Иначе
				ИмяЗапроса = "Количество ЗМС";
			КонецЕсли;
		ИначеЕсли Область.C = 11 тогда
			ИмяЗапроса = "Всего за период";
		ИначеЕсли Область.C = 12 тогда
			ИмяЗапроса = "Всего присвоено за период";
		ИначеЕсли Область.C = 13 тогда
			ИмяЗапроса = "Присвоено первого разряда за период";
		ИначеЕсли Область.C = 14 тогда
			ИмяЗапроса = "Присвоено КМС за период";
		ИначеЕсли Область.C = 15 тогда
			ИмяЗапроса = "Присвоено других разрядов за период";
		ИначеЕсли Область.C = 16 тогда
			ИмяЗапроса = "Разрядов подтверждено за период";
		ИначеЕсли Область.C = 17 тогда
			ИмяЗапроса = "Первого разряда подтверждено за период";
		ИначеЕсли Область.C = 18 тогда
			ИмяЗапроса = "КМС подтверждено за период";
		ИначеЕсли Область.C = 19 тогда
			ИмяЗапроса = "Подтверждено других разрядов за период";
		ИначеЕсли Область.C = 20 тогда
			ИмяЗапроса = "Всего званий за период";
		ИначеЕсли Область.C = 21 тогда
			ИмяЗапроса = "Званий ЗМС за период";
		ИначеЕсли Область.C = 22 тогда
			ИмяЗапроса = "Званий МСМК за период";
		ИначеЕсли Область.C = 23 тогда
			ИмяЗапроса = "Званий МС за период";
		КонецЕсли;
		
		Область.C = 1;
		Область.R = Колонка;
		ВидСпорта = ПолучитьДанныеПоля(Результат.Область(СтруктуруВОбласть(Область)).Расшифровка);
		
		ПолучитьРасшифрованныеДанные(ИмяЗапроса, ВидСпорта);
		НачалоПериода = Формат(Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала, "ДФ=dd.MM.yyyy");
		КонецПериода = Формат(Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания, "ДФ=dd.MM.yyyy");
		ПараметрыФормы = Новый Структура("СписокПараметр, ИмяТаблицы, Спорт, НачалоПериода, КонецПериода", Список, ИмяЗапроса, ВидСпорта, НачалоПериода, КонецПериода);
		ОткрытьФорму("Отчет.ДанныеПоСпортивнымРазрядамИЗваниям.Форма.ФормаРасшифровки", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ПроверитьРасшифровку(Область)
	Колонка = Область.C; 
	Область.C = 1;
	ТабПоле = Результат.Область(СтруктуруВОбласть(Область));
	Расшифровка = ТабПоле.Расшифровка;
	Область.C = Колонка;
	Если Расшифровка = Неопределено тогда
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция ПроверитьСтолбец(Область)
	Пока ПроверитьРасшифровку(Область) Цикл
		Область.R = Область.R-1; 
	КонецЦикла;
	
	ТабПоле = Результат.Область(СтруктуруВОбласть(Область));
	Поле = ТабПоле.Текст;
	
	Если Поле = "3 юн." тогда
		возврат Истина;
	ИначеЕсли Поле = "2 юн." тогда
		возврат Истина;
	ИначеЕсли Поле = "1 юн. " тогда
		возврат Истина;
	ИначеЕсли Поле = "III" тогда
		возврат Истина;
	ИначеЕсли Поле = "II" тогда
		возврат Истина;
	ИначеЕсли Поле = "I" тогда
		возврат Истина;
	ИначеЕсли Поле = "КМС" тогда
		возврат Истина;
	ИначеЕсли Поле = "МС" тогда
		возврат Истина;
	ИначеЕсли Поле = "ЗМС" тогда
		возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
		
КонецФункции

&НаКлиенте
Функция ПолучитьСтолбец(Область)
	Пока ПроверитьРасшифровку(Область) Цикл
		Область.R = Область.R-1; 
	КонецЦикла;
	
	ТабПоле = Результат.Область(СтруктуруВОбласть(Область));
	Возврат ТабПоле.Текст;		
КонецФункции
&НаСервере
Функция ПолучитьДанныеПоля(ИндентификаторРасшифровки)
	Если ИндентификаторРасшифровки = Неопределено тогда
		возврат Неопределено;
	Иначе
		Возврат ПолучитьИзВременногоХранилища(ДанныеРасшифровки).Элементы[ИндентификаторРасшифровки].ПолучитьПоля()[0].Значение;
	КонецЕсли;
КонецФункции

Процедура ПолучитьРасшифрованныеДанные(НазваниеЗапроса, ВидСпорта, Организация = неопределено)
	Запрос = новый Запрос();
	
	НачалоПериода = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала;
	КонецПериода = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания;
	// {Рарус dotere #23028 -Организация берется из параметров, во всех запросах имзмененно условия по оргранизации 2022.01.18
	Организация = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Значение;
	Если НазваниеЗапроса = "Всего спортсменов" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта КАК ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд КАК Разряд,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПодтверждения) КАК ДатаПодтверждения
		               |ПОМЕСТИТЬ ВТ_РазрядыАктуальные
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен В
		               |				(ВЫБРАТЬ
		               |					ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |				ИЗ
		               |					ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)) КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ДатаПрисвоения,
		               |	ДатаПодтверждения,
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВТ_РазрядыАктуальные.Спортсмен КАК Значение
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыАктуальные КАК ВТ_РазрядыАктуальные
		               |ГДЕ
		               |	ВТ_РазрядыАктуальные.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Значение КАК Значение
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания); 	
	ИначеЕсли НазваниеЗапроса = "Всего разрядов" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта КАК ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд КАК Разряд,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПодтверждения) КАК ДатаПодтверждения
		               |ПОМЕСТИТЬ ВТ_РазрядыАктуальные
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен В
		               |				(ВЫБРАТЬ
		               |					ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |				ИЗ
		               |					ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)) КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВЫБОР
		               |		КОГДА ВТ_РазрядыАктуальные.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.МастерСпортаРоссии)
		               |				И ВТ_РазрядыАктуальные.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.МастерСпортаРоссииМеждународногоКласса)
		               |				И ВТ_РазрядыАктуальные.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ЗаслуженныйМастерСпортаРоссии)
		               |				И ВТ_РазрядыАктуальные.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ГроссмейстерРоссии)
		               |			ТОГДА ВТ_РазрядыАктуальные.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыАктуальные КАК ВТ_РазрядыАктуальные
		               |ГДЕ
		               |	ВТ_РазрядыАктуальные.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Значение КАК Значение
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
	ИначеЕсли НазваниеЗапроса = "Количество КМС" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация) КАК Поле2}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта КАК ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд КАК Разряд,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПодтверждения) КАК ДатаПодтверждения
		               |ПОМЕСТИТЬ ВТ_РазрядыАктуальные
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен В
		               |				(ВЫБРАТЬ
		               |					ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |				ИЗ
		               |					ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)) КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних
		               |ГДЕ
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта = &ВидСпорта
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВЫБОР
		               |		КОГДА ВТ_РазрядыАктуальные.Разряд = ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.КандидатВМастераСпорта)
		               |			ТОГДА ВТ_РазрядыАктуальные.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыАктуальные КАК ВТ_РазрядыАктуальные
		               |ГДЕ
		               |	ВТ_РазрядыАктуальные.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Значение КАК Значение
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
	ИначеЕсли НазваниеЗапроса = "Количество первой категории" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта КАК ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_РазрядыАктуальные
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен В
		               |				(ВЫБРАТЬ
		               |					ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |				ИЗ
		               |					ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)) КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВЫБОР
		               |		КОГДА ВТ_РазрядыАктуальные.Разряд = ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.КандидатВМастераСпорта)
		               |			ТОГДА ВТ_РазрядыАктуальные.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыАктуальные КАК ВТ_РазрядыАктуальные
		               |ГДЕ
		               |	ВТ_РазрядыАктуальные.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Значение КАК Значение
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
	ИначеЕсли НазваниеЗапроса = "Количество других разрядов" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация) КАК Поле2}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта КАК ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_РазрядыАктуальные
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен В
		               |				(ВЫБРАТЬ
		               |					ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |				ИЗ
		               |					ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)) КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВЫБОР
		               |		КОГДА ВТ_РазрядыАктуальные.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПервыйСпортивныйРазряд)
		               |				И ВТ_РазрядыАктуальные.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.КандидатВМастераСпорта)
		               |				И ВТ_РазрядыАктуальные.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ЗаслуженныйМастерСпортаРоссии)
		               |				И ВТ_РазрядыАктуальные.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.МастерСпортаРоссииМеждународногоКласса)
		               |				И ВТ_РазрядыАктуальные.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.МастерСпортаРоссии)
		               |			ТОГДА ВТ_РазрядыАктуальные.Спортсмен
		               |	КОНЕЦ КАК Значение,
		               |	ВТ_РазрядыАктуальные.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыАктуальные КАК ВТ_РазрядыАктуальные
		               |ГДЕ
		               |	ВТ_РазрядыАктуальные.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВТ.Значение КАК Значение,
		               |	ВТ.Разряд КАК Разряд
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
	ИначеЕсли НазваниеЗапроса = "Всего званий" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта КАК ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_РазрядыАктуальные
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен В
		               |				(ВЫБРАТЬ
		               |					ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |				ИЗ
		               |					ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)) КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВЫБОР
		               |		КОГДА ВТ_РазрядыАктуальные.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПервыйСпортивныйРазряд)
		               |				И ВТ_РазрядыАктуальные.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПервыйЮношеский)
		               |				И ВТ_РазрядыАктуальные.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ВторойСпортивныйРазряд)
		               |				И ВТ_РазрядыАктуальные.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ВторойЮношеский)
		               |				И ВТ_РазрядыАктуальные.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ТретийСпортивныйРазряд)
		               |				И ВТ_РазрядыАктуальные.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ТретийЮношеский)
		               |				И ВТ_РазрядыАктуальные.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ЧетвертыйЮношеский)
		               |				И ВТ_РазрядыАктуальные.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.КандидатВМастераСпорта)
		               |			ТОГДА ВТ_РазрядыАктуальные.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыАктуальные КАК ВТ_РазрядыАктуальные
		               |ГДЕ
		               |	ВТ_РазрядыАктуальные.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Значение КАК Значение
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
	ИначеЕсли  НазваниеЗапроса = "Количество МС" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта КАК ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_РазрядыАктуальные
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен В
		               |				(ВЫБРАТЬ
		               |					ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |				ИЗ
		               |					ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)) КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВЫБОР
		               |		КОГДА ВТ_РазрядыАктуальные.Разряд = ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.МастерСпортаРоссии)
		               |			ТОГДА ВТ_РазрядыАктуальные.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыАктуальные КАК ВТ_РазрядыАктуальные
		               |ГДЕ
		               |	ВТ_РазрядыАктуальные.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Значение КАК Значение
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
	ИначеЕсли  НазваниеЗапроса = "Количество МСМК" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта КАК ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд КАК Разряд,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПодтверждения) КАК ДатаПодтверждения
		               |ПОМЕСТИТЬ ВТ_РазрядыАктуальные
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен В
		               |				(ВЫБРАТЬ
		               |					ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |				ИЗ
		               |					ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)) КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ДатаПрисвоения,
		               |	ДатаПодтверждения,
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВЫБОР
		               |		КОГДА ВТ_РазрядыАктуальные.Разряд = ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.МастерСпортаРоссииМеждународногоКласса)
		               |			ТОГДА ВТ_РазрядыАктуальные.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыАктуальные КАК ВТ_РазрядыАктуальные
		               |ГДЕ
		               |	ВТ_РазрядыАктуальные.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Значение КАК Значение
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
	ИначеЕсли  НазваниеЗапроса = "Количество ЗМС" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта КАК ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд КАК Разряд,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПодтверждения) КАК ДатаПодтверждения
		               |ПОМЕСТИТЬ ВТ_РазрядыАктуальные
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен В
		               |				(ВЫБРАТЬ
		               |					ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |				ИЗ
		               |					ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)) КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ДатаПрисвоения,
		               |	ДатаПодтверждения,
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВЫБОР
		               |		КОГДА ВТ_РазрядыАктуальные.Разряд = ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ЗаслуженныйМастерСпортаРоссии)
		               |			ТОГДА ВТ_РазрядыАктуальные.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыАктуальные КАК ВТ_РазрядыАктуальные
		               |ГДЕ
		               |	ВТ_РазрядыАктуальные.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Значение КАК Значение
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
	ИначеЕсли  НазваниеЗапроса = "Всего присвоено за период" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихсяЗаПериод
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |				И Организация = &Организация) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта КАК ВидСпорта,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд КАК Разряд,
		               |	ПодтвержденныеРазрядыСпортсменов.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_ПрисвоенныеРазряды
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов КАК ПодтвержденныеРазрядыСпортсменов
		               |ГДЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПустаяСсылка)
		               |	И ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И ПодтвержденныеРазрядыСпортсменов.Спортсмен В
		               |			(ВЫБРАТЬ
		               |				ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |			ИЗ
		               |				ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменов.Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд,
		               |	ПодтвержденныеРазрядыСпортсменов.Регистратор
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ПрисвоенныеРазряды.Организация КАК Организация,
		               |	ВТ_ПрисвоенныеРазряды.Спортсмен КАК Спортсмен,
		               |	ВТ_ПрисвоенныеРазряды.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ПрисвоенныеРазряды.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ВТ_ПрисвоенныеРазряды.Разряд КАК Разряд,
		               |	ВТ_ПрисвоенныеРазряды.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_ОбъединениеЗаПериод
		               |ИЗ
		               |	ВТ_ПрисвоенныеРазряды КАК ВТ_ПрисвоенныеРазряды
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ОбъединениеЗаПериод.Организация КАК Организация,
		               |	ВТ_ОбъединениеЗаПериод.Спортсмен КАК Спортсмен,
		               |	ВТ_ОбъединениеЗаПериод.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ОбъединениеЗаПериод.Разряд КАК Разряд,
		               |	ВТ_ОбъединениеЗаПериод.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_РазрядыЗаПериод
		               |ИЗ
		               |	ВТ_ОбъединениеЗаПериод КАК ВТ_ОбъединениеЗаПериод
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	ВЫБОР
		               |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_РазрядыЗаПериод.Регистратор) = ТИП(Документ.ПрисвоениеРазряда)
		               |			ТОГДА ВТ_РазрядыЗаПериод.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыЗаПериод КАК ВТ_РазрядыЗаПериод
		               |ГДЕ
		               |	ВТ_РазрядыЗаПериод.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Значение КАК Значение
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
		Запрос.УстановитьПараметр("НачалоПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала);
	ИначеЕсли  НазваниеЗапроса = "Присвоено первого разряда за период" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихсяЗаПериод
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |				И Организация = &Организация) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта КАК ВидСпорта,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд КАК Разряд,
		               |	ПодтвержденныеРазрядыСпортсменов.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_ПрисвоенныеРазряды
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов КАК ПодтвержденныеРазрядыСпортсменов
		               |ГДЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПустаяСсылка)
		               |	И ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И ПодтвержденныеРазрядыСпортсменов.Спортсмен В
		               |			(ВЫБРАТЬ
		               |				ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |			ИЗ
		               |				ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменов.Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд,
		               |	ПодтвержденныеРазрядыСпортсменов.Регистратор
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ПрисвоенныеРазряды.Организация КАК Организация,
		               |	ВТ_ПрисвоенныеРазряды.Спортсмен КАК Спортсмен,
		               |	ВТ_ПрисвоенныеРазряды.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ПрисвоенныеРазряды.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ВТ_ПрисвоенныеРазряды.Разряд КАК Разряд,
		               |	ВТ_ПрисвоенныеРазряды.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_ОбъединениеЗаПериод
		               |ИЗ
		               |	ВТ_ПрисвоенныеРазряды КАК ВТ_ПрисвоенныеРазряды
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ОбъединениеЗаПериод.Организация КАК Организация,
		               |	ВТ_ОбъединениеЗаПериод.Спортсмен КАК Спортсмен,
		               |	ВТ_ОбъединениеЗаПериод.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ОбъединениеЗаПериод.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ВТ_ОбъединениеЗаПериод.Разряд КАК Разряд,
		               |	ВТ_ОбъединениеЗаПериод.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_РазрядыЗаПериод
		               |ИЗ
		               |	ВТ_ОбъединениеЗаПериод КАК ВТ_ОбъединениеЗаПериод
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	ВЫБОР
		               |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_РазрядыЗаПериод.Регистратор) = ТИП(Документ.ПрисвоениеРазряда)
		               |				И ВТ_РазрядыЗаПериод.Разряд = ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПервыйСпортивныйРазряд)
		               |			ТОГДА ВТ_РазрядыЗаПериод.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыЗаПериод КАК ВТ_РазрядыЗаПериод
		               |ГДЕ
		               |	ВТ_РазрядыЗаПериод.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Значение КАК Значение
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
		Запрос.УстановитьПараметр("НачалоПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала);
	ИначеЕсли  НазваниеЗапроса = "Присвоено КМС за период" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихсяЗаПериод
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |				И Организация = &Организация) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта КАК ВидСпорта,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд КАК Разряд,
		               |	ПодтвержденныеРазрядыСпортсменов.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_ПрисвоенныеРазряды
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов КАК ПодтвержденныеРазрядыСпортсменов
		               |ГДЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПустаяСсылка)
		               |	И ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И ПодтвержденныеРазрядыСпортсменов.Спортсмен В
		               |			(ВЫБРАТЬ
		               |				ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |			ИЗ
		               |				ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменов.Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд,
		               |	ПодтвержденныеРазрядыСпортсменов.Регистратор
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ПрисвоенныеРазряды.Организация КАК Организация,
		               |	ВТ_ПрисвоенныеРазряды.Спортсмен КАК Спортсмен,
		               |	ВТ_ПрисвоенныеРазряды.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ПрисвоенныеРазряды.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ВТ_ПрисвоенныеРазряды.Разряд КАК Разряд,
		               |	ВТ_ПрисвоенныеРазряды.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_ОбъединениеЗаПериод
		               |ИЗ
		               |	ВТ_ПрисвоенныеРазряды КАК ВТ_ПрисвоенныеРазряды
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ОбъединениеЗаПериод.Организация КАК Организация,
		               |	ВТ_ОбъединениеЗаПериод.Спортсмен КАК Спортсмен,
		               |	ВТ_ОбъединениеЗаПериод.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ОбъединениеЗаПериод.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ВТ_ОбъединениеЗаПериод.Разряд КАК Разряд,
		               |	ВТ_ОбъединениеЗаПериод.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_РазрядыЗаПериод
		               |ИЗ
		               |	ВТ_ОбъединениеЗаПериод КАК ВТ_ОбъединениеЗаПериод
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	ВЫБОР
		               |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_РазрядыЗаПериод.Регистратор) = ТИП(Документ.ПрисвоениеРазряда)
		               |				И ВТ_РазрядыЗаПериод.Разряд = ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.КандидатВМастераСпорта)
		               |			ТОГДА ВТ_РазрядыЗаПериод.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыЗаПериод КАК ВТ_РазрядыЗаПериод
		               |ГДЕ
		               |	ВТ_РазрядыЗаПериод.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Значение КАК Значение
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
		Запрос.УстановитьПараметр("НачалоПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала);
	ИначеЕсли  НазваниеЗапроса = "Всего за период" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихсяЗаПериод
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |				И Организация = &Организация) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта КАК ВидСпорта,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_ПрисвоенныеРазряды
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов КАК ПодтвержденныеРазрядыСпортсменов
		               |ГДЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПустаяСсылка)
		               |	И ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И ПодтвержденныеРазрядыСпортсменов.Спортсмен В
		               |			(ВЫБРАТЬ
		               |				ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |			ИЗ
		               |				ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменов.Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ПрисвоенныеРазряды.Организация КАК Организация,
		               |	ВТ_ПрисвоенныеРазряды.Спортсмен КАК Спортсмен,
		               |	ВТ_ПрисвоенныеРазряды.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ПрисвоенныеРазряды.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ВТ_ПрисвоенныеРазряды.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_ОбъединениеЗаПериод
		               |ИЗ
		               |	ВТ_ПрисвоенныеРазряды КАК ВТ_ПрисвоенныеРазряды
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ОбъединениеЗаПериод.Организация КАК Организация,
		               |	ВТ_ОбъединениеЗаПериод.Спортсмен КАК Спортсмен,
		               |	ВТ_ОбъединениеЗаПериод.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ОбъединениеЗаПериод.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ВТ_ОбъединениеЗаПериод.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_РазрядыЗаПериод
		               |ИЗ
		               |	ВТ_ОбъединениеЗаПериод КАК ВТ_ОбъединениеЗаПериод
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	ВТ_РазрядыЗаПериод.Спортсмен КАК Значение
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыЗаПериод КАК ВТ_РазрядыЗаПериод
		               |ГДЕ
		               |	ВТ_РазрядыЗаПериод.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Значение КАК Значение
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
		Запрос.УстановитьПараметр("НачалоПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала);
	ИначеЕсли  НазваниеЗапроса = "Присвоено других разрядов за период" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихсяЗаПериод
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |				И Организация = &Организация) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта КАК ВидСпорта,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд КАК Разряд,
		               |	ПодтвержденныеРазрядыСпортсменов.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_ПрисвоенныеРазряды
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов КАК ПодтвержденныеРазрядыСпортсменов
		               |ГДЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПустаяСсылка)
		               |	И ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И ПодтвержденныеРазрядыСпортсменов.Спортсмен В
		               |			(ВЫБРАТЬ
		               |				ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |			ИЗ
		               |				ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменов.Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд,
		               |	ПодтвержденныеРазрядыСпортсменов.Регистратор
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ПрисвоенныеРазряды.Организация КАК Организация,
		               |	ВТ_ПрисвоенныеРазряды.Спортсмен КАК Спортсмен,
		               |	ВТ_ПрисвоенныеРазряды.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ПрисвоенныеРазряды.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ВТ_ПрисвоенныеРазряды.Разряд КАК Разряд,
		               |	ВТ_ПрисвоенныеРазряды.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_ОбъединениеЗаПериод
		               |ИЗ
		               |	ВТ_ПрисвоенныеРазряды КАК ВТ_ПрисвоенныеРазряды
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ОбъединениеЗаПериод.Организация КАК Организация,
		               |	ВТ_ОбъединениеЗаПериод.Спортсмен КАК Спортсмен,
		               |	ВТ_ОбъединениеЗаПериод.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ОбъединениеЗаПериод.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ВТ_ОбъединениеЗаПериод.Разряд КАК Разряд,
		               |	ВТ_ОбъединениеЗаПериод.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_РазрядыЗаПериод
		               |ИЗ
		               |	ВТ_ОбъединениеЗаПериод КАК ВТ_ОбъединениеЗаПериод
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	ВЫБОР
		               |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_РазрядыЗаПериод.Регистратор) = ТИП(Документ.ПрисвоениеРазряда)
		               |				И ВТ_РазрядыЗаПериод.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПервыйСпортивныйРазряд)
		               |				И ВТ_РазрядыЗаПериод.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.КандидатВМастераСпорта)
		               |				И ВТ_РазрядыЗаПериод.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ЗаслуженныйМастерСпортаРоссии)
		               |				И ВТ_РазрядыЗаПериод.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.МастерСпортаРоссииМеждународногоКласса)
		               |				И ВТ_РазрядыЗаПериод.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.МастерСпортаРоссии)
		               |			ТОГДА ВТ_РазрядыЗаПериод.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыЗаПериод КАК ВТ_РазрядыЗаПериод
		               |ГДЕ
		               |	ВТ_РазрядыЗаПериод.ВидСпорта = &ВидСпорта
		               |	И НЕ ВТ_РазрядыЗаПериод.Спортсмен ЕСТЬ NULL
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Значение КАК Значение
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
		Запрос.УстановитьПараметр("НачалоПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала);
	ИначеЕсли  НазваниеЗапроса = "Разрядов подтверждено за период" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация) КАК Поле2}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихсяЗаПериод
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |				И Организация = &Организация) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта КАК ВидСпорта,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд КАК Разряд,
		               |	ПодтвержденныеРазрядыСпортсменов.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_ПрисвоенныеРазряды
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов КАК ПодтвержденныеРазрядыСпортсменов
		               |ГДЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПустаяСсылка)
		               |	И ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И ПодтвержденныеРазрядыСпортсменов.Спортсмен В
		               |			(ВЫБРАТЬ
		               |				ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |			ИЗ
		               |				ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменов.Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд,
		               |	ПодтвержденныеРазрядыСпортсменов.Регистратор
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ПрисвоенныеРазряды.Организация КАК Организация,
		               |	ВТ_ПрисвоенныеРазряды.Спортсмен КАК Спортсмен,
		               |	ВТ_ПрисвоенныеРазряды.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ПрисвоенныеРазряды.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ВТ_ПрисвоенныеРазряды.Разряд КАК Разряд,
		               |	ВТ_ПрисвоенныеРазряды.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_ОбъединениеЗаПериод
		               |ИЗ
		               |	ВТ_ПрисвоенныеРазряды КАК ВТ_ПрисвоенныеРазряды
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ОбъединениеЗаПериод.Организация КАК Организация,
		               |	ВТ_ОбъединениеЗаПериод.Спортсмен КАК Спортсмен,
		               |	ВТ_ОбъединениеЗаПериод.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ОбъединениеЗаПериод.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ВТ_ОбъединениеЗаПериод.Разряд КАК Разряд,
		               |	ВТ_ОбъединениеЗаПериод.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_РазрядыЗаПериод
		               |ИЗ
		               |	ВТ_ОбъединениеЗаПериод КАК ВТ_ОбъединениеЗаПериод
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	ВЫБОР
		               |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_РазрядыЗаПериод.Регистратор) = ТИП(Документ.ПодтверждениеРазрядаСпортсмена)
		               |			ТОГДА ВТ_РазрядыЗаПериод.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыЗаПериод КАК ВТ_РазрядыЗаПериод
		               |ГДЕ
		               |	ВТ_РазрядыЗаПериод.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Значение КАК Значение
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
		Запрос.УстановитьПараметр("НачалоПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала);
	ИначеЕсли  НазваниеЗапроса = "Первого разряда подтверждено за период" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихсяЗаПериод
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |				И Организация = &Организация) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта КАК ВидСпорта,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд КАК Разряд,
		               |	ПодтвержденныеРазрядыСпортсменов.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_ПрисвоенныеРазряды
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов КАК ПодтвержденныеРазрядыСпортсменов
		               |ГДЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПустаяСсылка)
		               |	И ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И ПодтвержденныеРазрядыСпортсменов.Спортсмен В
		               |			(ВЫБРАТЬ
		               |				ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |			ИЗ
		               |				ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменов.Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд,
		               |	ПодтвержденныеРазрядыСпортсменов.Регистратор
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ПрисвоенныеРазряды.Организация КАК Организация,
		               |	ВТ_ПрисвоенныеРазряды.Спортсмен КАК Спортсмен,
		               |	ВТ_ПрисвоенныеРазряды.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ПрисвоенныеРазряды.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ВТ_ПрисвоенныеРазряды.Разряд КАК Разряд,
		               |	ВТ_ПрисвоенныеРазряды.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_ОбъединениеЗаПериод
		               |ИЗ
		               |	ВТ_ПрисвоенныеРазряды КАК ВТ_ПрисвоенныеРазряды
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ОбъединениеЗаПериод.Организация КАК Организация,
		               |	ВТ_ОбъединениеЗаПериод.Спортсмен КАК Спортсмен,
		               |	ВТ_ОбъединениеЗаПериод.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ОбъединениеЗаПериод.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ВТ_ОбъединениеЗаПериод.Разряд КАК Разряд,
		               |	ВТ_ОбъединениеЗаПериод.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_РазрядыЗаПериод
		               |ИЗ
		               |	ВТ_ОбъединениеЗаПериод КАК ВТ_ОбъединениеЗаПериод
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	ВЫБОР
		               |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_РазрядыЗаПериод.Регистратор) = ТИП(Документ.ПодтверждениеРазрядаСпортсмена)
		               |				И ВТ_РазрядыЗаПериод.Разряд = ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПервыйСпортивныйРазряд)
		               |			ТОГДА ВТ_РазрядыЗаПериод.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыЗаПериод КАК ВТ_РазрядыЗаПериод
		               |ГДЕ
		               |	ВТ_РазрядыЗаПериод.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Значение КАК Значение
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
		Запрос.УстановитьПараметр("НачалоПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала);
	ИначеЕсли НазваниеЗапроса = "КМС подтверждено за период" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихсяЗаПериод
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |				И Организация = &Организация) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта КАК ВидСпорта,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд КАК Разряд,
		               |	ПодтвержденныеРазрядыСпортсменов.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_ПрисвоенныеРазряды
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов КАК ПодтвержденныеРазрядыСпортсменов
		               |ГДЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПустаяСсылка)
		               |	И ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И ПодтвержденныеРазрядыСпортсменов.Спортсмен В
		               |			(ВЫБРАТЬ
		               |				ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |			ИЗ
		               |				ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменов.Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд,
		               |	ПодтвержденныеРазрядыСпортсменов.Регистратор
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ПрисвоенныеРазряды.Организация КАК Организация,
		               |	ВТ_ПрисвоенныеРазряды.Спортсмен КАК Спортсмен,
		               |	ВТ_ПрисвоенныеРазряды.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ПрисвоенныеРазряды.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ВТ_ПрисвоенныеРазряды.Разряд КАК Разряд,
		               |	ВТ_ПрисвоенныеРазряды.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_ОбъединениеЗаПериод
		               |ИЗ
		               |	ВТ_ПрисвоенныеРазряды КАК ВТ_ПрисвоенныеРазряды
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ОбъединениеЗаПериод.Организация КАК Организация,
		               |	ВТ_ОбъединениеЗаПериод.Спортсмен КАК Спортсмен,
		               |	ВТ_ОбъединениеЗаПериод.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ОбъединениеЗаПериод.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ВТ_ОбъединениеЗаПериод.Разряд КАК Разряд,
		               |	ВТ_ОбъединениеЗаПериод.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_РазрядыЗаПериод
		               |ИЗ
		               |	ВТ_ОбъединениеЗаПериод КАК ВТ_ОбъединениеЗаПериод
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	ВЫБОР
		               |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_РазрядыЗаПериод.Регистратор) = ТИП(Документ.ПодтверждениеРазрядаСпортсмена)
		               |				И ВТ_РазрядыЗаПериод.Разряд = ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.КандидатВМастераСпорта)
		               |			ТОГДА ВТ_РазрядыЗаПериод.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыЗаПериод КАК ВТ_РазрядыЗаПериод
		               |ГДЕ
		               |	ВТ_РазрядыЗаПериод.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Значение КАК Значение
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
		Запрос.УстановитьПараметр("НачалоПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала);
	ИначеЕсли НазваниеЗапроса = "Подтверждено других разрядов за период" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихсяЗаПериод
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |				И Организация = &Организация) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта КАК ВидСпорта,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд КАК Разряд,
		               |	ПодтвержденныеРазрядыСпортсменов.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_ПрисвоенныеРазряды
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов КАК ПодтвержденныеРазрядыСпортсменов
		               |ГДЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПустаяСсылка)
		               |	И ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И ПодтвержденныеРазрядыСпортсменов.Спортсмен В
		               |			(ВЫБРАТЬ
		               |				ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |			ИЗ
		               |				ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменов.Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд,
		               |	ПодтвержденныеРазрядыСпортсменов.Регистратор
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ПрисвоенныеРазряды.Организация КАК Организация,
		               |	ВТ_ПрисвоенныеРазряды.Спортсмен КАК Спортсмен,
		               |	ВТ_ПрисвоенныеРазряды.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ПрисвоенныеРазряды.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ВТ_ПрисвоенныеРазряды.Разряд КАК Разряд,
		               |	ВТ_ПрисвоенныеРазряды.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_ОбъединениеЗаПериод
		               |ИЗ
		               |	ВТ_ПрисвоенныеРазряды КАК ВТ_ПрисвоенныеРазряды
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ОбъединениеЗаПериод.Организация КАК Организация,
		               |	ВТ_ОбъединениеЗаПериод.Спортсмен КАК Спортсмен,
		               |	ВТ_ОбъединениеЗаПериод.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ОбъединениеЗаПериод.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ВТ_ОбъединениеЗаПериод.Разряд КАК Разряд,
		               |	ВТ_ОбъединениеЗаПериод.Регистратор КАК Регистратор
		               |ПОМЕСТИТЬ ВТ_РазрядыЗаПериод
		               |ИЗ
		               |	ВТ_ОбъединениеЗаПериод КАК ВТ_ОбъединениеЗаПериод
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	ВЫБОР
		               |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_РазрядыЗаПериод.Регистратор) = ТИП(Документ.ПодтверждениеРазрядаСпортсмена)
		               |				И ВТ_РазрядыЗаПериод.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПервыйСпортивныйРазряд)
		               |				И ВТ_РазрядыЗаПериод.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.КандидатВМастераСпорта)
		               |				И ВТ_РазрядыЗаПериод.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ЗаслуженныйМастерСпортаРоссии)
		               |				И ВТ_РазрядыЗаПериод.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.МастерСпортаРоссииМеждународногоКласса)
		               |				И ВТ_РазрядыЗаПериод.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.МастерСпортаРоссии)
		               |			ТОГДА ВТ_РазрядыЗаПериод.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыЗаПериод КАК ВТ_РазрядыЗаПериод
		               |ГДЕ
		               |	ВТ_РазрядыЗаПериод.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Значение КАК Значение
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
		Запрос.УстановитьПараметр("НачалоПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала);
	ИначеЕсли НазваниеЗапроса = "Всего званий за период" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихсяЗаПериод
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |				И Организация = &Организация) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта КАК ВидСпорта,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_ПрисвоенныеРазряды
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов КАК ПодтвержденныеРазрядыСпортсменов
		               |ГДЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПустаяСсылка)
		               |	И ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И ПодтвержденныеРазрядыСпортсменов.Спортсмен В
		               |			(ВЫБРАТЬ
		               |				ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |			ИЗ
		               |				ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменов.Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПодтвержденныеРазрядыСпортсменов.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта КАК ВидСпорта,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменов.ДатаПодтверждения) КАК ДатаПодтверждения,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_ПодтвержденныеРазряды
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов КАК ПодтвержденныеРазрядыСпортсменов
		               |ГДЕ
		               |	ПодтвержденныеРазрядыСпортсменов.ДатаПодтверждения МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И ПодтвержденныеРазрядыСпортсменов.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПустаяСсылка)
		               |	И ПодтвержденныеРазрядыСпортсменов.Спортсмен В
		               |			(ВЫБРАТЬ
		               |				ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |			ИЗ
		               |				ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменов.Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ПрисвоенныеРазряды.Организация КАК Организация,
		               |	ВТ_ПрисвоенныеРазряды.Спортсмен КАК Спортсмен,
		               |	ВТ_ПрисвоенныеРазряды.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ПрисвоенныеРазряды.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПодтверждения,
		               |	ВТ_ПрисвоенныеРазряды.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_ОбъединениеЗаПериод
		               |ИЗ
		               |	ВТ_ПрисвоенныеРазряды КАК ВТ_ПрисвоенныеРазряды
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВТ_ПодтвержденныеРазряды.Организация,
		               |	ВТ_ПодтвержденныеРазряды.Спортсмен,
		               |	ВТ_ПодтвержденныеРазряды.ВидСпорта,
		               |	ДАТАВРЕМЯ(1, 1, 1),
		               |	ВТ_ПодтвержденныеРазряды.ДатаПодтверждения,
		               |	ВТ_ПодтвержденныеРазряды.Разряд
		               |ИЗ
		               |	ВТ_ПодтвержденныеРазряды КАК ВТ_ПодтвержденныеРазряды
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ОбъединениеЗаПериод.Организация КАК Организация,
		               |	ВТ_ОбъединениеЗаПериод.Спортсмен КАК Спортсмен,
		               |	ВТ_ОбъединениеЗаПериод.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ОбъединениеЗаПериод.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ВТ_ОбъединениеЗаПериод.ДатаПодтверждения КАК ДатаПодтверждения,
		               |	ВТ_ОбъединениеЗаПериод.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_РазрядыЗаПериод
		               |ИЗ
		               |	ВТ_ОбъединениеЗаПериод КАК ВТ_ОбъединениеЗаПериод
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	ВЫБОР
		               |		КОГДА ВТ_РазрядыЗаПериод.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПервыйСпортивныйРазряд)
		               |				И ВТ_РазрядыЗаПериод.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПервыйЮношеский)
		               |				И ВТ_РазрядыЗаПериод.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ВторойСпортивныйРазряд)
		               |				И ВТ_РазрядыЗаПериод.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ВторойЮношеский)
		               |				И ВТ_РазрядыЗаПериод.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ТретийСпортивныйРазряд)
		               |				И ВТ_РазрядыЗаПериод.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ТретийЮношеский)
		               |				И ВТ_РазрядыЗаПериод.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ЧетвертыйЮношеский)
		               |				И ВТ_РазрядыЗаПериод.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.КандидатВМастераСпорта)
		               |			ТОГДА ВТ_РазрядыЗаПериод.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыЗаПериод КАК ВТ_РазрядыЗаПериод
		               |ГДЕ
		               |	ВТ_РазрядыЗаПериод.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Значение КАК Значение
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
		Запрос.УстановитьПараметр("НачалоПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала);
	ИначеЕсли НазваниеЗапроса = "Званий МС за период" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация) КАК Поле2}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихсяЗаПериод
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |				И Организация = &Организация) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта КАК ВидСпорта,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_ПрисвоенныеРазряды
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов КАК ПодтвержденныеРазрядыСпортсменов
		               |ГДЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПустаяСсылка)
		               |	И ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И ПодтвержденныеРазрядыСпортсменов.Спортсмен В
		               |			(ВЫБРАТЬ
		               |				ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |			ИЗ
		               |				ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменов.Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПодтвержденныеРазрядыСпортсменов.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта КАК ВидСпорта,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменов.ДатаПодтверждения) КАК ДатаПодтверждения,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_ПодтвержденныеРазряды
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов КАК ПодтвержденныеРазрядыСпортсменов
		               |ГДЕ
		               |	ПодтвержденныеРазрядыСпортсменов.ДатаПодтверждения МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И ПодтвержденныеРазрядыСпортсменов.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПустаяСсылка)
		               |	И ПодтвержденныеРазрядыСпортсменов.Спортсмен В
		               |			(ВЫБРАТЬ
		               |				ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |			ИЗ
		               |				ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменов.Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ПрисвоенныеРазряды.Организация КАК Организация,
		               |	ВТ_ПрисвоенныеРазряды.Спортсмен КАК Спортсмен,
		               |	ВТ_ПрисвоенныеРазряды.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ПрисвоенныеРазряды.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПодтверждения,
		               |	ВТ_ПрисвоенныеРазряды.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_ОбъединениеЗаПериод
		               |ИЗ
		               |	ВТ_ПрисвоенныеРазряды КАК ВТ_ПрисвоенныеРазряды
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВТ_ПодтвержденныеРазряды.Организация,
		               |	ВТ_ПодтвержденныеРазряды.Спортсмен,
		               |	ВТ_ПодтвержденныеРазряды.ВидСпорта,
		               |	ДАТАВРЕМЯ(1, 1, 1),
		               |	ВТ_ПодтвержденныеРазряды.ДатаПодтверждения,
		               |	ВТ_ПодтвержденныеРазряды.Разряд
		               |ИЗ
		               |	ВТ_ПодтвержденныеРазряды КАК ВТ_ПодтвержденныеРазряды
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ОбъединениеЗаПериод.Организация КАК Организация,
		               |	ВТ_ОбъединениеЗаПериод.Спортсмен КАК Спортсмен,
		               |	ВТ_ОбъединениеЗаПериод.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ОбъединениеЗаПериод.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ВТ_ОбъединениеЗаПериод.ДатаПодтверждения КАК ДатаПодтверждения,
		               |	ВТ_ОбъединениеЗаПериод.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_РазрядыЗаПериод
		               |ИЗ
		               |	ВТ_ОбъединениеЗаПериод КАК ВТ_ОбъединениеЗаПериод
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	ВЫБОР
		               |		КОГДА ВТ_РазрядыЗаПериод.Разряд = ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.МастерСпортаРоссии)
		               |			ТОГДА ВТ_РазрядыЗаПериод.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыЗаПериод КАК ВТ_РазрядыЗаПериод
		               |ГДЕ
		               |	ВТ_РазрядыЗаПериод.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Значение КАК Значение
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
		Запрос.УстановитьПараметр("НачалоПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала);
	ИначеЕсли НазваниеЗапроса = "Званий ЗМС за период" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихсяЗаПериод
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |				И Организация = &Организация) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта КАК ВидСпорта,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_ПрисвоенныеРазряды
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов КАК ПодтвержденныеРазрядыСпортсменов
		               |ГДЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПустаяСсылка)
		               |	И ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И ПодтвержденныеРазрядыСпортсменов.Спортсмен В
		               |			(ВЫБРАТЬ
		               |				ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |			ИЗ
		               |				ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменов.Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПодтвержденныеРазрядыСпортсменов.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта КАК ВидСпорта,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменов.ДатаПодтверждения) КАК ДатаПодтверждения,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_ПодтвержденныеРазряды
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов КАК ПодтвержденныеРазрядыСпортсменов
		               |ГДЕ
		               |	ПодтвержденныеРазрядыСпортсменов.ДатаПодтверждения МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И ПодтвержденныеРазрядыСпортсменов.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПустаяСсылка)
		               |	И ПодтвержденныеРазрядыСпортсменов.Спортсмен В
		               |			(ВЫБРАТЬ
		               |				ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |			ИЗ
		               |				ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменов.Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ПрисвоенныеРазряды.Организация КАК Организация,
		               |	ВТ_ПрисвоенныеРазряды.Спортсмен КАК Спортсмен,
		               |	ВТ_ПрисвоенныеРазряды.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ПрисвоенныеРазряды.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПодтверждения,
		               |	ВТ_ПрисвоенныеРазряды.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_ОбъединениеЗаПериод
		               |ИЗ
		               |	ВТ_ПрисвоенныеРазряды КАК ВТ_ПрисвоенныеРазряды
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВТ_ПодтвержденныеРазряды.Организация,
		               |	ВТ_ПодтвержденныеРазряды.Спортсмен,
		               |	ВТ_ПодтвержденныеРазряды.ВидСпорта,
		               |	ДАТАВРЕМЯ(1, 1, 1),
		               |	ВТ_ПодтвержденныеРазряды.ДатаПодтверждения,
		               |	ВТ_ПодтвержденныеРазряды.Разряд
		               |ИЗ
		               |	ВТ_ПодтвержденныеРазряды КАК ВТ_ПодтвержденныеРазряды
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ОбъединениеЗаПериод.Организация КАК Организация,
		               |	ВТ_ОбъединениеЗаПериод.Спортсмен КАК Спортсмен,
		               |	ВТ_ОбъединениеЗаПериод.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ОбъединениеЗаПериод.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ВТ_ОбъединениеЗаПериод.ДатаПодтверждения КАК ДатаПодтверждения,
		               |	ВТ_ОбъединениеЗаПериод.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_РазрядыЗаПериод
		               |ИЗ
		               |	ВТ_ОбъединениеЗаПериод КАК ВТ_ОбъединениеЗаПериод
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	ВЫБОР
		               |		КОГДА ВТ_РазрядыЗаПериод.Разряд = ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ЗаслуженныйМастерСпортаРоссии)
		               |			ТОГДА ВТ_РазрядыЗаПериод.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыЗаПериод КАК ВТ_РазрядыЗаПериод
		               |ГДЕ
		               |	ВТ_РазрядыЗаПериод.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Значение КАК Значение
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
		Запрос.УстановитьПараметр("НачалоПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала);
	ИначеЕсли НазваниеЗапроса = "Званий МСМК за период" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихсяЗаПериод
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(
		               |			&КонецПериода,
		               |			Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |				И Организация = &Организация) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта КАК ВидСпорта,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_ПрисвоенныеРазряды
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов КАК ПодтвержденныеРазрядыСпортсменов
		               |ГДЕ
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПустаяСсылка)
		               |	И ПодтвержденныеРазрядыСпортсменов.ДатаПрисвоения МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И ПодтвержденныеРазрядыСпортсменов.Спортсмен В
		               |			(ВЫБРАТЬ
		               |				ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |			ИЗ
		               |				ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменов.Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПодтвержденныеРазрядыСпортсменов.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта КАК ВидСпорта,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменов.ДатаПодтверждения) КАК ДатаПодтверждения,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_ПодтвержденныеРазряды
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов КАК ПодтвержденныеРазрядыСпортсменов
		               |ГДЕ
		               |	ПодтвержденныеРазрядыСпортсменов.ДатаПодтверждения МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И ПодтвержденныеРазрядыСпортсменов.Разряд <> ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПустаяСсылка)
		               |	И ПодтвержденныеРазрядыСпортсменов.Спортсмен В
		               |			(ВЫБРАТЬ
		               |				ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |			ИЗ
		               |				ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменов.Организация,
		               |	ПодтвержденныеРазрядыСпортсменов.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменов.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменов.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ПрисвоенныеРазряды.Организация КАК Организация,
		               |	ВТ_ПрисвоенныеРазряды.Спортсмен КАК Спортсмен,
		               |	ВТ_ПрисвоенныеРазряды.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ПрисвоенныеРазряды.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПодтверждения,
		               |	ВТ_ПрисвоенныеРазряды.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_ОбъединениеЗаПериод
		               |ИЗ
		               |	ВТ_ПрисвоенныеРазряды КАК ВТ_ПрисвоенныеРазряды
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ВТ_ПодтвержденныеРазряды.Организация,
		               |	ВТ_ПодтвержденныеРазряды.Спортсмен,
		               |	ВТ_ПодтвержденныеРазряды.ВидСпорта,
		               |	ДАТАВРЕМЯ(1, 1, 1),
		               |	ВТ_ПодтвержденныеРазряды.ДатаПодтверждения,
		               |	ВТ_ПодтвержденныеРазряды.Разряд
		               |ИЗ
		               |	ВТ_ПодтвержденныеРазряды КАК ВТ_ПодтвержденныеРазряды
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_ОбъединениеЗаПериод.Организация КАК Организация,
		               |	ВТ_ОбъединениеЗаПериод.Спортсмен КАК Спортсмен,
		               |	ВТ_ОбъединениеЗаПериод.ВидСпорта КАК ВидСпорта,
		               |	ВТ_ОбъединениеЗаПериод.ДатаПрисвоения КАК ДатаПрисвоения,
		               |	ВТ_ОбъединениеЗаПериод.ДатаПодтверждения КАК ДатаПодтверждения,
		               |	ВТ_ОбъединениеЗаПериод.Разряд КАК Разряд
		               |ПОМЕСТИТЬ ВТ_РазрядыЗаПериод
		               |ИЗ
		               |	ВТ_ОбъединениеЗаПериод КАК ВТ_ОбъединениеЗаПериод
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	ВЫБОР
		               |		КОГДА ВТ_РазрядыЗаПериод.Разряд = ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.МастерСпортаРоссииМеждународногоКласса)
		               |			ТОГДА ВТ_РазрядыЗаПериод.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	ВТ_РазрядыЗаПериод КАК ВТ_РазрядыЗаПериод
		               |ГДЕ
		               |	ВТ_РазрядыЗаПериод.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Значение КАК Значение
		               |ИЗ
		               |	ВТ КАК ВТ
		               |ГДЕ
		               |	НЕ ВТ.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
		Запрос.УстановитьПараметр("НачалоПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала);
	ИначеЕсли НазваниеЗапроса = "Общая численность тренеров" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Тренеры.Ссылка КАК Значение
		               |ИЗ
		               |	РегистрСведений.СоответствияФизическихЛицИОрганизаций КАК СоответствияФизическихЛицИОрганизаций
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Тренеры КАК Тренеры
		               |		ПО СоответствияФизическихЛицИОрганизаций.ФизическоеЛицо = Тренеры.ФизическоеЛицо
		               |ГДЕ
		               |	Тренеры.СтатусТренера <> ЗНАЧЕНИЕ(Перечисление.СтатусыТренеров.ТренерДругогоСпортивногоУчреждения)
		               |	И СоответствияФизическихЛицИОрганизаций.Организация = &Организация
		               |{ГДЕ
		               |	(СоответствияФизическихЛицИОрганизаций.Организация = &Организация) КАК Поле2}";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
	ИначеЕсли НазваниеЗапроса = "Число спортивных судей" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	Тренеры.Ссылка КАК Тренер
		               |ПОМЕСТИТЬ Тренеры
		               |ИЗ
		               |	РегистрСведений.СоответствияФизическихЛицИОрганизаций КАК СоответствияФизическихЛицИОрганизаций
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Тренеры КАК Тренеры
		               |		ПО СоответствияФизическихЛицИОрганизаций.ФизическоеЛицо = Тренеры.ФизическоеЛицо
		               |ГДЕ
		               |	Тренеры.СтатусТренера <> ЗНАЧЕНИЕ(Перечисление.СтатусыТренеров.ТренерДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоответствияФизическихЛицИОрганизаций.Организация = &Организация) КАК Поле1}
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	КатегорииСпортивныхСудейСрезПоследних.Тренер КАК Значение
		               |ИЗ
		               |	РегистрСведений.КатегорииСпортивныхСудей.СрезПоследних КАК КатегорииСпортивныхСудейСрезПоследних
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Тренеры КАК Тренеры
		               |		ПО КатегорииСпортивныхСудейСрезПоследних.Тренер.Ссылка = Тренеры.Тренер.Ссылка";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
	ИначеЕсли НазваниеЗапроса = "Присвоено тренерских званий" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	Тренеры.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ Тренеры
		               |ИЗ
		               |	РегистрСведений.СоответствияФизическихЛицИОрганизаций КАК СоответствияФизическихЛицИОрганизаций
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Тренеры КАК Тренеры
		               |		ПО СоответствияФизическихЛицИОрганизаций.ФизическоеЛицо = Тренеры.ФизическоеЛицо
		               |ГДЕ
		               |	Тренеры.СтатусТренера <> ЗНАЧЕНИЕ(Перечисление.СтатусыТренеров.ТренерДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоответствияФизическихЛицИОрганизаций.Организация = &Организация) КАК Поле2}
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СпортивныеЗванияТренеровСрезПоследних.Тренер КАК Значение
		               |ИЗ
		               |	РегистрСведений.СпортивныеЗванияТренеров.СрезПоследних(, ) КАК СпортивныеЗванияТренеровСрезПоследних
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Тренеры КАК Тренеры
		               |		ПО СпортивныеЗванияТренеровСрезПоследних.Тренер.Ссылка = Тренеры.Ссылка";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
	ИначеЕсли НазваниеЗапроса = "Заслуженный тренер России" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	Тренеры.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ Тренеры
		               |ИЗ
		               |	РегистрСведений.СоответствияФизическихЛицИОрганизаций КАК СоответствияФизическихЛицИОрганизаций
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Тренеры КАК Тренеры
		               |		ПО СоответствияФизическихЛицИОрганизаций.ФизическоеЛицо = Тренеры.ФизическоеЛицо
		               |ГДЕ
		               |	Тренеры.СтатусТренера <> ЗНАЧЕНИЕ(Перечисление.СтатусыТренеров.ТренерДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоответствияФизическихЛицИОрганизаций.Организация = &Организация) КАК Поле2}
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	СпортивныеЗванияТренеровСрезПоследних.Тренер КАК Значение
		               |ИЗ
		               |	РегистрСведений.СпортивныеЗванияТренеров.СрезПоследних(, Звание = ЗНАЧЕНИЕ(Справочник.ЗванияТренеров.ЗваниеЗаслуженныйТренерРоссии)) КАК СпортивныеЗванияТренеровСрезПоследних
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Тренеры КАК Тренеры
		               |		ПО СпортивныеЗванияТренеровСрезПоследних.Тренер.Ссылка = Тренеры.Ссылка";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
	ИначеЕсли НазваниеЗапроса = "Заслуженный работник физической культуры Российской Федерации" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	Тренеры.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ Тренеры
		               |ИЗ
		               |	РегистрСведений.СоответствияФизическихЛицИОрганизаций КАК СоответствияФизическихЛицИОрганизаций
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Тренеры КАК Тренеры
		               |		ПО СоответствияФизическихЛицИОрганизаций.ФизическоеЛицо = Тренеры.ФизическоеЛицо
		               |ГДЕ
		               |	Тренеры.СтатусТренера <> ЗНАЧЕНИЕ(Перечисление.СтатусыТренеров.ТренерДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоответствияФизическихЛицИОрганизаций.Организация = &Организация) КАК Поле2}
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	СпортивныеЗванияТренеровСрезПоследних.Тренер КАК Значение
		               |ИЗ
		               |	РегистрСведений.СпортивныеЗванияТренеров.СрезПоследних(, Звание = ЗНАЧЕНИЕ(Справочник.ЗванияТренеров.ЗваниеЗаслуженныйРаботникФизическойКультурыРоссийскойФедерации)) КАК СпортивныеЗванияТренеровСрезПоследних
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Тренеры КАК Тренеры
		               |		ПО СпортивныеЗванияТренеровСрезПоследних.Тренер.Ссылка = Тренеры.Ссылка";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
	ИначеЕсли НазваниеЗапроса = "Присуждены другие государственные почетные звания и награды" тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	Тренеры.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ Тренеры
		               |ИЗ
		               |	РегистрСведений.СоответствияФизическихЛицИОрганизаций КАК СоответствияФизическихЛицИОрганизаций
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Тренеры КАК Тренеры
		               |		ПО СоответствияФизическихЛицИОрганизаций.ФизическоеЛицо = Тренеры.ФизическоеЛицо
		               |ГДЕ
		               |	Тренеры.СтатусТренера <> ЗНАЧЕНИЕ(Перечисление.СтатусыТренеров.ТренерДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоответствияФизическихЛицИОрганизаций.Организация = &Организация) КАК Поле2}
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	НаградыСрезПоследних.Тренер КАК Значение
		               |ИЗ
		               |	РегистрСведений.Награды.СрезПоследних(, ) КАК НаградыСрезПоследних
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Тренеры КАК Тренеры
		               |		ПО НаградыСрезПоследних.Тренер.Ссылка = Тренеры.Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	СпортивныеЗванияТренеровСрезПоследних.Тренер
		               |ИЗ
		               |	РегистрСведений.СпортивныеЗванияТренеров.СрезПоследних(
		               |			,
		               |			Звание <> ЗНАЧЕНИЕ(Справочник.ЗванияТренеров.ЗваниеЗаслуженныйТренерРоссии)
		               |				И Звание <> ЗНАЧЕНИЕ(Справочник.ЗванияТренеров.ЗваниеЗаслуженныйРаботникФизическойКультурыРоссийскойФедерации)) КАК СпортивныеЗванияТренеровСрезПоследних
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Тренеры КАК Тренеры
		               |		ПО СпортивныеЗванияТренеровСрезПоследних.Тренер.Ссылка = Тренеры.Ссылка";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
	ИначеЕсли НазваниеЗапроса = "3 юн." тогда
		НазваниеЗапроса = "Всего 3 юн. разряда";
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта КАК ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд КАК Разряд,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПодтверждения) КАК ДатаПодтверждения
		               |ПОМЕСТИТЬ ВТ_РазрядыАктуальные
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних(
		               |			&КонецПериода {(&Период)},
		               |			Спортсмен В
		               |				(ВЫБРАТЬ
		               |					ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |				ИЗ
		               |					ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)) КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ДатаПрисвоения,
		               |	ДатаПодтверждения,
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВЫБОР
		               |		КОГДА ВТ_РазрядыАктуальные.Разряд = ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ТретийЮношеский)
		               |			ТОГДА ВТ_РазрядыАктуальные.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТР
		               |ИЗ
		               |	ВТ_РазрядыАктуальные КАК ВТ_РазрядыАктуальные
		               |ГДЕ
		               |	ВТ_РазрядыАктуальные.ВидСпорта = &ВидСпорта
		               |	И НЕ ВТ_РазрядыАктуальные.Спортсмен ЕСТЬ NULL
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВТР.Значение КАК Значение
		               |ИЗ
		               |	ВТР КАК ВТР
		               |ГДЕ
		               |	НЕ ВТР.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания); 
		Запрос.УстановитьПараметр("Период", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
	ИначеЕсли НазваниеЗапроса = "2 юн." тогда
		НазваниеЗапроса = "Всего 2 юн. разряда";
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта КАК ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд КАК Разряд,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПодтверждения) КАК ДатаПодтверждения
		               |ПОМЕСТИТЬ ВТ_РазрядыАктуальные
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних(
		               |			&КонецПериода {(&Период)},
		               |			Спортсмен В
		               |				(ВЫБРАТЬ
		               |					ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |				ИЗ
		               |					ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)) КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ДатаПрисвоения,
		               |	ДатаПодтверждения,
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВЫБОР
		               |		КОГДА ВТ_РазрядыАктуальные.Разряд = ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ВторойЮношеский)
		               |			ТОГДА ВТ_РазрядыАктуальные.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТР
		               |ИЗ
		               |	ВТ_РазрядыАктуальные КАК ВТ_РазрядыАктуальные
		               |ГДЕ
		               |	ВТ_РазрядыАктуальные.ВидСпорта = &ВидСпорта
		               |	И НЕ ВТ_РазрядыАктуальные.Спортсмен ЕСТЬ NULL
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВТР.Значение КАК Значение
		               |ИЗ
		               |	ВТР КАК ВТР
		               |ГДЕ
		               |	НЕ ВТР.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
		Запрос.УстановитьПараметр("Период", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
	ИначеЕсли НазваниеЗапроса = "1 юн. " тогда
		НазваниеЗапроса = "Всего 1 юн. разряда";
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта КАК ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд КАК Разряд,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПодтверждения) КАК ДатаПодтверждения
		               |ПОМЕСТИТЬ ВТ_РазрядыАктуальные
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних(
		               |			&КонецПериода {(&Период)},
		               |			Спортсмен В
		               |				(ВЫБРАТЬ
		               |					ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |				ИЗ
		               |					ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)) КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ДатаПрисвоения,
		               |	ДатаПодтверждения,
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВЫБОР
		               |		КОГДА ВТ_РазрядыАктуальные.Разряд = ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПервыйЮношеский)
		               |			ТОГДА ВТ_РазрядыАктуальные.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТР
		               |ИЗ
		               |	ВТ_РазрядыАктуальные КАК ВТ_РазрядыАктуальные
		               |ГДЕ
		               |	ВТ_РазрядыАктуальные.ВидСпорта = &ВидСпорта
		               |	И НЕ ВТ_РазрядыАктуальные.Спортсмен ЕСТЬ NULL
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВТР.Значение КАК Значение
		               |ИЗ
		               |	ВТР КАК ВТР
		               |ГДЕ
		               |	НЕ ВТР.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
		Запрос.УстановитьПараметр("Период", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
	ИначеЕсли НазваниеЗапроса = "III" тогда
		 НазваниеЗапроса = "Всего III разряда";
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта КАК ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд КАК Разряд,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПодтверждения) КАК ДатаПодтверждения
		               |ПОМЕСТИТЬ ВТ_РазрядыАктуальные
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних(
		               |			&КонецПериода {(&Период)},
		               |			Спортсмен В
		               |				(ВЫБРАТЬ
		               |					ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |				ИЗ
		               |					ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)) КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ДатаПрисвоения,
		               |	ДатаПодтверждения,
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВЫБОР
		               |		КОГДА ВТ_РазрядыАктуальные.Разряд = ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ТретийСпортивныйРазряд)
		               |			ТОГДА ВТ_РазрядыАктуальные.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТР
		               |ИЗ
		               |	ВТ_РазрядыАктуальные КАК ВТ_РазрядыАктуальные
		               |ГДЕ
		               |	ВТ_РазрядыАктуальные.ВидСпорта = &ВидСпорта
		               |	И НЕ ВТ_РазрядыАктуальные.Спортсмен ЕСТЬ NULL
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВТР.Значение КАК Значение
		               |ИЗ
		               |	ВТР КАК ВТР
		               |ГДЕ
		               |	НЕ ВТР.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
		Запрос.УстановитьПараметр("Период", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
	ИначеЕсли НазваниеЗапроса = "II" тогда
		НазваниеЗапроса = "Всего II разряда";
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта КАК ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд КАК Разряд,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПодтверждения) КАК ДатаПодтверждения
		               |ПОМЕСТИТЬ ВТ_РазрядыАктуальные
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних(
		               |			&КонецПериода {(&Период)},
		               |			Спортсмен В
		               |				(ВЫБРАТЬ
		               |					ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |				ИЗ
		               |					ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)) КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ДатаПрисвоения,
		               |	ДатаПодтверждения,
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВЫБОР
		               |		КОГДА ВТ_РазрядыАктуальные.Разряд = ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ВторойСпортивныйРазряд)
		               |			ТОГДА ВТ_РазрядыАктуальные.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТР
		               |ИЗ
		               |	ВТ_РазрядыАктуальные КАК ВТ_РазрядыАктуальные
		               |ГДЕ
		               |	ВТ_РазрядыАктуальные.ВидСпорта = &ВидСпорта
		               |	И НЕ ВТ_РазрядыАктуальные.Спортсмен ЕСТЬ NULL
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВТР.Значение КАК Значение
		               |ИЗ
		               |	ВТР КАК ВТР
		               |ГДЕ
		               |	НЕ ВТР.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
		Запрос.УстановитьПараметр("Период", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
	ИначеЕсли НазваниеЗапроса = "I" тогда
		НазваниеЗапроса = "Всего I разряда";
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта КАК ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд КАК Разряд,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПодтверждения) КАК ДатаПодтверждения
		               |ПОМЕСТИТЬ ВТ_РазрядыАктуальные
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних(
		               |			&КонецПериода {(&Период)},
		               |			Спортсмен В
		               |				(ВЫБРАТЬ
		               |					ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |				ИЗ
		               |					ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)) КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ДатаПрисвоения,
		               |	ДатаПодтверждения,
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВЫБОР
		               |		КОГДА ВТ_РазрядыАктуальные.Разряд = ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ПервыйСпортивныйРазряд)
		               |			ТОГДА ВТ_РазрядыАктуальные.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТР
		               |ИЗ
		               |	ВТ_РазрядыАктуальные КАК ВТ_РазрядыАктуальные
		               |ГДЕ
		               |	ВТ_РазрядыАктуальные.ВидСпорта = &ВидСпорта
		               |	И НЕ ВТ_РазрядыАктуальные.Спортсмен ЕСТЬ NULL
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВТР.Значение КАК Значение
		               |ИЗ
		               |	ВТР КАК ВТР
		               |ГДЕ
		               |	НЕ ВТР.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
		Запрос.УстановитьПараметр("Период", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
	ИначеЕсли НазваниеЗапроса = "КМС" тогда
		НазваниеЗапроса = "Всего званий КМС";  
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация) КАК Поле2}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта КАК ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд КАК Разряд,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПодтверждения) КАК ДатаПодтверждения
		               |ПОМЕСТИТЬ ВТ_РазрядыАктуальные
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних(
		               |			&КонецПериода {(&Период)},
		               |			Спортсмен В
		               |				(ВЫБРАТЬ
		               |					ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |				ИЗ
		               |					ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)) КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ДатаПрисвоения,
		               |	ДатаПодтверждения,
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВЫБОР
		               |		КОГДА ВТ_РазрядыАктуальные.Разряд = ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.КандидатВМастераСпорта)
		               |			ТОГДА ВТ_РазрядыАктуальные.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТР
		               |ИЗ
		               |	ВТ_РазрядыАктуальные КАК ВТ_РазрядыАктуальные
		               |ГДЕ
		               |	ВТ_РазрядыАктуальные.ВидСпорта = &ВидСпорта
		               |	И НЕ ВТ_РазрядыАктуальные.Спортсмен ЕСТЬ NULL
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВТР.Значение КАК Значение
		               |ИЗ
		               |	ВТР КАК ВТР
		               |ГДЕ
		               |	НЕ ВТР.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
		Запрос.УстановитьПараметр("Период", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
	ИначеЕсли НазваниеЗапроса = "МС" тогда
		НазваниеЗапроса = "Всего званий МС";
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта КАК ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд КАК Разряд,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПодтверждения) КАК ДатаПодтверждения
		               |ПОМЕСТИТЬ ВТ_РазрядыАктуальные
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних(
		               |			&КонецПериода {(&Период)},
		               |			Спортсмен В
		               |				(ВЫБРАТЬ
		               |					ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |				ИЗ
		               |					ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)) КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ДатаПрисвоения,
		               |	ДатаПодтверждения,
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВЫБОР
		               |		КОГДА ВТ_РазрядыАктуальные.Разряд = ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.МастерСпортаРоссии)
		               |			ТОГДА ВТ_РазрядыАктуальные.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТР
		               |ИЗ
		               |	ВТ_РазрядыАктуальные КАК ВТ_РазрядыАктуальные
		               |ГДЕ
		               |	ВТ_РазрядыАктуальные.ВидСпорта = &ВидСпорта
		               |	И НЕ ВТ_РазрядыАктуальные.Спортсмен ЕСТЬ NULL
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВТР.Значение КАК Значение
		               |ИЗ
		               |	ВТР КАК ВТР
		               |ГДЕ
		               |	НЕ ВТР.Значение ЕСТЬ NULL";
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
		Запрос.УстановитьПараметр("Период", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
	ИначеЕсли НазваниеЗапроса = "ЗМС" тогда
		НазваниеЗапроса = "Всего званий ЗМС";
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		               |	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		               |ПОМЕСТИТЬ ВТ_СоставУчащихся
		               |ИЗ
		               |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(&КонецПериода, ) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		               |ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &КонецПериода
		               |			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		               |	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен.СтатусСпортсмена <> ЗНАЧЕНИЕ(Перечисление.СтатусыСпортсменов.СпортсменДругогоСпортивногоУчреждения)
		               |{ГДЕ
		               |	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация = &Организация)}
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация КАК Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта КАК ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд КАК Разряд,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПрисвоения) КАК ДатаПрисвоения,
		               |	МАКСИМУМ(ПодтвержденныеРазрядыСпортсменовСрезПоследних.ДатаПодтверждения) КАК ДатаПодтверждения
		               |ПОМЕСТИТЬ ВТ_РазрядыАктуальные
		               |ИЗ
		               |	РегистрСведений.ПодтвержденныеРазрядыСпортсменов.СрезПоследних(
		               |			&КонецПериода {(&Период)},
		               |			Спортсмен В
		               |				(ВЫБРАТЬ
		               |					ВТ_СоставУчащихся.Спортсмен КАК Спортсмен
		               |				ИЗ
		               |					ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)) КАК ПодтвержденныеРазрядыСпортсменовСрезПоследних
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Организация,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Спортсмен,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.ВидСпорта,
		               |	ПодтвержденныеРазрядыСпортсменовСрезПоследних.Разряд
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ДатаПрисвоения,
		               |	ДатаПодтверждения,
		               |	Разряд,
		               |	Организация,
		               |	Спортсмен,
		               |	ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВЫБОР
		               |		КОГДА ВТ_РазрядыАктуальные.Разряд = ЗНАЧЕНИЕ(Справочник.СпортивнаяКлассификация.ЗаслуженныйМастерСпортаРоссии)
		               |			ТОГДА ВТ_РазрядыАктуальные.Спортсмен
		               |	КОНЕЦ КАК Значение
		               |ПОМЕСТИТЬ ВТР
		               |ИЗ
		               |	ВТ_РазрядыАктуальные КАК ВТ_РазрядыАктуальные
		               |ГДЕ
		               |	ВТ_РазрядыАктуальные.ВидСпорта = &ВидСпорта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВТР.Значение КАК Значение
		               |ИЗ
		               |	ВТР КАК ВТР
		               |ГДЕ
		               |	НЕ ВТР.Значение ЕСТЬ NULL";
		Запрос.УстановитьПараметр("Период", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
		Если Не Организация = Неопределено Тогда
			Запрос.УстановитьПараметр("Организация", Организация);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидСпорта", ВидСпорта);
		Запрос.УстановитьПараметр("КонецПериода", Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
	КонецЕсли;
	// }Рарус dotere #23028 -Организация берется из параметров, во всех запросах имзмененно условия по организации 2022.01.18
	Список.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Значение"));
КонецПроцедуры

&НаКлиенте
Функция СтруктуруВОбласть(Структура)
	Если Структура.Свойство("R") И Структура.Свойство("C") тогда
		Возврат "R"+Структура.R+"C"+Структура.C;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция ОбластьВСтруктуру(Область = "R0C0")
	НомерС = СтрНайти(Область, "C");
	
	КоординатыОбласти = Новый Структура("R, C", 0, 0);
	
	Если Не НомерС = 0 И Не Область = "R0C0" тогда
		КоординатыОбласти.R = Число(Сред(Область,2,НомерС-2));
		КоординатыОбласти.C = Число(Сред(Область,НомерС+1));	
	КонецЕсли;
	
	Возврат КоординатыОбласти;
КонецФункции

&НаКлиенте
Процедура ОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	ОбработкаРасшифровки =  Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(Отчет));
	
	МассивДоступныхДействий = Новый Массив();
	МассивДоступныхДействий.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	
	ПараметрыОповещения = Новый Структура("Область",Элемент.ТекущаяОбласть.Имя);
	
	ОбработкаРасшифровки.ПоказатьВыборДействия(Новый ОписаниеОповещения("ОбработатьРасшифровку",ЭтаФорма, ПараметрыОповещения),Расшифровка,МассивДоступныхДействий);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// {Рарус dotere #23028 -Скрывает организацию если методист 2022.01.14
	Идентификатор = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ПолучитьИдентификаторПоОбъекту(Отчет.КомпоновщикНастроек.Настройки["ПараметрыДанных"].НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация")));
		ПараметрОрганизация = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
		ПараметрОрганизация.Значение = Неопределено;
	    ПараметрОрганизация.Использование = Ложь;
	    ПараметрОрганизация.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
	Если ПользователюРольДоступна("Методист") И Не ПользователюРольДоступна("ПолныеПрава") Тогда
		ПараметрОрганизация.Значение = ТекущаяОрганизация();
	    ПараметрОрганизация.Использование = Истина;
	    ПараметрОрганизация.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	// }Рарус dotere #23028 -Скрывает организацию если методист 2022.01.14
КонецПроцедуры


&НаСервере
Функция ТекущаяОрганизация()
	Возврат ПараметрыСеанса.ТекущаяОрганизация;
КонецФункции

&НаСервере
Функция ПользователюРольДоступна(РольИмя)
	Возврат РольДоступна(РольИмя);
КонецФункции

// }Рарус ivaart IN-21502 Расшифровка отчёта 2021.11.29