
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УстановитьЦвет1(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 255);
	Результат.Вставить("Зеленый", 255);
	Результат.Вставить("Синий", 204);

	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет2(Команда)	
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 255);
	Результат.Вставить("Зеленый", 204);
	Результат.Вставить("Синий", 204);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет3(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 255);
	Результат.Вставить("Зеленый", 102);
	Результат.Вставить("Синий", 204);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет4(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 204);
	Результат.Вставить("Зеленый", 153);
	Результат.Вставить("Синий", 204);   
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет5(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 204);
	Результат.Вставить("Зеленый", 153);
	Результат.Вставить("Синий", 255);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет6(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 204);
	Результат.Вставить("Зеленый", 204);
	Результат.Вставить("Синий", 255);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет7(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 153);
	Результат.Вставить("Зеленый", 204);
	Результат.Вставить("Синий", 255);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет8(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 0);
	Результат.Вставить("Зеленый", 191);
	Результат.Вставить("Синий", 255);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет9(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 204);
	Результат.Вставить("Зеленый", 255);
	Результат.Вставить("Синий", 255);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет10(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 239);
	Результат.Вставить("Зеленый", 252);
	Результат.Вставить("Синий", 255);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет11(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 153);
	Результат.Вставить("Зеленый", 255);
	Результат.Вставить("Синий", 204);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет12(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 102);
	Результат.Вставить("Зеленый", 255);
	Результат.Вставить("Синий", 153);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет13(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 204);
	Результат.Вставить("Зеленый", 255);
	Результат.Вставить("Синий", 153);
			
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет14(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 204);
	Результат.Вставить("Зеленый", 204);
	Результат.Вставить("Синий", 204);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет15(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 255);
	Результат.Вставить("Зеленый", 204);
	Результат.Вставить("Синий", 102);

	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет16(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 255);
	Результат.Вставить("Зеленый", 153);
	Результат.Вставить("Синий", 153);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет17(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 153);
	Результат.Вставить("Зеленый", 153);
	Результат.Вставить("Синий", 255);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет18(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 153);
	Результат.Вставить("Зеленый", 255);
	Результат.Вставить("Синий", 255);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет19(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 51);
	Результат.Вставить("Зеленый", 204);
	Результат.Вставить("Синий", 204);
		
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет20(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 240);
	Результат.Вставить("Зеленый", 255);
	Результат.Вставить("Синий", 240);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет21(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 250);
	Результат.Вставить("Зеленый", 235);
	Результат.Вставить("Синий", 215);
		
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет22(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 255);
	Результат.Вставить("Зеленый", 222);
	Результат.Вставить("Синий", 173);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет23(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 255);
	Результат.Вставить("Зеленый", 215);
	Результат.Вставить("Синий", 0);
		
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦвет24(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", 255);  
	Результат.Вставить("Зеленый", 236);
	Результат.Вставить("Синий", 139);
		
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти