
&НаКлиенте
Процедура Сформировать(Команда)
	
	Если СписокСпортсменов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбраны спортсмены для формирования карточки!",,"СписокСпортсменов");
		Возврат;
	КонецЕсли;
	
	МассивСпортсменов = Новый Массив;
	Для Каждого ЗначениеСписка Из СписокСпортсменов Цикл
		МассивСпортсменов.Добавить(ЗначениеСписка.Значение);
	КонецЦикла;	
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати
		(
		"Справочник.Спортсмены",
		"ЛичнаяКарточкаСпортсмена",
		МассивСпортсменов,
		Неопределено,
		Неопределено
		);
	
КонецПроцедуры
