
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	// {Рарус adilas #18231 -Тестирование релиза Альфа СПОРТ 1.0.0.3. Данные спортсменов на этапах спортивной подготовки 2021.07.08
	// Параметры = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	// Параметры.УстановитьЗначениеПараметра("Организация", ПараметрыСеанса.ТекущаяОрганизация);
	//ПараметрСКДПериод   			= Новый ПараметрКомпоновкиДанных("Период");
	//ЗначениеПараметрСКДПериод 		= ТекущаяДатаСеанса();
	//ПараметрСКДОрганизация    		= Новый ПараметрКомпоновкиДанных("Организация");
	//ЗначениеПараметрСКДОрганизация 	= ПараметрыСеанса.ТекущаяОрганизация;
	//	
	//КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрСКДПериод, ЗначениеПараметрСКДПериод);
	//КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрСКДОрганизация, ЗначениеПараметрСКДОрганизация);
	// }Рарус adilas #18231 -Тестирование релиза Альфа СПОРТ 1.0.0.3. Данные спортсменов на этапах спортивной подготовки 2021.07.08
    
КонецПроцедуры

#КонецОбласти