#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроведениеСоревнованийФормыКлиент.СформироватьЗаголовокФормыСписка(ЭтаФорма, "ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФП", ТипСоревнования);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеТипаСоревнования" Тогда
		ТипСоревнования = Параметр.ТипСоревнования;
		
		ПроведениеСоревнованийФормыКлиент.СформироватьЗаголовокФормыСписка(ЭтаФорма, "ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФП", ТипСоревнования);
	    УстановитьОтборНаДинамическийСписок();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборНаДинамическийСписок()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТипСоревнования", ТипСоревнования, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	
КонецПроцедуры	

#КонецОбласти