&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Рейтинг.Пустая() ИЛИ ЭтаФорма.ПредставлениеТекущегоВарианта = "Расшифровка" Тогда
		Возврат;
	КонецЕсли;	
	
	КомпоновщикНастроек = Отчет.КомпоновщикНастроек;
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("Рейтинг");
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	Параметр.Значение = Рейтинг;
	Параметр.Использование = Истина;
	
	Если ЗначениеЗаполнено(Параметр.ИдентификаторПользовательскойНастройки) Тогда
		ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПользовательскийПараметр.Значение = Параметр.Значение;
			ПользовательскийПараметр.Использование = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ Рейтинг.Пустая() Тогда
		ВариантМодифицирован = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("Рейтинг") ИЛИ Параметры.ПредставлениеВарианта = "Расшифровка" Тогда
		Возврат;
	КонецЕсли;
	
	Рейтинг = Параметры.Рейтинг;
	
КонецПроцедуры
