
#Область ОписаниеПеременных

&НаКлиенте
Перем ЗакрытиеРазрешено;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") Тогда
		
		Объект.Организация = Параметры.Организация;
		
	КонецЕсли;
	
	ЗначениеЗаявления = ДанныеФормыВЗначение(Параметры.Объект, Тип("ДокументОбъект.ЗаявленияНаПриемВСпортивноеУчреждение"));
	ЗначениеВРеквизитФормы(ЗначениеЗаявления, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		
		ТекстПредупреждения = "Завершить работу с программой?";
		Отказ = Истина;
		
    ИначеЕсли ЗакрытиеРазрешено = Неопределено Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), "Работа в данном окне завершена?", РежимДиалогаВопрос.ДаНет);
        Отказ = Истина;
		
    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПредоставленныеДокументы

&НаКлиенте
Процедура ОбъектПредоставленныеДокументыФайлДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПредоставленныеДокументыОткрыть(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредоставленныеДокументыОткрыть(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ВладелецФайла", Объект.Ссылка);
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	
	ОповещениеОЗакрыти = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы", ПараметрыФормы, , , , , ОповещениеОЗакрыти);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеВыбораФайла(Результат, ДополнительныеПараметры) Экспорт 

	ТекущиеДанные = Элементы.ОбъектПредоставленныеДокументы.ТекущиеДанные;
	ТекущиеДанные.ФайлДокумента = Результат;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)

	Закрыть(Объект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ЗакрытиеРазрешено = Истина;
		Закрыть(Объект);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявлениеПредоставленныеДокументыФайлДокументаПриИзменении(Элемент)
	
	СтандартнаяОбработка = Ложь;
	ПредоставленныеДокументыОткрыть(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявлениеПредоставленныеДокументыФайлДокументаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПредоставленныеДокументыОткрыть(Элемент);
КонецПроцедуры

#КонецОбласти