
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
#Если Не ВебКлиент тогда
	Печать("Справочник.Рейтинги", "ПФ_ПоложениеОРейтинге",  ПараметрКоманды, "ПФ Положение о рейтинге");
#Иначе
	Документ = ПолучитьДокументДляПечатиНаВеб(ПараметрКоманды);
	Документ.Показать("Положение о рейтинге");
#КонецЕсли
КонецПроцедуры

&НаСервере
Функция  ПолучитьДокументДляПечатиНаВеб(ПараметрКоманды)
	ТабДок = новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	
	Данные = Справочники.Рейтинги.ПолучитьДанныеОбъекта(ПараметрКоманды, "МакетПоложениеОРейтинге");
	
	Для Каждого ОбъектДанных Из Данные Цикл
		Макет = Справочники.Рейтинги.ПолучитьМакет("МакетПоложениеОРейтинге");
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьЗаголовок.Параметры.Заполнить(ОбъектДанных.Заголовок);
		ТабДок.Вывести(ОбластьЗаголовок);
		
		ОбластьЦели = Макет.ПолучитьОбласть("Цель");
		Для Каждого Цель Из ОбъектДанных.Цель Цикл
			ОбластьЦели.Параметры.ОписаниеЦели = Цель.ОписаниеЦели;
			ТабДок.Вывести(ОбластьЦели);
		КонецЦикла;
		
		ОбластьУсловиеРейтинга2 = Макет.ПолучитьОбласть("УсловиеРейтинга2");
		ОбластьУсловиеРейтинга2.Параметры.Заполнить(ОбъектДанных.УсловиеРейтинга2);
		ТабДок.Вывести(ОбластьУсловиеРейтинга2);
		
		ОбластьСпонсоры = Макет.ПолучитьОбласть("Спонсор");
		Для Каждого Спонсор Из ОбъектДанных.Спонсоры Цикл
			ОбластьСпонсоры.Параметры.НаименованиеСпонсоры = Спонсор.НаименованиеСпонсоры;
			ТабДок.Вывести(ОбластьСпонсоры);
		КонецЦикла;
		
		ОбластьУсловиеРейтинга3 = Макет.ПолучитьОбласть("УсловиеРейтинга3");
		ОбластьУсловиеРейтинга3.Параметры.Заполнить(ОбъектДанных.УсловиеРейтинга3);
		ТабДок.Вывести(ОбластьУсловиеРейтинга3);
		
		ОбластьДисциплины = Макет.ПолучитьОбласть("Дисциплина");
		Для Каждого Дисциплина Из ОбъектДанных.Дисциплина Цикл
			ОбластьДисциплины.Параметры.Дисциплина = Дисциплина.Дисциплина;
			ТабДок.Вывести(ОбластьДисциплины);
		КонецЦикла;

		ОбластьУсловиеРейтинга6 = Макет.ПолучитьОбласть("УсловиеРейтинга6");
		ОбластьУсловиеРейтинга6.Параметры.Заполнить(ОбъектДанных.УсловиеРейтинга6);
		ТабДок.Вывести(ОбластьУсловиеРейтинга6);
		
		ОбластьВозрастныеГруппы = Макет.ПолучитьОбласть("ВозрастнаяГруппа");
		Для Каждого ВозрастнаяГруппа Из ОбъектДанных.ВозрастныеГруппы Цикл
			ОбластьВозрастныеГруппы.Параметры.ВозрастнаяГруппа = ВозрастнаяГруппа.ВозрастнаяГруппа;
			ТабДок.Вывести(ОбластьВозрастныеГруппы);
		КонецЦикла;
		
		ОбластьУсловиеРейтинга4 = Макет.ПолучитьОбласть("УсловиеРейтинга4");
		ТабДок.Вывести(ОбластьУсловиеРейтинга4);
		
		ОбластьСтрокиТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		Для Каждого СтрокаТаблицы Из ОбъектДанных.СтрокаТаблицы Цикл
			ОбластьСтрокиТаблицы.Параметры.Заполнить(СтрокаТаблицы);
			ТабДок.Вывести(ОбластьСтрокиТаблицы);
		КонецЦикла;
		
		ОбластьУсловиеРейтинга5 = Макет.ПолучитьОбласть("УсловиеРейтинга5");
		ОбластьУсловиеРейтинга5.Параметры.Заполнить(ОбъектДанных.УсловиеРейтинга5);
		ТабДок.Вывести(ОбластьУсловиеРейтинга5);
		
		ОбластьСтрокиТаблицыСоревнований = Макет.ПолучитьОбласть("СтрокаТаблицыСоревнований");
		Для Каждого СтрокаТаблицыСоревнований Из ОбъектДанных.СтрокаТаблицыСоревнований Цикл
			ОбластьСтрокиТаблицыСоревнований.Параметры.Заполнить(СтрокаТаблицыСоревнований);
			ТабДок.Вывести(ОбластьСтрокиТаблицыСоревнований);
		КонецЦикла;
	КонецЦикла;
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура Печать(ИмяМенеджераПечати, ИмяМакета, ДанныеПечати, НаименованиеМакета) Экспорт
	
	Если ДанныеПечати.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;   
		
	МакетИДанныеОбъекта = УправлениеПечатьюВызовСервера.МакетыИДанныеОбъектовДляПечати(ИмяМенеджераПечати, ИмяМакета, ДанныеПечати);
	
	Вывести(ДанныеПечати, МакетИДанныеОбъекта, ИмяМакета, МакетИДанныеОбъекта.ЛокальныйКаталогФайловПечати, НаименованиеМакета);
	
	
КонецПроцедуры

&НаКлиенте
Процедура Вывести(ДанныеПечати, МакетИДанныеОбъекта, ИмяМакета, ЛокальныйКаталогФайловПечати, НаименованиеМакета)
	
	ТипМакета				= МакетИДанныеОбъекта.Макеты.ТипыМакетов[ИмяМакета];
	ДвоичныеДанныеМакетов	= МакетИДанныеОбъекта.Макеты.ДвоичныеДанныеМакетов;
	Области					= МакетИДанныеОбъекта.Макеты.ОписаниеОбластей;
		
	Макет = УправлениеПечатьюКлиент.ИнициализироватьМакетОфисногоДокумента(ДвоичныеДанныеМакетов[ИмяМакета], ТипМакета, ИмяМакета);
	Если Макет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗакрытьОкноПечатнойФормы = Ложь;
	
	Для Каждого ОбъектДанных Из ДанныеПечати Цикл
		
		ДанныеОбъектаМассив     = МакетИДанныеОбъекта.Данные[ОбъектДанных][ИмяМакета];
		
		Для Каждого ДанныеОбъекта Из  ДанныеОбъектаМассив Цикл
			
			Попытка
				
				ПечатнаяФорма = УправлениеПечатьюКлиент.ИнициализироватьПечатнуюФорму(ТипМакета, Макет.НастройкиСтраницыМакета);
				Если ПечатнаяФорма = Неопределено Тогда
					УправлениеПечатьюКлиент.ОчиститьСсылки(Макет);
					Возврат;                                                             
				КонецЕсли;
				
				Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["Заголовок"]);
				УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта.Заголовок, Ложь);
				
				Для Каждого СтрокаТаблицы Из ДанныеОбъекта.Цель Цикл
					Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["Цель"]);
					УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, СтрокаТаблицы, Ложь);		
				КонецЦикла;
				
				Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["УсловиеРейтинга2"]);
				УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта.УсловиеРейтинга2, Ложь);
				
				Для Каждого СтрокаТаблицы Из ДанныеОбъекта.Спонсоры Цикл
					Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["Спонсор"]);
					УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, СтрокаТаблицы, Ложь);		
				КонецЦикла;
				
				Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["УсловиеРейтинга3"]);
				УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта.УсловиеРейтинга3, Ложь);
				
				Для Каждого СтрокаТаблицы Из ДанныеОбъекта.Дисциплина Цикл
					Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["Дисциплина"]);
					УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, СтрокаТаблицы, Ложь);		
				КонецЦикла;

				Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["УсловиеРейтинга6"]);
				УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта.УсловиеРейтинга6, Ложь);
				
				Для Каждого СтрокаТаблицы Из ДанныеОбъекта.ВозрастныеГруппы Цикл
					Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["ВозрастнаяГруппа"]);
					УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, СтрокаТаблицы, Ложь);		
				КонецЦикла;
				
								
				Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["УсловиеРейтинга4"]);
				УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область,, Ложь);
				
				Для Каждого СтрокаТаблицы Из ДанныеОбъекта.СтрокаТаблицы Цикл
					Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["СтрокаТаблицы"]);
					УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, СтрокаТаблицы, Ложь);		
				КонецЦикла;
				
				Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["УсловиеРейтинга5"]);
				УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта.УсловиеРейтинга5, Ложь);
				
				Для Каждого СтрокаТаблицы Из ДанныеОбъекта.СтрокаТаблицыСоревнований Цикл
					Область = УправлениеПечатьюКлиент.ОбластьМакета(Макет, Области[ИмяМакета]["СтрокаТаблицыСоревнований"]);
					УправлениеПечатьюКлиент.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, СтрокаТаблицы, Ложь);		
				КонецЦикла;
				
				УправлениеПечатьюКлиент.ПоказатьДокумент(ПечатнаяФорма);
				
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗакрытьОкноПечатнойФормы = Истина;
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЦикла;
	
	УправлениеПечатьюКлиент.ОчиститьСсылки(ПечатнаяФорма, ЗакрытьОкноПечатнойФормы);
	УправлениеПечатьюКлиент.ОчиститьСсылки(Макет);
	
КонецПроцедуры