
#Область ОбработчикиСобытийФормы

// {Рарус adilas #10010 -Переделать документы для указания нескольких спортсменов 2020.10.07
// Замена на ТЧ
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// {Рарус adilas #23059 -РС Руководитель. Карточка спортсмена.Карточка тренера. 2021.12.13
	// {Рарус dotere #21842 -В методите поле ответственный недоступно 2020.11.06
	Если РольДоступна("ПолныеПрава") Тогда
		 Элементы.Ответственный.Доступность = Истина;
	Иначе 	 
		 Элементы.Ответственный.Доступность = Ложь;
	КонецЕсли;
	// }Рарус dotere #21842 -В методите поле ответственный недоступно 2020.11.06
	// }Рарус adilas #23059 -РС Руководитель. Карточка спортсмена.Карточка тренера. 2021.12.13
	
	Если Параметры.Свойство("Спортсмен") Тогда
		СтрокаСпортсмен = Объект.Спортсмены.Добавить();
		СтрокаСпортсмен.Спортсмен = Параметры.Спортсмен;
	ИначеЕсли Параметры.Свойство("Отбор") Тогда
		СтрокаСпортсмен = Объект.Спортсмены.Добавить();
		СтрокаСпортсмен.Спортсмен = Параметры.Отбор.Спортсмен;	
	КонецЕсли;
	
	// {Рарус adilas #10700 -Вид спорта подставлять по текущему этапу спортсмена 2020.11.05
	Если Объект.Ссылка.Пустая() Тогда
		УчетСпортсменовСервер.ЗаполнитьНастройкиПоУмолчанию(Объект);
	КонецЕсли;
	// }Рарус adilas #10700 -Вид спорта подставлять по текущему этапу спортсмена 2020.11.05
	
	// {Рарус adilas #13392 -Номер документа 2021.02.12
	Если Пользователи.РолиДоступны("АдминистраторСистемы, ПолныеПрава") Тогда
		Элементы.Номер.Доступность = Истина;
		Элементы.Номер.ТолькоПросмотр = Ложь;
	КонецЕсли;
	// }Рарус adilas #13392 -Номер документа 2021.02.12
	
КонецПроцедуры
// }Рарус adilas #10010 -Переделать документы для указания нескольких спортсменов 2020.10.07

// {Рарус adilas #10010 -Переделать документы для указания нескольких спортсменов 2020.10.07
// Замена на ТЧ
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// {Рарус kotana #10010 -Переделать документы для указания нескольких спортсменов 2020.10.08
	Если ПараметрыЗаписи.Свойство("РежимЗаписи") И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	
		ПроверитьДатуПодтверждения();	
	
	КонецЕсли; 
	// }Рарус kotana #10010 -Переделать документы для указания нескольких спортсменов 2020.10.08
	
КонецПроцедуры

&НаСервере
Функция ПроверитьДатуПодтверждения()
	
	КолонкаСпортсмен = Объект.Спортсмены.Выгрузить(, "Спортсмен, ДатаПодтверждения, ДатаПрисвоения");
	
	Для Каждого Строка Из КолонкаСпортсмен Цикл
		Если Строка.ДатаПодтверждения = Дата(1, 1, 1) Тогда
			Строка.ДатаПодтверждения = ДобавитьМесяц(Строка.ДатаПрисвоения, 24);
			
			Возврат Строка.ДатаПодтверждения;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции
// }Рарус adilas #10010 -Переделать документы для указания нескольких спортсменов 2020.10.07

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСпортсмены

&НаКлиенте
Процедура СпортсменыСпортсменНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	// {Рарус dotere #22457 -Проверка на дату не нужна  2021.11.19
	//Если Объект.ДатаПодтверждающегоДокумента = Дата(1, 1, 1) Тогда
	//	// {Рарус adilas #22503 -Присвоение/подтверждение разряда. Подбор спортсмена из списка.  2021.11.18
	//	Сообщение = Новый СообщениеПользователю();
	//	Сообщение.Текст = НСтр("ru = 'Укажите дату приказа!'");
	//	Сообщение.ПутьКДанным = "Объект";
	//	Сообщение.Поле = "ДатаПодтверждающегоДокумента";
	//	Сообщение.Сообщить();
	//	Возврат;
	//	// }Рарус adilas #22503 -Присвоение/подтверждение разряда. Подбор спортсмена из списка.  2021.11.18
	//Иначе
	// }Рарус dotere #22457 -Проверка на дату не нужна  2021.11.19
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Укажите организацию!'");
	    Сообщение.ПутьКДанным = "Объект";
		Сообщение.Поле = "Организация";
		Сообщение.Сообщить();
		Возврат;
	Иначе
		ПараметрыФормы.Вставить("ДатаСреза", УчетСпортсменовВызовСервера.ТекущаяДатаНаСервере());
	    ПараметрыФормы.Вставить("Организация", Объект.Организация);
	КонецЕсли;

	ПараметрыФормы.Вставить("ТолькоВыбор", Истина);
	ОбработчикВыбора = Новый ОписаниеОповещения("СпортсменНачалоВыбораЗавершение", ЭтотОбъект);
		
	ОткрытьФорму("Справочник.Спортсмены.Форма.ФормаВыбораСоставУчащихся", ПараметрыФормы, ЭтаФорма, , , , ОбработчикВыбора);
	
КонецПроцедуры

// {Рарус adilas #10010 -Переделать документы для указания нескольких спортсменов 2020.10.07
// Замена на ТЧ
&НаКлиенте
Процедура СпортсменыРазрядПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ЗаполнитьСрокДействияКлиент();
КонецПроцедуры

&НаКлиенте
Процедура СпортсменыДатаПрисвоенияПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ЗаполнитьСрокДействияКлиент();
КонецПроцедуры
// }Рарус adilas #10010 -Переделать документы для указания нескольких спортсменов 2020.10.07

// {Рарус adilas #10240 -Кнопка заполнения даты 2020.10.15
//
&НаКлиенте
Процедура СпортсменыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование) 
	
	Если ЗначениеЗаполнено(Объект.ДатаПодтверждающегоДокумента) Тогда
		Если НоваяСтрока Тогда
			Элемент.ТекущиеДанные.ДатаПрисвоения = Объект.ДатаПодтверждающегоДокумента;
			// Элемент.ТекущиеДанные.ДатаСледующегоПодтверждения = ЗаполнитьСрокДействияСервер(Элемент.ТекущиеДанные.Разряд, Объект.ДатаПодтверждающегоДокумента);
		Иначе
			Элемент.ТекущиеДанные.ДатаПрисвоения = Объект.ДатаПодтверждающегоДокумента;
			// Элемент.ТекущиеДанные.ДатаСледующегоПодтверждения = ЗаполнитьСрокДействияСервер(Элемент.ТекущиеДанные.Разряд, Объект.ДатаПодтверждающегоДокумента);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
// }Рарус adilas #10240 -Кнопка заполнения даты 2020.10.15

#КонецОбласти

#Область ОбработчикиКомандФормы

// {Рарус adilas #10240 -Кнопка заполнения даты 2020.10.15
//
&НаКлиенте
Процедура ЗаполнитьДатой(Команда)
	// Вставить содержимое обработчика.
	Оповещение = Новый ОписаниеОповещения("ПослеВводаДаты", ЭтотОбъект);
 
    ПоказатьВводДаты(Оповещение, , "Введите дату присвоения");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДаты(Дата, Параметры) Экспорт
 
	Если Не Дата = Неопределено Тогда
		
		Для Каждого Строка Из Объект.Спортсмены Цикл
			Строка.ДатаПрисвоения = Дата;
			Строка.ДатаПодтверждения = ЗаполнитьСрокДействияСервер(Строка.Разряд, Дата);  
		КонецЦикла;
		
    КонецЕсли;
 
КонецПроцедуры
// }Рарус adilas #10240 -Кнопка заполнения даты 2020.10.15

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// {Рарус adilas #22503 -Присвоение/подтверждение разряда. Подбор спортсмена из списка.  2021.11.18
&НаКлиенте
Процедура СпортсменНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт  
	
	Если НЕ Результат = Неопределено Тогда
		
		ТекущийСпортсмен = Элементы.Спортсмены.ТекущиеДанные;
		ТекущийСпортсмен.Спортсмен = Результат.Спортсмен;
		
	КонецЕсли;
	
КонецПроцедуры
// }Рарус adilas #22503 -Присвоение/подтверждение разряда. Подбор спортсмена из списка.  2021.11.18

&НаКлиенте
Процедура СогласиеНаОбработкуПерсональныхДанныхПолученоЗавершение(Результат, ДопПараметры) Экспорт
	
	ПроводитьБезПроверки = Истина;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ПараметрыФормы = Новый Структура("Субъект, ДатаСогласия", Объект.Спортсмен, Объект.ДатаПрисвоения);
		
		ОткрытьФорму("Документ.СогласиеНаОбработкуПерсональныхДанных.Форма.ФормаДокумента", 
		   ПараметрыФормы, 
		   ЭтаФорма,,,,,
		   РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		   
	Иначе
		
		ЭтотОбъект.Записать(ДопПараметры);
		
	КонецЕсли;	
	
КонецПроцедуры	

// {Рарус adilas #10010 -Переделать документы для указания нескольких спортсменов 2020.10.07
// Замена на ТЧ
&НаКлиенте
Процедура ЗаполнитьСрокДействияКлиент()
	
	ТекущиеДанные = Элементы.Спортсмены.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Разряд) И ЗначениеЗаполнено(ТекущиеДанные.ДатаПрисвоения) Тогда
		
		ТекущиеДанные.ДатаПодтверждения = ЗаполнитьСрокДействияСервер(ТекущиеДанные.Разряд, ТекущиеДанные.ДатаПрисвоения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСрокДействияСервер(Разряд, ДатаПрисвоения)

	ПродолжительностьЛет = Разряд.СрокДействия;
	МесяцевВГоду = 12;
	ЧислоМесяцев = МесяцевВГоду * ПродолжительностьЛет;
	ДатаПодтверждения = НачалоДня(ДобавитьМесяц(ДатаПрисвоения, ЧислоМесяцев) -1);
	
	Возврат ДатаПодтверждения;
	  
КонецФункции
// }Рарус adilas #10010 -Переделать документы для указания нескольких спортсменов 2020.10.07

#КонецОбласти