
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("ТипСоревнования", ПредопределенноеЗначение("Перечисление.ТипыСдачиНормативов.Соревнование"));
	ОткрытьФорму("Документ.СоревнованиеОФПСдачаНормативов.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
    Оповестить("ИзменениеТипаСоревнования", ПараметрыФормы);
	
КонецПроцедуры
