
#Область ОбработчикиСобытий

// {Рарус adilas #18232 -Тестирование релиза Альфа СПОРТ 1.0.0.3. Анализ соревновательной деятельности 2021.07.08
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПараметрСКДПериод   			= Новый ПараметрКомпоновкиДанных("Период");
	ЗначениеПараметрСКДПериод 		= ТекущаяДатаСеанса();
	//ПараметрСКДОрганизация    		= Новый ПараметрКомпоновкиДанных("Организация");
	//ЗначениеПараметрСКДОрганизация 	= ПараметрыСеанса.ТекущаяОрганизация;
		
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрСКДПериод, ЗначениеПараметрСКДПериод);
	//КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрСКДОрганизация, ЗначениеПараметрСКДОрганизация);
	
КонецПроцедуры
// }Рарус adilas #18232 -Тестирование релиза Альфа СПОРТ 1.0.0.3. Анализ соревновательной деятельности 2021.07.08

#КонецОбласти