
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ПараметрыСеанса.ТекущаяОрганизация.Пустая() Тогда
		Элементы.ФормаСоздать.Видимость = Истина;
	Иначе
		Элементы.ФормаСоздать.Видимость = Ложь;
	КонецЕсли;

	Если Параметры.Свойство("ОтборПоОткрытомуУчебномуГоду") Тогда
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"УчебныйГодОткрыт",Истина,ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	ОткрытьФорму("Обработка.МастерЗаполненияУчебногоГода.Форма.Форма");
КонецПроцедуры

// {Рарус dotere #16311 -Открытие обработки мастера заполнения учебного года 2021.06.25
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ОткрытьФорму("Обработка.МастерЗаполненияУчебногоГода.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	Данные = Элементы.Список.ТекущаяСтрока;
	Параметр = новый Структура;
	Параметр.Вставить("УправлениеУчебнымГодом",Данные);
	
	ОткрытьФорму("Обработка.МастерЗаполненияУчебногоГода.Форма.Форма",Параметр);
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокУчебныхГодов" Тогда

		Элементы.Список.Обновить();

	КонецЕсли;

КонецПроцедуры
// }Рарус dotere #16311 -Открытие обработки мастера заполнения учебного года 2021.06.25
