
&НаКлиенте
Процедура Добавить(Команда)
	Если ДатаОкончания = Дата(1,1,1) Тогда
		ДатаОкончания = ДатаНачала;
	КонецЕсли;
	Если ДатаОкончания >= ДатаНачала Тогда
		Параметр = новый Структура;
		Параметр.Вставить("Соревнование",Соревнование);
		Параметр.Вставить("ВидСпорта",ВидСпорта);
		Параметр.Вставить("НаименованиеОрганизаторов",НаименованиеОрганизаторов);
		Параметр.Вставить("Финансирование",Финансирование);
		Параметр.Вставить("МестоПроведения",МестоПроведения);
		Параметр.Вставить("ДатаНачала",ДатаНачала);
		Параметр.Вставить("ДатаОкончания",ДатаОкончания);
		Параметр.Вставить("КоличествоУчастников",КоличествоУчастников);
		Параметр.Вставить("КоличествоТренеров",КоличествоТренеров);
		Параметр.Вставить("НомерСтроки",НомерСтроки);
		Параметр.Вставить("НомерСоревнования",НомерСоревнования);
		Параметр.Вставить("Город",Город);
		ЭтаФорма.Закрыть(Параметр);
	Иначе
		Предупреждение();
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура Предупреждение()
	ОбщегоНазначения.СообщитьПользователю("Некорректная дата окончания соревнования.");	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Соревнование") Тогда
		ВидСпорта = Параметры.ВидСпорта;
		НаименованиеОрганизаторов = Параметры.НаименованиеОрганизаторов;
		Финансирование = Параметры.Финансирование;
		МестоПроведения = Параметры.МестоПроведения;
		ДатаНачала = Параметры.ДатаНачала;
		ДатаОкончания = Параметры.ДатаОкончания;
		КоличествоУчастников = Параметры.КоличествоУчастников;
		КоличествоТренеров = Параметры.КоличествоТренеров;
		Соревнование = Параметры.Соревнование;
		НомерСтроки = Параметры.НомерСтроки;
		НомерСоревнования = Параметры.НомерСоревнования;
		Город = Параметры.Город;
	КонецЕсли;
	ПроверкаЗаполнения();
КонецПроцедуры
&НаСервере
Процедура ПроверкаЗаполнения()
	Если Соревнование.Пустая() ИЛИ ВидСпорта.Пустая() ИЛИ ПустаяСтрока(МестоПроведения)  ИЛИ
		ДатаНачала = Дата(1,1,1) ИЛИ КоличествоУчастников = 0 ИЛИ ПустаяСтрока(НомерСоревнования) Тогда
		Элементы.ФормаДобавить.Доступность = Ложь
	Иначе
		Элементы.ФормаДобавить.Доступность = Истина
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоревнованиеПриИзменении(Элемент)
	ПроверкаЗаполнения();
КонецПроцедуры

&НаКлиенте
Процедура ВидСпортаПриИзменении(Элемент)
	ПроверкаЗаполнения();
КонецПроцедуры
&НаКлиенте
Процедура МестоПроведенияПриИзменении(Элемент)
	ПроверкаЗаполнения();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ПроверкаЗаполнения();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоУчастниковПриИзменении(Элемент)
	ПроверкаЗаполнения();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоТренеровПриИзменении(Элемент)
	ПроверкаЗаполнения();
КонецПроцедуры

&НаКлиенте
Процедура НомерСоревнованияПриИзменении(Элемент)
	ПроверкаЗаполнения();
КонецПроцедуры