
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
        
        Если Параметры.Свойство("ВидСпортаПоРеестру") Тогда
            
            Объект.ВидСпортаПоРеестру = Параметры.ВидСпортаПоРеестру;
            
        КонецЕсли;
        
        Если Параметры.Свойство("Наименование") Тогда
            
            Объект.Наименование = Параметры.Наименование;
            
        КонецЕсли;
        
        Если Параметры.Свойство("Владелец") Тогда
            
            Объект.Владелец = Параметры.Владелец;
            
        Иначе
            
            Объект.Владелец = ПараметрыСеанса.ТекущаяОрганизация;
            
        КонецЕсли;	
        
    КонецЕсли;
    
КонецПроцедуры
