#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроведениеСоревнованийФормыКлиент.СформироватьЗаголовокФормыСписка(ЭтаФорма, "СоревнованиеОФПСдачаНормативов", ТипСоревнования);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТипСоревнования") Тогда
		ТипСоревнования = Параметры.ТипСоревнования;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеТипаСоревнования" Тогда
		ТипСоревнования = Параметр.ТипСоревнования;
		
		ПроведениеСоревнованийФормыКлиент.СформироватьЗаголовокФормыСписка(ЭтаФорма, "СоревнованиеОФПСдачаНормативов", ТипСоревнования);
	    УстановитьОтборНаДинамическийСписок();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийДинамическогоСписка

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ЗначениеЗаполнено(ТипСоревнования) И НЕ Копирование Тогда
	  Отказ = Истина;
	  ОткрытьФорму("Документ.СоревнованиеОФПСдачаНормативов.ФормаОбъекта", Новый Структура("ТипСоревнования",ТипСоревнования));
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборНаДинамическийСписок()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТипСоревнования", ТипСоревнования, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	
КонецПроцедуры	

#КонецОбласти