
&НаКлиенте
Процедура Организация1ПриИзменении(Элемент)
	этаформа.Список.Отбор.Элементы.Очистить();
	Если Не Организация.Пустая() Тогда
	НовЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация"); 
	НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НовЭлементОтбора.Использование = Истина;
	НовЭлементОтбора.ПравоеЗначение = Организация;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ПараметрыСеанса.ТекущаяОрганизация.Пустая() Тогда
		Элементы.Организация1.Видимость = Истина;
	Иначе
		Элементы.Организация1.Видимость = Ложь;
		Организация1 = ПараметрыСеанса.ТекущаяОрганизация;
	КонецЕсли
КонецПроцедуры
