&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)
	Настройки.Элементы[0].Значение = КонецГода(ТекущаяДатаСеанса());
КонецПроцедуры


&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	РезультатСтруктура = РаботаемСРасшифровкойНаСервере(Расшифровка);
	РезультатСтруктура.Вставить("Период", ПолучениеПараметровОтчета());
	РезультатСтруктура.Вставить("Организация", Организация());
	РезультатСтруктура.Вставить("ТекущаяДата", ТекущаяДатаОтчета());
	РезультатСтруктура.Вставить("НачалоГода", НачалоГода(ПолучениеПараметровОтчета()));
	РезультатСтруктура.Вставить("КонецГода", КонецГода(ПолучениеПараметровОтчета()));
	ОткрытьФорму("Отчет.ТренерскийСостав.Форма.ФормаРасшифровки", РезультатСтруктура, ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция РаботаемСРасшифровкойНаСервере(Расшифровка)
	
	РезультатСтруктура = Новый Структура;
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки); 
	Поля = Данные.Элементы.Получить(Расшифровка).ПолучитьПоля();
	Проход = 0;
	Для каждого Строка Из Поля Цикл
		Если Строка.Поле = "ВидСпорта" Тогда
			 РезультатСтруктура.Вставить("ВидСпорта", Строка.Значение);
		Иначе
			 РезультатСтруктура.Вставить(Строка.Поле, 1);
		КонецЕсли
	КонецЦикла;
	
	Возврат РезультатСтруктура;                        
КонецФункции

&НаСервере
Функция ПолучениеПараметровОтчета()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Возврат	ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение
КонецФункции

&НаСервере
Функция Организация()
	Возврат ПараметрыСеанса.ТекущаяОрганизация;
КонецФункции

&НаСервере
Функция ТекущаяДатаОтчета()
	Возврат ТекущаяДатаСеанса();
КонецФункции