

#Область Инициализация

// {Рарус adilas #-7843 -Регистр сведений Заявки на соревнования ОФП 2020.07.07
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"       	, ДокументСсылка);
	Запрос.УстановитьПараметр("Период"       	, ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("УчебныйГод"      , ДокументСсылка.УчебныйГод);
	Запрос.УстановитьПараметр("Организация"  	, ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("Тренер"       	, ДокументСсылка.Тренер);
	Запрос.УстановитьПараметр("ВидСпорта"    	, ДокументСсылка.ВидСпорта);
	Запрос.УстановитьПараметр("ТипСоревнования" , ДокументСсылка.ТипСоревнования);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	""ЗаявкиНаПроведениеСоревнованияОФПСдачаНормативов"" КАК ИмяРегистра_,
	                |	&Период КАК Период,
	                |	&УчебныйГод КАК УчебныйГод,
	                |	&Организация КАК Организация,
	                |	&Тренер КАК Тренер,
	                |	&ВидСпорта КАК ВидСпорта,
	                |	&ТипСоревнования КАК ТипСоревнования,
	                |	ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФПСоставУчастников.Спортсмен КАК Спортсмен,
	                |	ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФПСоставУчастников.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	                |	ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФПСоставУчастников.Норматив КАК Норматив
	                |ИЗ
	                |	Документ.ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФП.СоставУчастников КАК ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФПСоставУчастников
	                |ГДЕ
	                |	ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФПСоставУчастников.Ссылка = &Ссылка";
	
	
	ТаблицаЗаявкиНаПроведениеСоревнованияОФПСдачаНормативов = Запрос.Выполнить().Выгрузить();  
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаЗаявкиНаПроведениеСоревнованияОФПСдачаНормативов" , ТаблицаЗаявкиНаПроведениеСоревнованияОФПСдачаНормативов);
	
    ДополнительныеСвойства.Вставить("Отказ", Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФП.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФП.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ЗаявкаНаПроведениеСоревнованияСдачаНормативаОФП.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// }Рарус adilas #-7843 -Регистр сведений Заявки на соревнования ОФП 2020.07.07

#КонецОбласти

 