
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Настройки = КомпоновщикНастроек.Настройки;
	Период = Настройки.ПараметрыДанных.Элементы.Найти("Период");
    Организация = Настройки.ПараметрыДанных.Элементы.Найти("Организация");
    Организация.Значение = ПараметрыСеанса.ТекущаяОрганизация;
    Организация.Использование = Истина;
	НачалоГода = Настройки.ПараметрыДанных.Элементы.Найти("НачалоГода");
    НачалоГода.Значение = НачалоГода(Период.Значение);
    НачалоГода.Использование = Истина;
	КонецГода = Настройки.ПараметрыДанных.Элементы.Найти("КонецГода");
    КонецГода.Значение = КонецГода(Период.Значение);
    КонецГода.Использование = Истина;
	ТекущаяДата = Настройки.ПараметрыДанных.Элементы.Найти("ТекущаяДата");
    ТекущаяДата.Значение = ТекущаяДатаСеанса();
    ТекущаяДата.Использование = Истина;
КонецПроцедуры
